<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;19&#31456; &#12505;&#12473;&#12488;&#12539;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="example-mappings.html" title="&#31532;18&#31456; &#20363;&#65306;&#12356;&#12429;&#12356;&#12429;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;19&#31456; &#12505;&#12473;&#12488;&#12539;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="example-mappings.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;</td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="best-practices"></a>&#31532;19&#31456; &#12505;&#12473;&#12488;&#12539;&#12503;&#12521;&#12463;&#12486;&#12451;&#12473;</h2></div></div><div></div></div><div class="variablelist"><dl><dt><span class="term">&#32048;&#12363;&#12356;&#31890;&#24230;&#12391;&#12463;&#12521;&#12473;&#12434;&#26360;&#12365;&#12289;<tt class="literal">&lt;component&gt;</tt> &#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#20363;&#12360;&#12400; <tt class="literal">street</tt>&#65288;&#36890;&#12426;&#65289;, <tt class="literal">suburb</tt>
                    &#65288;&#37117;&#24066;&#65289;, <tt class="literal">state</tt> &#24030;&#65289;, <tt class="literal">postcode</tt> 
                    &#65288;&#37109;&#20415;&#30058;&#21495;&#65289;&#12391;&#27083;&#25104;&#12373;&#12428;&#12427; <tt class="literal">Address</tt>&#65288;&#20303;&#25152;&#65289;&#12463;&#12521;&#12473;&#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;
                    &#12381;&#12358;&#12377;&#12428;&#12400;&#12467;&#12540;&#12489;&#12364;&#20877;&#21033;&#29992;&#12375;&#12420;&#12377;&#12367;&#12394;&#12426;&#12289;&#12522;&#12501;&#12449;&#12463;&#12479;&#12522;&#12531;&#12464;&#12418;&#31777;&#21336;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
                </p></dd><dt><span class="term">&#27704;&#32154;&#12463;&#12521;&#12473;&#12395;&#12399;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12356;&#12367;&#12388;&#12418;&#12398;&#29702;&#30001;&#12363;&#12425;&#20351;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290;
                    &#12300;&#20154;&#24037;&#30340;&#12301;&#12391;&#65288;&#34987;&#29983;&#25104;&#12398;&#24847;&#21619;&#12290;&#12499;&#12472;&#12493;&#12473;&#19978;&#12398;&#24847;&#21619;&#12434;&#25345;&#12383;&#12394;&#12356;&#12371;&#12392;&#65289;&#12289;
                    &#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#22411;&#12391;&#12394;&#12356;&#35672;&#21029;&#23376;&#12434;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290;&#26580;&#36575;&#24615;&#12434;&#26368;&#22823;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;
                    <tt class="literal">java.lang.Long</tt> &#12414;&#12383;&#12399; <tt class="literal">java.lang.String</tt> 
                    &#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;
                </p></dd><dt><span class="term">&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#12463;&#12521;&#12473;&#12372;&#12392;&#12398;&#21029;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#20998;&#12369;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                     &#22823;&#12365;&#12356;&#19968;&#26522;&#23721;&#12398;&#12424;&#12358;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
                     &#20363;&#12360;&#12400; <tt class="literal">com.eg.Foo</tt> &#12463;&#12521;&#12473;&#12399;&#12289;
                     <tt class="literal">com/eg/Foo.hbm.xml</tt> &#12501;&#12449;&#12452;&#12523;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
                     &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;&#29305;&#12395;&#12481;&#12540;&#12512;&#12391;&#38283;&#30330;&#12434;&#34892;&#12358;&#22580;&#21512;&#12395;&#12289;&#33391;&#12356;&#32080;&#26524;&#12434;&#12418;&#12383;&#12425;&#12375;&#12414;&#12377;&#12290;
                </p></dd><dt><span class="term">&#12522;&#12477;&#12540;&#12473;&#12392;&#12375;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12399;&#23550;&#24540;&#12377;&#12427;&#12463;&#12521;&#12473;&#12539;&#12501;&#12449;&#12452;&#12523;&#12392;&#19968;&#32210;&#12395;&#37197;&#32622;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
                </p></dd><dt><span class="term">&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12434;&#22806;&#12395;&#20986;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12364;ANSI&#27161;&#28310;&#12391;&#12399;&#12394;&#12356;SQL&#38306;&#25968;&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#12394;&#12425;&#12289;&#12371;&#12428;&#12399;&#33391;&#12356;&#32722;&#24931;&#12391;&#12377;&#12290;
                    &#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12434;&#22806;&#12395;&#20986;&#12377;&#12392;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#20182;&#12408;&#31227;&#26893;&#12377;&#12427;&#12371;&#12392;&#12364;&#31777;&#21336;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
                </p></dd><dt><span class="term">&#12496;&#12452;&#12531;&#12489;&#22793;&#25968;&#12434;&#20351;&#12356;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                     JDBC&#12398;&#12424;&#12358;&#12395;&#12289;&#22793;&#21270;&#12377;&#12427;&#20516;&#12399;&#24517;&#12378;"?"&#12391;&#32622;&#12365;&#25563;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;
                     &#20855;&#20307;&#30340;&#12394;&#20516;&#12398;&#20195;&#20837;&#12395;&#25991;&#23383;&#21015;&#25805;&#20316;&#12434;&#20351;&#12387;&#12390;&#12399;&#12289;&#32118;&#23550;&#12395;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
                     &#21517;&#21069;&#12388;&#12365;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#20351;&#12358;&#12392;&#12373;&#12425;&#12395;&#33391;&#12356;&#12391;&#12377;&#12290;
                </p></dd><dt><span class="term">JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#33258;&#20998;&#12391;&#31649;&#29702;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;</span></dt><dd><p>
                    Hibernate&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#31649;&#29702;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
                    &#12375;&#12363;&#12375;&#12289;&#12371;&#12428;&#12399;&#26368;&#24460;&#12398;&#25163;&#27573;&#12384;&#12392;&#24605;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12418;&#12375;&#32068;&#12415;&#36796;&#12415;&#12398;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12369;&#12428;&#12400;&#12289;
                    <tt class="literal">net.sf.hibernate.connection.ConnectionProvider</tt> &#12398;&#23455;&#35013;&#12434;&#32771;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></dd><dt><span class="term">&#12459;&#12473;&#12479;&#12512;&#22411;&#12398;&#20351;&#29992;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#20363;&#12360;&#12400;&#12289;&#12393;&#12371;&#12363;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#12363;&#12425;&#25345;&#12387;&#12390;&#12365;&#12383;Java&#22411;&#12434;&#27704;&#32154;&#21270;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12392;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
                    &#12375;&#12363;&#12375;&#12381;&#12398;&#22411;&#12395;&#12399;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12375;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12394;&#12450;&#12463;&#12475;&#12469;&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12392;&#12375;&#12414;&#12377;&#12290;
                    &#12371;&#12398;&#12424;&#12358;&#12394;&#22580;&#21512;&#12399;&#12289;<tt class="literal">net.sf.hibernate.UserType</tt> &#12434;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12434;&#32771;&#12360;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
                    &#12381;&#12358;&#12377;&#12428;&#12400;&#12289;Hibernate&#22411;&#12392;&#12398;&#23455;&#35013;&#22793;&#25563;&#12434;&#24515;&#37197;&#12379;&#12378;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12467;&#12540;&#12489;&#12434;&#25201;&#12360;&#12414;&#12377;&#12290;
                </p></dd><dt><span class="term">&#12508;&#12488;&#12523;&#12493;&#12483;&#12463;&#12434;&#35299;&#28040;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;JDBC&#12434;&#12495;&#12531;&#12489;&#12539;&#12467;&#12540;&#12489;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#12471;&#12473;&#12486;&#12512;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12539;&#12463;&#12522;&#12486;&#12451;&#12459;&#12523;&#12394;&#38936;&#22495;&#12391;&#12399;&#12289;
                    &#65288;&#20363;&#12360;&#12400;&#22823;&#37327;&#12398; update / delete &#12398;&#12424;&#12358;&#12394;&#65289;&#12354;&#12427;&#31278;&#12398;&#25805;&#20316;&#12395;&#12399;&#12289;
                    &#30452;&#25509;JDBC&#12434;&#21033;&#29992;&#12377;&#12427;&#12392;&#33391;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
                    &#12375;&#12363;&#12375;&#12289;&#20309;&#12364;&#12508;&#12488;&#12523;&#12493;&#12483;&#12463;&#12394;&#12398;&#12363;&#12364; <span class="emphasis"><em>&#12431;&#12363;&#12427;</em></span> &#12414;&#12391;&#12399;&#24453;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12381;&#12375;&#12390;&#12289;&#30452;&#25509;JDBC&#12434;&#21033;&#29992;&#12377;&#12427;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;&#24517;&#12378;&#12375;&#12418;&#36895;&#12367;&#12394;&#12427;&#12392;&#12399;&#38480;&#12425;&#12394;&#12356;&#12371;&#12392;&#12418;&#29702;&#35299;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#30452;&#25509;JDBC&#12434;&#21033;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12428;&#12400;&#12289;Hibernate&#12398; <tt class="literal">Session</tt> &#12434;&#12458;&#12540;&#12503;&#12531;&#12375;&#12390;&#12289;
                    SQL&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12358;&#12392;&#33391;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12381;&#12428;&#12394;&#12425;&#12414;&#12384;&#21516;&#12376;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#25126;&#30053;&#12392;&#12289;
                    &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
                </p></dd><dt><span class="term"><tt class="literal">Session</tt> &#12398;&#12501;&#12521;&#12483;&#12471;&#12517;&#12434;&#29702;&#35299;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#12383;&#12414;&#12395;&#12289;Session&#12364;&#27704;&#32154;&#29366;&#24907;&#12434;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#21516;&#26399;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                    &#12375;&#12363;&#12375;&#12289;&#12418;&#12375;&#12371;&#12428;&#12364;&#38971;&#32321;&#12395;&#36215;&#12371;&#12427;&#12424;&#12358;&#12391;&#12399;&#12289;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12395;&#24433;&#38911;&#12364;&#20986;&#12390;&#12365;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
                    &#33258;&#21205;&#12501;&#12521;&#12483;&#12471;&#12517;&#12434;&#28961;&#21177;&#12395;&#12375;&#12383;&#12426;&#12289;&#29305;&#23450;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#12362;&#12369;&#12427;&#12463;&#12456;&#12522;&#12420;&#25805;&#20316;&#12398;&#38918;&#30058;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
                    &#19981;&#24517;&#35201;&#12394;&#12501;&#12521;&#12483;&#12471;&#12517;&#12434;&#26368;&#23567;&#38480;&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;    
                </p></dd><dt><span class="term">3&#23652;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12391;&#12399; <tt class="literal">saveOrUpdate()</tt> &#12398;&#20351;&#29992;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#12469;&#12540;&#12502;&#12524;&#12483;&#12488; / &#12475;&#12483;&#12471;&#12519;&#12531;&#12499;&#12540;&#12531;&#12539;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12434;&#20351;&#12358;&#12392;&#12365;&#12289;
                    &#12475;&#12483;&#12471;&#12519;&#12531;&#12499;&#12540;&#12531;&#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12289;
                    &#12469;&#12540;&#12502;&#12524;&#12483;&#12488; / JSP&#23652;&#12392;&#12398;&#38291;&#12391;&#12420;&#12426;&#12392;&#12426;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
                    &#12381;&#12398;&#38555;&#12289;&#21508;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#23550;&#12375;&#12390;&#26032;&#12375;&#12356;Session&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12381;&#12375;&#12390;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#27704;&#32154;&#29366;&#24907;&#12434;&#26356;&#26032;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;
                    <tt class="literal">Session.update()</tt> &#12420; <tt class="literal">Session.saveOrUpdate()</tt> &#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></dd><dt><span class="term">2&#23652;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12391;&#12399;Session&#12398;&#20999;&#26029;&#12398;&#20351;&#29992;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#26368;&#39640;&#12398;&#12473;&#12465;&#12540;&#12521;&#12499;&#12522;&#12486;&#12451;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12391;&#12365;&#12427;&#12384;&#12369;&#30701;&#12367;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
                    &#12375;&#12363;&#12375;&#12289;&#12518;&#12540;&#12470;&#12363;&#12425;&#35211;&#12383;1&#12388;&#12398;&#20181;&#20107;&#12395;&#23550;&#12375;&#12390;&#12289;&#38263;&#12356;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#23455;&#35013;&#12377;&#12427;
                    &#24517;&#35201;&#12364;&#12354;&#12427;&#12371;&#12392;&#12364;&#12375;&#12400;&#12375;&#12400;&#12391;&#12377;&#12290;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;
                    &#12463;&#12521;&#12452;&#12450;&#12531;&#12488;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12392;&#12524;&#12473;&#12509;&#12531;&#12473;&#12398;&#12469;&#12452;&#12463;&#12523;&#12434;&#12289;&#12356;&#12367;&#12388;&#12363;&#12414;&#12383;&#12368;&#12418;&#12398;&#12395;&#12394;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
                    &#20999;&#12426;&#38626;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20351;&#12358;&#12363;&#12289;2&#23652;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12395;&#12362;&#12356;&#12390;&#12399;&#12289;
                    &#21336;&#12395;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;Hibernate Session&#12434;&#20999;&#26029;&#12375;&#12289;&#21508;&#24460;&#32154;&#12398;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#12399;&#12381;&#12428;&#12434;&#20877;&#25509;&#32154;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#35079;&#25968;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12518;&#12540;&#12473;&#12465;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390;&#12289;
                    1&#12388;&#12398;Session&#12434;&#20351;&#12356;&#12414;&#12431;&#12377;&#12371;&#12392;&#12399;&#12420;&#12417;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12381;&#12358;&#12391;&#12394;&#12369;&#12428;&#12400;&#12289;&#21476;&#12367;&#12394;&#12387;&#12383;&#12487;&#12540;&#12479;&#12434;&#20351;&#12358;&#12371;&#12392;&#12395;&#12394;&#12387;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
                </p></dd><dt><span class="term">&#20363;&#22806;&#12434;&#24489;&#24112;&#21487;&#33021;&#12394;&#12418;&#12398;&#12392;&#12375;&#12390;&#25201;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;</span></dt><dd><p>
                    &#12371;&#12428;&#12399;&#12300;&#26368;&#12418;&#33391;&#12356;&#12301;&#32722;&#24931;&#20197;&#19978;&#12398;&#12289;&#24517;&#38920;&#12398;&#32722;&#24931;&#12391;&#12377;&#12290;
                    &#20363;&#22806;&#12364;&#30330;&#29983;&#12375;&#12383;&#12392;&#12365;&#12399;&#12289;<tt class="literal">Transaction</tt> &#12434;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12375;&#12390;&#12289;
                    <tt class="literal">Session</tt> &#12434;&#12463;&#12525;&#12540;&#12474;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12381;&#12358;&#12391;&#12394;&#12369;&#12428;&#12400;&#12289;Hibernate&#12399;&#12513;&#12514;&#12522;&#12398;&#29366;&#24907;&#12364;&#27704;&#32154;&#29366;&#24907;&#12434;&#27491;&#30906;&#12395;&#34920;&#29694;&#12375;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
                    &#29305;&#21029;&#12394;&#22580;&#21512;&#12392;&#12375;&#12390;&#12289;&#19982;&#12360;&#12425;&#12428;&#12383;&#35672;&#21029;&#23376;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23384;&#22312;&#12377;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
                    <tt class="literal">Session.load()</tt> &#12434;&#20351;&#12358;&#12371;&#12392;&#12399;&#12420;&#12417;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12381;&#12398;&#20195;&#12431;&#12426;&#12395; <tt class="literal">find()</tt> &#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12375;&#12363;&#12375;&#12289;&#20363;&#12360;&#12400; <tt class="literal">StaleObjectStateException</tt> &#12420; 
                    <tt class="literal">ObjectNotFoundException</tt> &#12398;&#12424;&#12358;&#12395;&#12289;&#24489;&#24112;&#21487;&#33021;&#12394;&#20363;&#22806;&#12418;&#12356;&#12367;&#12388;&#12363;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
                </p></dd><dt><span class="term">&#38306;&#36899;&#12434;&#12501;&#12455;&#12483;&#12481;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#12391;&#12365;&#12427;&#12384;&#12369;lazy&#12434;&#36984;&#12403;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p><a name="best-practices-p14"></a>
                    eager&#12394;&#65288;&#12450;&#12454;&#12479;&#12540;&#65381;&#12472;&#12519;&#12452;&#12531;&#65289;&#12501;&#12455;&#12483;&#12481;&#12399;&#25511;&#12360;&#12417;&#12395;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    JVM&#12524;&#12505;&#12523;&#12391;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12394;&#12356;&#12463;&#12521;&#12473;&#12408;&#12398;&#12411;&#12392;&#12435;&#12393;&#12398;&#38306;&#36899;&#12395;&#12399;&#12289;&#12503;&#12525;&#12461;&#12471;&#12420;lazy&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12427;&#12463;&#12521;&#12473;&#12408;&#12398;&#38306;&#36899;&#12289;&#12388;&#12414;&#12426;&#12461;&#12515;&#12483;&#12471;&#12517;&#12364;&#12498;&#12483;&#12488;&#12377;&#12427;&#21487;&#33021;&#24615;&#12364;&#39640;&#12356;&#38306;&#36899;&#12395;&#12399;&#12289;
                    <tt class="literal">outer-join="false"</tt> &#12392;&#12375;&#12390;&#26126;&#31034;&#30340;&#12395;eager&#12394;&#12501;&#12455;&#12483;&#12481;&#12434;&#28961;&#21177;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12354;&#12427;&#29305;&#23450;&#12398;&#12518;&#12540;&#12473;&#12465;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390;&#12450;&#12454;&#12479;&#12540;&#65381;&#12472;&#12519;&#12452;&#12531;&#12395;&#12424;&#12427;&#12501;&#12455;&#12483;&#12481;&#12364;&#36969;&#20999;&#12394;&#12392;&#12365;&#12399;&#12289;
                    <tt class="literal">left join</tt> &#12434;&#29992;&#12356;&#12383;&#12463;&#12456;&#12522;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></dd><dt><span class="term">&#12499;&#12472;&#12493;&#12473;&#12539;&#12525;&#12472;&#12483;&#12463;&#12434;Hibernate&#12363;&#12425;&#25277;&#35937;&#21270;&#12377;&#12427;&#12371;&#12392;&#12434;&#32771;&#12360;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#20351;&#12356;&#12289;&#65288;Hibernate&#12398;&#65289;&#12487;&#12540;&#12479;&#12539;&#12450;&#12463;&#12475;&#12473;&#12467;&#12540;&#12489;&#12434;&#38560;&#34109;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    <span class="emphasis"><em>DAO</em></span> &#12392; <span class="emphasis"><em>Thread Local Session</em></span> &#12497;&#12479;&#12540;&#12531;&#12434;&#32068;&#12415;&#21512;&#12431;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    <tt class="literal">UserType</tt> &#12434;&#36890;&#12375;&#12390;Hibernate&#12395;&#38306;&#36899;&#20184;&#12369;&#12427;&#12371;&#12392;&#12391;&#12289;
                    &#12495;&#12531;&#12489;&#12539;&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#12375;&#12383;JDBC&#12391;&#27704;&#32154;&#21270;&#12377;&#12427;&#12463;&#12521;&#12473;&#12434;&#25345;&#12388;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
                    &#65288;&#12371;&#12398;&#12450;&#12489;&#12496;&#12452;&#12473;&#12399;&#12300;&#21313;&#20998;&#22823;&#12365;&#12394;&#12301;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12398;&#12418;&#12398;&#12391;&#12377;&#12290;
                    &#12388;&#12414;&#12426;&#12486;&#12540;&#12502;&#12523;&#12434;5&#20491;&#12375;&#12363;&#20351;&#12431;&#12394;&#12356;&#65288;&#23567;&#12373;&#12394;&#65289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12399;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12379;&#12435;&#12290;&#65289;
                </p></dd><dt><span class="term">&#12518;&#12491;&#12540;&#12463;&#12394;&#12499;&#12472;&#12493;&#12473;&#12539;&#12461;&#12540;&#12434;&#20351;&#12356;&#12289;<tt class="literal">equals()</tt> &#12392; <tt class="literal">hashCode()</tt> &#12434;&#23455;&#35013;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;</span></dt><dd><p>
                    &#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503;&#12398;&#22806;&#12391;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27604;&#36611;&#12377;&#12427;&#12394;&#12425;&#12289;
                    <tt class="literal">equals()</tt> &#12392; <tt class="literal">hashCode()</tt> &#12434;&#23455;&#35013;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
                    &#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12473;&#12467;&#12540;&#12503;&#12398;&#20869;&#37096;&#12391;&#12399;&#12289;Java&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#20445;&#35388;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
                    &#12371;&#12428;&#12425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#23455;&#35013;&#12377;&#12427;&#12394;&#12425;&#12289;&#27770;&#12375;&#12390;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#35672;&#21029;&#23376;&#12434;&#20351;&#12387;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
                    &#19968;&#26178;&#30340;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#35672;&#21029;&#23376;&#12398;&#20516;&#12434;&#25345;&#12383;&#12394;&#12356;&#12383;&#12417;&#12289;Hibernate&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12475;&#12540;&#12502;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#20516;&#12434;&#20195;&#20837;&#12375;&#12414;&#12377;&#12290;
                    &#12418;&#12375;&#12475;&#12540;&#12502;&#26178;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;set&#12398;&#20013;&#12395;&#12354;&#12427;&#12392;&#12289;&#12495;&#12483;&#12471;&#12517;&#12539;&#12467;&#12540;&#12489;&#12364;&#22793;&#26356;&#12373;&#12428;&#12289;
                    &#22865;&#32004;&#12364;&#30772;&#12425;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
                    <tt class="literal">equals()</tt> &#12392; <tt class="literal">hashCode()</tt> &#12434;&#23455;&#35013;&#12377;&#12427;&#12395;&#12399;&#12289;
                    &#12518;&#12491;&#12540;&#12463;&#12394;&#12499;&#12472;&#12493;&#12473;&#12539;&#12461;&#12540;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12388;&#12414;&#12426;&#12463;&#12521;&#12473;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12518;&#12491;&#12540;&#12463;&#12394;&#32068;&#12415;&#21512;&#12431;&#12379;&#12434;&#27604;&#36611;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;set&#12398;&#20869;&#37096;&#12395;&#12354;&#12427;&#38291;&#12289;&#12371;&#12398;&#12461;&#12540;&#12399;&#23433;&#23450;&#12391;&#12518;&#12491;&#12540;&#12463;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12434;&#35226;&#12360;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;
                    &#65288;&#12521;&#12452;&#12501;&#12479;&#12452;&#12512;&#20840;&#20307;&#12391;&#12394;&#12367;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#20027;&#12461;&#12540;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#23433;&#23450;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#65289;&#12290;
                    <tt class="literal">equals()</tt> &#12398;&#27604;&#36611;&#65288;lazy&#12525;&#12540;&#12487;&#12451;&#12531;&#12464;&#65289;&#12398;&#20013;&#12391;&#12399;&#12289;&#32118;&#23550;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12431;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12381;&#12375;&#12390;&#12289;&#12503;&#12525;&#12461;&#12471;&#12434;&#20171;&#12377;&#12427;&#20182;&#12398;&#38306;&#36899;&#12463;&#12521;&#12473;&#12395;&#12388;&#12356;&#12390;&#12418;&#12289;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></dd><dt><span class="term">&#22806;&#26469;&#12398;&#38306;&#36899;&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#20351;&#12431;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;</span></dt><dd><p>
                    &#29694;&#23455;&#12395;&#12399;&#12289;many-to-many&#38306;&#36899;&#12398;&#20351;&#12356;&#12393;&#12371;&#12429;&#12399;&#12417;&#12387;&#12383;&#12395;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                    &#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512;&#12300;&#12522;&#12531;&#12463;&#12539;&#12486;&#12540;&#12502;&#12523;&#12301;&#12395;&#20184;&#21152;&#30340;&#12394;&#24773;&#22577;&#12364;&#24517;&#35201;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
                    &#12371;&#12398;&#22580;&#21512;&#12289;&#38291;&#12398;&#12522;&#12531;&#12463;&#12539;&#12463;&#12521;&#12473;&#12395;2&#12388;&#12398;one-to-many&#38306;&#36899;&#12434;&#20351;&#12358;&#26041;&#12364;&#12378;&#12387;&#12392;&#33391;&#12356;&#12391;&#12377;&#12290;
                    &#23455;&#38555;&#12395;&#31169;&#12383;&#12385;&#12399;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;&#38306;&#36899;&#12364;one-to-many&#12363;many-to-one&#12384;&#12392;&#32771;&#12360;&#12390;&#12356;&#12414;&#12377;&#12290;
                    &#20182;&#12398;&#38306;&#36899;&#12434;&#20351;&#12358;&#12394;&#12425;&#12289;&#27880;&#24847;&#28145;&#12367;&#12289;&#12381;&#12428;&#12363;&#12425;&#12381;&#12428;&#12364;&#26412;&#24403;&#12395;&#24517;&#35201;&#12363;&#12393;&#12358;&#12363;&#12434;&#32771;&#12360;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></dd></dl></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="example-mappings.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right">&nbsp;</td></tr><tr><td width="40%" align="left" valign="top">&#31532;18&#31456; &#20363;&#65306;&#12356;&#12429;&#12356;&#12429;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;</td></tr></table></div></body></html>