<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;6&#31456; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="mapping.html" title="&#31532;5&#31456; O/R&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#22522;&#26412;"><link rel="next" href="components.html" title="&#31532;7&#31456; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;6&#31456; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="mapping.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="components.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="collections"></a>&#31532;6&#31456; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</h2></div></div><div></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-persistent"></a>6.1. &#27704;&#32154;&#24615;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;</h2></div></div><div></div></div><p>
            &#12371;&#12398;&#31680;&#12399;Java&#12398;&#12467;&#12540;&#12489;&#20363;&#12434;&#12354;&#12414;&#12426;&#21547;&#12435;&#12391;&#12356;&#12414;&#12379;&#12435;&#12290;Java&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12398;&#20351;&#29992;&#27861;&#12399;&#26082;&#12395;&#30693;&#12387;&#12390;&#12356;&#12427;&#12418;&#12398;&#12392;&#12375;&#12414;&#12377;&#12290;&#12418;&#12375;&#26082;&#12395;&#20351;&#29992;&#27861;&#12434;&#30693;&#12387;&#12390;&#12356;&#12427;&#12394;&#12425;&#12289;&#12381;&#12428;&#20197;&#19978;&#30693;&#12387;&#12390;&#12362;&#12367;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12356;&#12388;&#12418;&#12398;&#26041;&#27861;&#12391;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><p>
            Hibernate&#12399;<tt class="literal">java.util.Map</tt>,
            <tt class="literal">java.util.Set</tt>,
            <tt class="literal">java.util.SortedMap</tt>,
            <tt class="literal">java.util.SortedSet</tt>,
            <tt class="literal">java.util.List</tt>,&#12381;&#12375;&#12390;&#12393;&#12435;&#12394;&#27704;&#32154;&#24615;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12420;&#20516;&#12398;&#37197;&#21015;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12418;&#27704;&#32154;&#21270;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290; <tt class="literal">java.util.Collection</tt> &#12420;
            <tt class="literal">java.util.List</tt>&#22411;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;"bag"&#12392;&#12375;&#12390;&#27704;&#32154;&#21270;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><p>
            &#35686;&#21578;:&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#27704;&#32154;&#21270;&#12399;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65381;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#12463;&#12521;&#12473;&#12395;&#12424;&#12387;&#12390;&#21152;&#12360;&#12425;&#12428;&#12383;&#20313;&#20998;&#12394;&#21205;&#20316;(&#20363;&#12360;&#12400;<tt class="literal">LinkedHashSet</tt>&#12398;&#21453;&#24489;&#38918;&#24207;)&#12399;&#20445;&#25345;&#12375;&#12414;&#12379;&#12435;&#12290;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#27704;&#32154;&#21270;&#12399;&#23455;&#38555;&#12395;&#12381;&#12428;&#12382;&#12428;<tt class="literal">HashMap</tt>,
            <tt class="literal">HashSet</tt>,
            <tt class="literal">TreeMap</tt>,
            <tt class="literal">TreeSet</tt> &#12362;&#12424;&#12403;
            <tt class="literal">ArrayList</tt>&#12398;&#27096;&#12395;&#25391;&#33310;&#12356;&#12414;&#12377;&#12290;&#26356;&#12395;&#35328;&#12360;&#12400;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20445;&#25345;&#12377;&#12427;&#23646;&#24615;&#12398;Java&#12398;&#22411;&#12399;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#22411;&#12391;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;(&#12388;&#12414;&#12426;<tt class="literal">HashMap</tt>, <tt class="literal">TreeSet</tt> ,
            <tt class="literal">ArrayList</tt>&#12391;&#12399;&#12394;&#12367;&#12289;<tt class="literal">Map</tt>, <tt class="literal">Set</tt> &#12420;
            <tt class="literal">List</tt>&#12391;&#12394;&#12367;&#12390;&#12399;&#12394;&#12425;&#12394;&#12356;)&#12290;Hibernate&#12399;&#30693;&#12425;&#12394;&#12356;&#38291;&#12395;<tt class="literal">Map</tt>, <tt class="literal">Set</tt>
            , <tt class="literal">List</tt>&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;<tt class="literal">Map</tt>, <tt class="literal">Set</tt> , <tt class="literal">List</tt>&#12398;&#27704;&#32154;&#21270;&#27231;&#33021;&#12434;&#23455;&#35013;&#12375;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#21462;&#12426;&#26367;&#12360;&#12427;&#12398;&#12391;&#12371;&#12398;&#21046;&#38480;&#12364;&#23384;&#22312;&#12375;&#12414;&#12377;(&#24467;&#12387;&#12390;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#19978;&#12391;==&#12434;&#20351;&#29992;&#12377;&#12427;&#22580;&#21512;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;
        </p><pre class="programlisting">Cat cat &lt;literal&gt;==&lt;/literal&gt; new DomesticCat();
Cat kitten = new DomesticCat();
....
Set kittens = new HashSet();
kittens.add(kitten);
cat.setKittens(kittens);
session.save(cat);
kittens = cat.getKittens(); //Okay, kittens collection is a Set
(HashSet) cat.getKittens(); //Error!</pre><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#12496;&#12522;&#12517;&#12540;&#12479;&#12452;&#12503;&#12398;&#36890;&#24120;&#12398;&#35215;&#21063;&#12395;&#24467;&#12356;&#12414;&#12377;&#12290;&#12388;&#12414;&#12426;&#12289;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;&#19968;&#32210;&#12395;&#29983;&#25104;&#12289;&#21066;&#38500;&#12373;&#12428;&#12383;&#21442;&#29031;&#12399;&#20849;&#26377;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12514;&#12487;&#12523;&#12434;&#12505;&#12540;&#12473;&#12395;&#12375;&#12390;&#12356;&#12427;&#12383;&#12417;null&#20516;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12379;&#12435;&#12290;&#12388;&#12414;&#12426;Hibernate&#12399;&#21442;&#29031;&#20808;&#12398;&#28961;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;&#31354;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#35211;&#20998;&#12369;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#27704;&#32154;&#24615;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#21442;&#29031;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#33258;&#21205;&#30340;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12289;&#27704;&#32154;&#24615;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#21442;&#29031;&#12373;&#12428;&#12394;&#12367;&#12394;&#12387;&#12383;&#12392;&#12365;&#12395;&#33258;&#21205;&#30340;&#12395;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;&#12418;&#12375;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#12354;&#12427;&#27704;&#32154;&#24615;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#20182;&#12398;&#27704;&#32154;&#24615;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#28193;&#12373;&#12428;&#12383;&#12394;&#12425;&#12289;&#12381;&#12398;&#35201;&#32032;&#12399;&#12354;&#12427;&#12486;&#12540;&#12502;&#12523;&#12363;&#12425;&#21029;&#12398;&#12486;&#12540;&#12502;&#12523;&#12408;&#31227;&#21205;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12371;&#12392;&#12395;&#12388;&#12356;&#12390;&#12354;&#12414;&#12426;&#24515;&#37197;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#26222;&#36890;&#12398;Java&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12358;&#12398;&#12392;&#21516;&#12376;&#26041;&#27861;&#12391;Hibernate&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12375;&#12363;&#12375;Hibernate&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12377;&#12427;&#21069;&#12395;&#12289;&#24460;&#36848;&#12377;&#12427;&#21452;&#26041;&#21521;&#38306;&#36899;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12434;&#12365;&#12385;&#12435;&#12392;&#29702;&#35299;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#20869;&#12391;&#25152;&#26377;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#22806;&#37096;&#12461;&#12540;&#12395;&#12424;&#12387;&#12390;&#35672;&#21029;&#12373;&#12428;&#12414;&#12377;&#12290;
&#12371;&#12398;&#22806;&#37096;&#12461;&#12540;&#12399;<span class="emphasis"><em>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65381;&#12461;&#12540;</em></span>&#12392;&#21628;&#12400;&#12428;&#12414;&#12377;&#12290;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65381;&#12461;&#12540;&#12399;<tt class="literal">&lt;key&gt;</tt>&#35201;&#32032;&#12395;&#12424;&#12387;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290;
        </p><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#22522;&#26412;&#22411;&#12289;&#12459;&#12473;&#12479;&#12512;&#22411;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#22411;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12384;&#12369;&#12391;&#12394;&#12367;&#12289;&#12411;&#12392;&#12435;&#12393;&#12398;Hibernate&#22411;&#12434;&#26684;&#32013;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#20869;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;"&#20516;&#28193;&#12375;"&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12391;&#25201;&#12431;&#12428;&#12427;&#12363;(&#12381;&#12398;&#12383;&#12417;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#25152;&#26377;&#32773;&#12395;&#23436;&#20840;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;)&#12289;&#12414;&#12383;&#12399;&#33258;&#36523;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12434;&#20351;&#12387;&#12390;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#12398;&#21442;&#29031;&#12391;&#12354;&#12426;&#12360;&#12414;&#12377;&#12290;&#12371;&#12398;&#12371;&#12392;&#12399;&#37325;&#35201;&#12394;&#23450;&#32681;&#12391;&#12377;&#12290;&#12414;&#12383;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#20182;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#26684;&#32013;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#26684;&#32013;&#12373;&#12428;&#12427;&#22411;&#12399;<span class="emphasis"><em>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#35201;&#32032;&#22411;</em></span>&#12392;&#12424;&#12400;&#12428;&#12414;&#12377;&#12290;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032;&#12399;&#12289;<tt class="literal">&lt;element&gt;</tt>, <tt class="literal">&lt;composite-element&gt;</tt>,
            <tt class="literal">&lt;one-to-many&gt;</tt>, <tt class="literal">&lt;many-to-many&gt;</tt> &#12354;&#12427;&#12356;&#12399;
            <tt class="literal">&lt;many-to-any&gt;</tt>&#12395;&#12424;&#12387;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290;&#26368;&#21021;&#12398;2&#12388;&#12399;&#20516;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12391;&#35201;&#32032;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12289;&#12354;&#12392;&#12398;3&#12388;&#12399;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#38306;&#36899;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">Set</tt>&#12392;bag&#12434;&#38500;&#12367;&#12377;&#12409;&#12390;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#22411;&#12399;&#12289;&#37197;&#21015;&#12414;&#12383;&#12399;<tt class="literal">List</tt>&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12420;<tt class="literal">Map</tt>&#12398;&#12461;&#12540;&#12408;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;<span class="emphasis"><em>&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;
            </em></span>&#12539;&#12459;&#12521;&#12512;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;<tt class="literal">Map</tt>&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12399;&#20219;&#24847;&#12398;&#22522;&#26412;&#22411;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#22411;&#12354;&#12427;&#12356;&#12399;&#21512;&#25104;&#22411;&#12394;&#12393;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;(&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12354;&#12426;&#12360;&#12414;&#12379;&#12435;)&#12290;&#37197;&#21015;&#12420;list&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12399;&#24120;&#12395;<tt class="literal">&#25972;&#25968;</tt>&#22411;&#12391;&#12377;&#12290;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12399;<tt class="literal">&lt;index&gt;</tt>, <tt class="literal">&lt;index-many-to-many&gt;</tt>,
            <tt class="literal">&lt;composite-index&gt;</tt> &#12354;&#12427;&#12356;&#12399; <tt class="literal">&lt;index-many-to-any&gt;</tt> &#12434;&#20351;&#29992;&#12375;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290;
        </p><p>
            Hibernate&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12289;&#22810;&#12367;&#12398;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#65381;&#12514;&#12487;&#12523;&#12434;&#12459;&#12496;&#12540;&#12377;&#12427;&#24133;&#24195;&#12356;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12393;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#27096;&#12293;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#23459;&#35328;&#12434;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12408;&#22793;&#25563;&#12377;&#12427;&#12363;&#24863;&#12376;&#12434;&#12388;&#12363;&#12416;&#12383;&#12417;&#12289;&#12473;&#12461;&#12540;&#12510;&#29983;&#25104;&#12484;&#12540;&#12523;&#12434;&#20351;&#12387;&#12390;&#12415;&#12427;&#12371;&#12392;&#12434;&#25552;&#26696;&#12375;&#12414;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-mapping"></a>6.2. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</h2></div></div><div></div></div><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;<tt class="literal">&lt;set&gt;</tt>,
            <tt class="literal">&lt;list&gt;</tt>,
            <tt class="literal">&lt;map&gt;</tt>,
            <tt class="literal">&lt;bag&gt;</tt>,
            <tt class="literal">&lt;array&gt;</tt> &#12381;&#12375;&#12390;
            <tt class="literal">&lt;primitive-array&gt;</tt> &#35201;&#32032;&#12395;&#12424;&#12387;&#12390;&#23459;&#35328;&#12373;&#12428;&#12414;&#12377;&#12290;&#20197;&#19979;&#12395;<tt class="literal">&lt;map&gt;</tt>&#12391;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;&#12290;:
        </p><div class="programlistingco"><pre class="programlisting">&lt;map
    name="propertyName"                                         <span class="co">(1)</span>
    table="table_name"                                          <span class="co">(2)</span>
    schema="schema_name"                                        <span class="co">(3)</span>
    lazy="true|false"                                           <span class="co">(4)</span>
    inverse="true|false"                                        <span class="co">(5)</span>
    cascade="all|none|save-update|delete|all-delete-orphan"     <span class="co">(6)</span>
    sort="unsorted|natural|comparatorClass"                     <span class="co">(7)</span>
    order-by="column_name asc|desc"                             <span class="co">(8)</span>
    where="arbitrary sql where condition"                       <span class="co">(9)</span>
    outer-join="true|false|auto"                                <span class="co">(10)</span>
    batch-size="N"                                              <span class="co">(11)</span>
    access="field|property|ClassName"                           <span class="co">(12)</span>
&gt;

    &lt;key .... /&gt;
    &lt;index .... /&gt;
    &lt;element .... /&gt;
&lt;/map&gt;</pre><div class="calloutlist"><table border="0" summary="Callout list"><tr><td width="5%" valign="top" align="left">(1)</td><td valign="top" align="left"><p>
                        <tt class="literal">name</tt> &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(2)</td><td valign="top" align="left"><p>
                        <tt class="literal">table</tt> (&#12458;&#12503;&#12471;&#12519;&#12531; - &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;&#12503;&#12525;&#12497;&#12486;&#12451;&#21517;) &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12486;&#12540;&#12502;&#12523;&#12398;&#21517;&#21069;(one-to-many&#38306;&#36899;&#12391;&#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;)
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(3)</td><td valign="top" align="left"><p>
                        <tt class="literal">schema</tt> (&#12458;&#12503;&#12471;&#12519;&#12531;) &#12523;&#12540;&#12488;&#35201;&#32032;&#12398;&#12473;&#12461;&#12540;&#12510;&#23459;&#35328;&#12434;&#26360;&#12365;&#25563;&#12360;&#12427;&#12289;&#12486;&#12540;&#12502;&#12523;&#12473;&#12461;&#12540;&#12510;&#12398;&#21517;&#21069;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(4)</td><td valign="top" align="left"><p>
                        <tt class="literal">lazy</tt> (&#12458;&#12503;&#12471;&#12519;&#12531; - &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<tt class="literal">false</tt>)
                            lazy&#21021;&#26399;&#21270;&#12434;&#21487;&#33021;&#12395;&#12375;&#12414;&#12377;&#12290;(&#37197;&#21015;&#12395;&#12399;&#20351;&#29992;&#12375;&#12414;&#12379;&#12435;)
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(5)</td><td valign="top" align="left"><p>
                        <tt class="literal">inverse</tt> (&#12458;&#12503;&#12471;&#12519;&#12531; - &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<tt class="literal">false</tt>)
                            &#21452;&#26041;&#21521;&#38306;&#36899;&#12398;&#12300;&#36870;&#12301;&#20596;&#12392;&#12375;&#12390;&#12371;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12510;&#12540;&#12463;&#12375;&#12414;&#12377;&#12290;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(6)</td><td valign="top" align="left"><p>
                        <tt class="literal">cascade</tt> (&#12458;&#12503;&#12471;&#12519;&#12531; - &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<tt class="literal">none</tt>)
                            &#23376;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#12398;&#12459;&#12473;&#12465;&#12540;&#12489;&#25805;&#20316;&#12434;&#21487;&#33021;&#12395;&#12375;&#12414;&#12377;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(7)</td><td valign="top" align="left"><p>
                        <tt class="literal">sort</tt> (&#12458;&#12503;&#12471;&#12519;&#12531;) <tt class="literal">&#33258;&#28982;</tt>&#12477;&#12540;&#12488;&#38918;&#24207;&#12414;&#12383;&#12399;&#19982;&#12360;&#12425;&#12428;&#12383;&#12467;&#12531;&#12497;&#12524;&#12540;&#12479;&#12539;&#12463;&#12521;&#12473;&#12434;&#20351;&#12387;&#12390;&#12477;&#12540;&#12488;&#65381;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(8)</td><td valign="top" align="left"><p>
                        <tt class="literal">order-by</tt> (&#12458;&#12503;&#12471;&#12519;&#12531;, JDK1.4&#12398;&#12415;) &#12458;&#12503;&#12471;&#12519;&#12531;&#12398;<tt class="literal">asc</tt> , <tt class="literal">desc</tt>&#12434;&#19968;&#32210;&#12395;&#20351;&#12387;&#12390;&#12289;<tt class="literal">Map</tt>, <tt class="literal">Set</tt>,bag&#12398;&#21453;&#24489;&#38918;&#24207;&#12434;&#27770;&#12417;&#12427;&#12486;&#12540;&#12502;&#12523;&#65381;&#12459;&#12521;&#12512;(&#12459;&#12521;&#12512;)&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(9)</td><td valign="top" align="left"><p>
                        (optional) (&#12458;&#12503;&#12471;&#12519;&#12531;) &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#26908;&#32034;&#12420;&#21066;&#38500;&#12377;&#12427;&#12392;&#12365;&#12395;&#20351;&#12358;&#20219;&#24847;&#12398;SQL&#12398;<tt class="literal">WHERE</tt>&#26465;&#20214;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;(&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#21033;&#29992;&#21487;&#33021;&#12394;&#12487;&#12540;&#12479;&#12398;&#37096;&#20998;&#38598;&#21512;&#12384;&#12369;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427;&#12392;&#12365;&#26377;&#29992;&#12391;&#12377;&#12290;) 
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(10)</td><td valign="top" align="left"><p>
                        (&#12458;&#12503;&#12471;&#12519;&#12531;) &#21487;&#33021;&#12394;&#22580;&#21512;&#12399;&#24120;&#12395;outer-join&#12391;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#12501;&#12455;&#12483;&#12481;&#12377;&#12427;&#12371;&#12392;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;SQL&#12398;<tt class="literal">SELECT</tt>&#19968;&#22238;&#12395;&#19968;&#12388;&#12384;&#12369;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#36820;&#12377;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435; 
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(11)</td><td valign="top" align="left"><p>
                        <tt class="literal">batch-size</tt>  (&#12458;&#12503;&#12471;&#12519;&#12531;, &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<tt class="literal">1</tt>) lazy&#12395;&#12371;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21462;&#12387;&#12390;&#26469;&#12427;&#12383;&#12417;&#12398;&#12300;&#12496;&#12483;&#12481;&#12539;&#12469;&#12452;&#12474;&#12301;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290; 
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(12)</td><td valign="top" align="left"><p>
                        <tt class="literal">access</tt> (&#12458;&#12503;&#12471;&#12519;&#12531; - &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<tt class="literal">property</tt>): &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12398;&#12383;&#12417;&#12395;Hibernate&#12364;&#20351;&#29992;&#12377;&#12427;&#12409;&#12365;&#25126;&#30053;
                    </p></td></tr></table></div></div><p>
            <tt class="literal">List</tt>&#12420;&#37197;&#21015;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;(<tt class="literal">foo[i]</tt>&#12398;<tt class="literal">i</tt>)&#12434;&#20445;&#25345;&#12377;&#12427;&#12486;&#12540;&#12502;&#12523;&#65381;&#12459;&#12521;&#12512;&#12434;&#20998;&#38626;&#12377;&#12427;&#12371;&#12392;&#12434;&#35201;&#27714;&#12375;&#12414;&#12377;&#12290;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12514;&#12487;&#12523;&#12364;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12539;&#12459;&#12521;&#12512;&#12434;&#25345;&#12387;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;&#12289;&#20363;&#12360;&#12400;&#12524;&#12460;&#12471;&#12540;&#12539;&#12487;&#12540;&#12479;&#12434;&#29992;&#12356;&#12390;&#20181;&#20107;&#12434;&#12375;&#12390;&#12356;&#12427;&#22580;&#21512;&#12289;&#38918;&#24207;&#12398;&#28961;&#12356;<tt class="literal">Set</tt>&#12434;&#20195;&#12431;&#12426;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#12371;&#12392;&#12399;&#12289;<tt class="literal">List</tt>&#12399;&#38918;&#24207;&#12398;&#28961;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12424;&#12426;&#20415;&#21033;&#12391;&#12354;&#12427;&#12392;&#32771;&#12360;&#12427;&#20154;&#36948;&#12363;&#12425;&#12399;&#12289;&#12363;&#12369;&#38626;&#12428;&#12383;&#24847;&#35211;&#12392;&#24605;&#12356;&#12414;&#12377;&#12290;Hibernate&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;<tt class="literal">Set</tt>, <tt class="literal">List</tt> &#12362;&#12424;&#12403; <tt class="literal">Map</tt>&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473;&#12395;&#20184;&#12369;&#12425;&#12428;&#12383;&#23455;&#38555;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12395;&#21427;&#23494;&#12395;&#24467;&#12356;&#12414;&#12377;&#12290;<tt class="literal">List</tt>&#12399;&#35201;&#32032;&#12434;&#33258;&#28982;&#12392;&#20877;&#25972;&#21015;&#12394;&#12393;&#12375;&#12414;&#12379;&#12435;!
        </p><p>
            &#12414;&#12383;&#19968;&#26041;&#12391;<span class="emphasis"><em>bag</em></span>&#12398;&#21205;&#20316;&#12434;&#12456;&#12511;&#12517;&#12524;&#12540;&#12488;&#12377;&#12427;&#12383;&#12417;&#12395;<tt class="literal">List</tt>&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12434;&#32771;&#12360;&#12383;&#20154;&#12293;&#12399;&#12289;&#12414;&#12373;&#12395;&#19981;&#28288;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;bag&#12399;&#21516;&#12376;&#35201;&#32032;&#12434;&#35079;&#25968;&#22238;&#21547;&#12435;&#12391;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12289;&#38918;&#24207;&#12364;&#28961;&#12367;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12364;&#12394;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;Java&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12501;&#12539;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#12399;<tt class="literal">Bag</tt>&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473;&#12364;&#12394;&#12356;&#12398;&#12391;<tt class="literal">List</tt>&#12434;&#20351;&#12387;&#12390;&#12456;&#12511;&#12517;&#12524;&#12540;&#12488;&#12375;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;Hibernate&#12399;<tt class="literal">List</tt>&#12420;<tt class="literal">Collection</tt>&#22411;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12392;<tt class="literal">&lt;bag&gt;</tt>&#12398;&#35201;&#32032;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12379;&#12414;&#12377;&#12290;bag&#12399;&#23455;&#38555;&#12395;&#12399;<tt class="literal">Collection</tt>&#12392;&#12391;&#12399;&#12394;&#12367;&#12289;<tt class="literal">List</tt>&#35215;&#32004;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12392;&#34909;
&#31361;&#12377;&#12427;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;(&#12375;&#12363;&#12375;&#12371;&#12398;&#31456;&#12398;&#24460;&#12391;&#35696;&#35542;&#12377;&#12427;&#12424;&#12358;&#12395;bag&#12434;&#36969;&#23452;&#12477;&#12540;&#12488;&#12391;&#12365;&#12414;&#12377;)&#12290;
        </p><p>
            &#27880;&#24847;:<tt class="literal">inverse="false"</tt>&#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12383;&#22823;&#12365;&#12394;Hibernate&#12398;bag&#12399;&#38750;&#21177;&#29575;&#30340;&#12391;&#12354;&#12426;&#12289;&#36991;&#12369;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;&#12381;&#12428;&#12399;bag&#12399;&#20491;&#12293;&#12398;&#21015;&#12434;&#35672;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12391;&#12365;&#12427;&#12461;&#12540;&#12364;&#12394;&#12356;&#12398;&#12391;&#12289;Hibernate&#12399;&#21015;&#12434;&#20491;&#12293;&#12395;&#20316;&#25104;&#12375;&#12289;&#21066;&#38500;&#12375;&#12289;&#26356;&#26032;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-ofvalues"></a>6.3. &#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;many-to-many&#38306;&#36899;</h2></div></div><div></div></div><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65381;&#12486;&#12540;&#12502;&#12523;&#12399;&#12289;&#20219;&#24847;&#12398;&#20516;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;&#20219;&#24847;&#12398;many-to-many&#38306;&#36899;&#12392;&#12375;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12383;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#21442;&#29031;&#12377;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#24517;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12486;&#12540;&#12502;&#12523;&#12399;&#12461;&#12540;&#65381;&#12459;&#12521;&#12512;(&#22806;&#37096;&#12461;&#12540;)&#12289;&#35201;&#32032;&#12459;&#12521;&#12512;&#12289;&#12381;&#12375;&#12390;&#12362;&#12381;&#12425;&#12367;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12539;&#12459;&#12521;&#12512;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12486;&#12540;&#12502;&#12523;&#12363;&#12425;&#25152;&#26377;&#12377;&#12427;&#12463;&#12521;&#12473;&#12398;&#12486;&#12540;&#12502;&#12523;&#12408;&#12398;&#22806;&#37096;&#12461;&#12540;<tt class="literal">&lt;key&gt;</tt>&#35201;&#32032;&#12434;&#20351;&#29992;&#12375;&#12390;&#23459;&#35328;&#12373;&#12428;&#12414;&#12377;&#12290;
        </p><div class="programlistingco"><pre class="programlisting">&lt;key column="column_name"/&gt;</pre><div class="calloutlist"><table border="0" summary="Callout list"><tr><td width="5%" valign="top" align="left">(1)</td><td valign="top" align="left"><p>
                        <tt class="literal">column</tt> (&#24517;&#38920;): &#22806;&#37096;&#12461;&#12540;&#12398;&#12459;&#12521;&#12512;&#21517;
                    </p></td></tr></table></div></div><p>
            map&#12420;list&#12398;&#12424;&#12358;&#12394;&#32034;&#24341;&#20184;&#12369;&#12373;&#12428;&#12383;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12399;<tt class="literal">&lt;index&gt;</tt>&#35201;&#32032;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;list&#12399;&#12289;&#12371;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#65381;&#12459;&#12521;&#12512;&#12364;&#12289;&#30058;&#21495;&#12364;0&#12363;&#12425;&#20184;&#12369;&#12425;&#12428;&#12383;&#36899;&#32154;&#12377;&#12427;&#25972;&#25968;&#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;&#12418;&#12375;&#12524;&#12460;&#12471;&#12540;&#65381;&#12487;&#12540;&#12479;&#12434;&#25201;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12394;&#12425;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12364;&#38291;&#36949;&#12356;&#12394;&#12367;0&#12363;&#12425;&#22987;&#12414;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;map&#12395;&#12388;&#12356;&#12390;&#12399;&#12459;&#12521;&#12512;&#12364;Hibernate&#22411;&#12398;&#12393;&#12435;&#12394;&#20516;&#12418;&#21547;&#12416;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><div class="programlistingco"><pre class="programlisting">&lt;index
        column="column_name"                <span class="co">(1)</span>
        type="typename"                     <span class="co">(2)</span>
/&gt;</pre><div class="calloutlist"><table border="0" summary="Callout list"><tr><td width="5%" valign="top" align="left">(1)</td><td valign="top" align="left"><p>
                        <tt class="literal">column</tt> (&#24517;&#38920;): &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12398;&#20516;&#12434;&#20445;&#25345;&#12377;&#12427;&#12459;&#12521;&#12512;&#12398;&#21517;&#21069;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(2)</td><td valign="top" align="left"><p>
                        <tt class="literal">type</tt> (&#12458;&#12503;&#12471;&#12519;&#12531;, &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;Integer): 
                            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12398;&#22411;
                    </p></td></tr></table></div></div><p>
            &#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#26041;&#27861;&#12392;&#12375;&#12390;&#12289;map&#12399;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#22411;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12424;&#12387;&#12390;&#32034;&#24341;&#20184;&#12369;&#12373;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#25105;&#12293;&#12399;<tt class="literal">&lt;index-many-to-many&gt;</tt> &#35201;&#32032;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;
        </p><div class="programlistingco"><pre class="programlisting">&lt;index-many-to-many
        column="column_name"                <span class="co">(1)</span>
        class="ClassName"                   <span class="co">(2)</span>
/&gt;</pre><div class="calloutlist"><table border="0" summary="Callout list"><tr><td width="5%" valign="top" align="left">(1)</td><td valign="top" align="left"><p>
                        <tt class="literal">column</tt> (&#24517;&#38920;): &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12398;&#20516;&#12434;&#20445;&#25345;&#12377;&#12427;&#22806;&#37096;&#12461;&#12540;&#12459;&#12521;&#12512;&#12398;&#21517;&#21069;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(2)</td><td valign="top" align="left"><p>
                        <tt class="literal">class</tt> (&#24517;&#38920;): &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#20351;&#29992;&#12373;&#12428;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12539;&#12463;&#12521;&#12473;
                    </p></td></tr></table></div></div><p>
            &#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#38306;&#12375;&#12390;&#12399;<tt class="literal">&lt;element&gt;</tt>&#12479;&#12464;&#12434;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;
        </p><div class="programlistingco"><pre class="programlisting">&lt;element
        column="column_name"                <span class="co">(1)</span>
        type="typename"                     <span class="co">(2)</span>
/&gt;</pre><div class="calloutlist"><table border="0" summary="Callout list"><tr><td width="5%" valign="top" align="left">(1)</td><td valign="top" align="left"><p>
                        <tt class="literal">column</tt> (&#24517;&#38920;): &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12398;&#20516;&#12434;&#20445;&#25345;&#12377;&#12427;&#12459;&#12521;&#12512;&#12398;&#21517;&#21069;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(2)</td><td valign="top" align="left"><p>
                        <tt class="literal">type</tt> (&#24517;&#38920;): &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#35201;&#32032;&#12398;&#22411;
                    </p></td></tr></table></div></div><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#33258;&#36523;&#12398;&#12486;&#12540;&#12502;&#12523;&#12434;&#20633;&#12360;&#12383;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;many-to-many&#38306;&#36899;&#12395;&#12388;&#12356;&#12390;&#12398;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12398;&#27010;&#24565;&#12395;&#30456;&#24403;&#12375;&#12414;&#12377;&#12290;<span class="emphasis"><em>many-to-many&#38306;&#36899;</em></span>&#12399;Java&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#26368;&#12418;&#33258;&#28982;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12399;&#12354;&#12426;&#12414;&#12377;&#12364;&#12289;&#36890;&#24120;&#26368;&#33391;&#12398;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12514;&#12487;&#12523;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p><div class="programlistingco"><pre class="programlisting">&lt;many-to-many
        column="column_name"                               <span class="co">(1)</span>
        class="ClassName"                                  <span class="co">(2)</span>
        outer-join="true|false|auto"                       <span class="co">(3)</span>
    /&gt;</pre><div class="calloutlist"><table border="0" summary="Callout list"><tr><td width="5%" valign="top" align="left">(1)</td><td valign="top" align="left"><p>
                        <tt class="literal">column</tt> (&#24517;&#38920;): &#22806;&#37096;&#12461;&#12540;&#12459;&#12521;&#12512;&#12398;&#35201;&#32032;&#12398;&#21517;&#21069; 
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(2)</td><td valign="top" align="left"><p>
                        <tt class="literal">class</tt> (required): (&#24517;&#38920;): &#38306;&#36899;&#12463;&#12521;&#12473;&#12398;&#21517;&#21069;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(3)</td><td valign="top" align="left"><p>
                        <tt class="literal">outer-join</tt> (&#12458;&#12503;&#12471;&#12519;&#12531; - &#12487;&#12501;&#12457;&#12523;&#12488;&#12399;<tt class="literal">auto</tt>): 
                            <tt class="literal">hibernate.use_outer_join</tt>&#12364;&#35373;&#23450;&#12373;&#12428;&#12383;&#12392;&#12365;&#38306;&#36899;&#12434;&#12450;&#12454;&#12479;&#12540;&#65381;&#12472;&#12519;&#12452;&#12531;&#12391;&#12501;&#12455;&#12483;&#12481;&#21487;&#33021;&#12395;&#12377;&#12427;
                    </p></td></tr></table></div></div><p>
            &#12414;&#12378;String&#12398;&#38598;&#21512;&#12398;&#20363;:
        </p><pre class="programlisting">&lt;set name="names" table="NAMES"&gt;
    &lt;key column="GROUPID"/&gt;
    &lt;element column="NAME" type="string"/&gt;
&lt;/set&gt;</pre><p>
            &#25972;&#25968;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427;bag:(<tt class="literal">order-by</tt>&#23646;&#24615;&#12395;&#12424;&#12387;&#12390;&#21453;&#24489;&#38918;&#24207;&#12434;&#23450;&#32681;&#12373;&#12428;&#12383;bag):
        </p><pre class="programlisting">&lt;bag name="sizes" table="SIZES" order-by="SIZE ASC"&gt;
    &lt;key column="OWNER"/&gt;
    &lt;element column="SIZE" type="integer"/&gt;
&lt;/bag&gt;</pre><p>
           &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#37197;&#21015;-&#12371;&#12398;&#22580;&#21512;many-to-many&#38306;&#36899;(&#12371;&#12371;&#12391;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#65381;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12354;&#12426;&#12289;<tt class="literal">cascade="all"</tt>&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;): 
        </p><pre class="programlisting">&lt;array name="foos" table="BAR_FOOS" cascade="all"&gt;
    &lt;key column="BAR_ID"/&gt;
    &lt;index column="I"/&gt;
    &lt;many-to-many column="FOO_ID" class="org.hibernate.Foo"/&gt;
&lt;/array&gt;</pre><p>
            String&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12363;&#12425;&#26085;&#20184;&#12408;&#12398;&#12510;&#12483;&#12503;&#12483;&#12500;&#12531;&#12464;:
        </p><pre class="programlisting">&lt;map name="holidays" table="holidays" schema="dbo" order-by="hol_name asc"&gt;
    &lt;key column="id"/&gt;
    &lt;index column="hol_name" type="string"/&gt;
    &lt;element column="hol_date" type="date"/&gt;
&lt;/map&gt;</pre><p>
            &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;list(&#27425;&#12398;&#31456;&#12391;&#35696;&#35542;&#12375;&#12414;&#12377;):
        </p><pre class="programlisting">&lt;list name="carComponents" table="car_components"&gt;
    &lt;key column="car_id"/&gt;
    &lt;index column="posn"/&gt;
    &lt;composite-element class="org.hibernate.car.CarComponent"&gt;
            &lt;property name="price" type="float"/&gt;
            &lt;property name="type" type="org.hibernate.car.ComponentType"/&gt;
            &lt;property name="serialNumber" column="serial_no" type="string"/&gt;
    &lt;/composite-element&gt;
&lt;/list&gt;</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-onetomany"></a>6.4. one-to-many&#38306;&#36899;</h2></div></div><div></div></div><p>
            <span class="emphasis"><em>one-to-many&#38306;&#36899;</em></span>&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12486;&#12540;&#12502;&#12523;&#12434;&#20171;&#22312;&#12379;&#12378;&#12395;&#12289;2&#12388;&#12398;&#12463;&#12521;&#12473;&#12398;&#12486;&#12540;&#12502;&#12523;&#12434;<span class="emphasis"><em>&#30452;&#25509;</em></span>&#12522;&#12531;&#12463;&#12375;&#12414;&#12377;&#12290;(&#12371;&#12428;&#12399;<span class="emphasis"><em>one-to-many</em></span>&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12514;&#12487;&#12523;&#12434;&#23455;&#35013;&#12375;&#12414;&#12377;&#12290;)&#12371;&#12398;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12514;&#12487;&#12523;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12289;Java&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12356;&#12367;&#12388;&#12363;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12434;&#22833;&#12356;&#12414;&#12377;:
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    map&#12289;set&#12289;list&#12395;null&#20516;&#12399;&#21547;&#12417;&#12414;&#12379;&#12435;&#12290;
                </p></li><li><p>
                    &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#21547;&#12414;&#12428;&#12383;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#65381;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;2&#12388;&#20197;&#19978;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12395;&#23646;&#12379;&#12414;&#12379;&#12435;&#12290;
                </p></li><li><p>
                    &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#21547;&#12414;&#12428;&#12383;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#65381;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;2&#12388;&#20197;&#19978;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12398;&#20516;&#12395;&#12399;&#29694;&#12428;&#12414;&#12379;&#12435;&#12290;
                </p></li></ul></div><p>
            <tt class="literal">Foo</tt>&#12363;&#12425;<tt class="literal">Bar</tt>&#12408;&#12398;&#38306;&#36899;&#12399;&#12461;&#12540;&#12459;&#12521;&#12512;&#12392;&#12289;&#12418;&#12375;&#12354;&#12427;&#12394;&#12425;&#12400;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12539;&#12459;&#12521;&#12512;&#12434;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#21547;&#12414;&#12428;&#12383;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12539;&#12463;&#12521;&#12473;&#12398;&#12486;&#12540;&#12502;&#12523;&#12289;&#12388;&#12414;&#12426;<tt class="literal">Bar</tt>&#12408;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12434;&#35201;&#27714;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12459;&#12521;&#12512;&#12399;&#19978;&#35352;&#12398;&#12424;&#12358;&#12395;<tt class="literal">&lt;key&gt;</tt>&#12392;<tt class="literal">&lt;index&gt;</tt>&#35201;&#32032;&#12434;&#20351;&#12387;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">&lt;one-to-many&gt;</tt>&#12479;&#12464;&#12399;&#12289;one-to-many&#38306;&#36899;&#12434;&#31034;&#12375;&#12414;&#12377; 
        </p><div class="programlistingco"><pre class="programlisting">&lt;one-to-many class="ClassName"/&gt;</pre><div class="calloutlist"><table border="0" summary="Callout list"><tr><td width="5%" valign="top" align="left">(1)</td><td valign="top" align="left"><p>
                        <tt class="literal">class</tt> (&#24517;&#38920;): &#38306;&#36899;&#12463;&#12521;&#12473;&#12398;&#21517;&#21069;
                    </p></td></tr></table></div></div><p>
            &#20363;:
        </p><pre class="programlisting">&lt;set name="bars"&gt;
    &lt;key column="foo_id"/&gt;
    &lt;one-to-many class="org.hibernate.Bar"/&gt;
&lt;/set&gt;</pre><p>
            <tt class="literal">&lt;one-to-many&gt;</tt>&#35201;&#32032;&#12399;&#12459;&#12521;&#12512;&#12434;&#23459;&#35328;&#12377;&#12427;&#24517;&#35201;&#12364;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#21516;&#27096;&#12395;<tt class="literal">&#12486;&#12540;&#12502;&#12523;</tt>&#21517;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            <span class="emphasis"><em>&#38750;&#24120;&#12395;&#37325;&#35201;&#12394;&#27880;&#24847;:</em></span>&#12418;&#12375;<tt class="literal">&lt;one-to-many&gt;</tt>&#38306;&#36899;&#12398;<tt class="literal">&lt;key&gt;</tt>&#12459;&#12521;&#12512;&#12364;<tt class="literal">NOT NULL</tt>&#12392;&#23459;&#35328;&#12373;&#12428;&#12427;&#22580;&#21512;&#12289;Hibernate&#12399;&#12381;&#12428;&#12364;&#38306;&#36899;&#12434;&#20316;&#25104;&#12377;&#12427;&#12363;&#26356;&#26032;&#12377;&#12427;&#26178;&#12289;&#21046;&#32004;&#36949;&#21453;&#12434;&#24341;&#12365;&#36215;&#12371;&#12377;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12398;&#21839;&#38988;&#12434;&#38450;&#12368;&#12383;&#12417;&#12395;&#12399;&#12289;many&#12398;&#20516;&#12398;&#20596;(set&#12420;bag)&#12395;<tt class="literal">inverse="true"</tt>&#12392;&#12510;&#12540;&#12463;&#12375;&#12383;<span class="emphasis"><em>&#21452;&#26041;&#21521;&#38306;&#36899;&#12434;&#20351;&#29992;&#12375;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;</em></span>&#12290;&#12371;&#12398;&#31456;&#12391;
&#24460;&#36848;&#12377;&#12427;&#21452;&#26041;&#21521;&#38306;&#36899;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-lazy"></a>6.5. lazy&#21021;&#26399;&#21270;(Lazy Initialization)</h2></div></div><div></div></div><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;(&#37197;&#21015;&#20197;&#22806;)&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12450;&#12463;&#12475;&#12473;&#12434;&#24517;&#35201;&#12392;&#12375;&#12383;&#12392;&#12365;&#12384;&#12369;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#29366;&#24907;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;lazy&#21021;&#26399;&#21270;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290;lazy&#21021;&#26399;&#21270;&#12399;&#12518;&#12540;&#12470;&#12395;&#12392;&#12387;&#12390;&#36879;&#36942;&#30340;&#12395;&#36215;&#12371;&#12426;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#36890;&#24120;&#12371;&#12398;&#12371;&#12392;&#12395;&#12388;&#12356;&#12390;&#38306;&#24515;&#12434;&#25345;&#12388;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;(&#23455;&#38555;&#12289;&#36879;&#36942;&#30340;&#12394;lazy&#21021;&#26399;&#21270;&#12399;Hibernate&#12364;&#20309;&#25925;&#33258;&#36523;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#23455;&#35013;&#12463;&#12521;&#12473;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12363;&#12392;&#12356;&#12358;&#20027;&#12394;&#29702;&#30001;&#12392;&#12394;&#12426;&#12414;&#12377;)&#12375;&#12363;&#12375;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12371;&#12392;&#12434;&#12377;&#12427;&#22580;&#21512;&#21839;&#38988;&#12434;&#25307;&#12365;&#12414;&#12377;&#12290;:
        </p><pre class="programlisting">s = sessions.openSession();
User u = (User) s.find("from User u where u.name=?", userName, Hibernate.STRING).get(0);
Map permissions = u.getPermissions();
s.connection().commit();
s.close();

Integer accessLevel = (Integer) permissions.get("accounts");  // Error!</pre><p>
            &#12371;&#12428;&#12399;&#23244;&#12394;&#39514;&#12365;&#12395;&#30452;&#38754;&#12375;&#12381;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
<tt class="literal">Session</tt>&#12364;&#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;permission&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#21021;&#26399;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#27770;&#12375;&#12390;&#12381;&#12398;&#29366;&#24907;&#12434;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;&#12467;&#12511;&#12483;&#12488;&#12398;&#30452;&#21069;&#12408;&#35501;&#12415;&#36796;&#12415;&#34892;&#12434;&#31227;&#21205;&#12375;&#12390;&#12289;&#20462;&#27491;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;(&#12375;&#12363;&#12375;&#12371;&#12398;&#21839;&#38988;&#12434;&#35299;&#27770;&#12377;&#12427;&#12373;&#12425;&#12395;&#33391;&#12356;&#26041;&#27861;&#12364;&#20182;&#12395;&#12418;&#12354;&#12426;&#12414;&#12377;)&#12290;
        </p><p>
            &#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#26041;&#27861;&#12392;&#12375;&#12390;lazy&#12391;&#12394;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;lazy&#21021;&#26399;&#21270;&#12364;&#19978;&#35352;&#12398;&#12424;&#12358;&#12395;&#12496;&#12464;&#12395;&#32080;&#12403;&#12388;&#12367;&#12371;&#12392;&#12418;&#12354;&#12427;&#12398;&#12391;&#12487;&#12501;&#12457;&#12523;&#12488;&#12399;lazy&#21021;&#26399;&#21270;&#12434;&#34892;&#12356;&#12414;&#12379;&#12435;&#12290;&#12375;&#12363;&#12375;&#12394;&#12364;&#12425;lazy&#21021;&#26399;&#21270;&#12364;&#12411;&#12392;&#12435;&#12393;&#12377;&#12409;&#12390;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12383;&#12417;&#12395;&#12289;&#29305;&#12395;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12383;&#12417;&#12395;(&#21177;&#29575;&#12398;&#29702;&#30001;&#12398;&#12383;&#12417;&#12398;)&#20351;&#29992;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#24847;&#22259;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
        </p><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;lazy&#21021;&#26399;&#21270;&#12377;&#12427;&#26178;&#12395;&#36215;&#12371;&#12427;&#20363;&#22806;&#12399;<tt class="literal">LazyInitializationException</tt>&#12391;&#12521;&#12483;&#12503;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290; 
        </p><p>
            &#12458;&#12503;&#12471;&#12519;&#12531;&#12398;<tt class="literal">lazy</tt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#29992;&#12375;&#12390;lazy&#12394;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#23459;&#35328;&#12377;&#12427;&#12395;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12375;&#12414;&#12377;&#12290;:
        </p><pre class="programlisting">&lt;set name="names" table="NAMES" lazy="true"&gt;
    &lt;key column="group_id"/&gt;
    &lt;element column="NAME" type="string"/&gt;
&lt;/set&gt;</pre><p>
           &#35079;&#25968;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#65381;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12540;&#12391;&#12289;&#29305;&#12395;Hibernate&#12434;&#20351;&#12387;&#12390;&#12487;&#12540;&#12479;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12467;&#12540;&#12489;&#12392;&#12381;&#12428;&#12434;&#20351;&#29992;&#12377;&#12427;&#12467;&#12540;&#12489;&#12364;&#30064;&#12394;&#12427;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#23652;&#12395;&#12354;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#21021;&#26399;&#21270;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;<tt class="literal">Session</tt>&#12364;&#38283;&#12356;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12377;&#12427;&#21839;&#38988;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#20197;&#19979;&#12399;&#12371;&#12398;&#21839;&#38988;&#12395;&#23550;&#20966;&#12377;&#12427;2&#12388;&#12398;&#22522;&#30990;&#30340;&#12394;&#26041;&#27861;&#12391;&#12377;:
        </p><div class="itemizedlist"><ul type="disc"><li><p>
                    &#19968;&#24230;&#12499;&#12517;&#12540;&#12398;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12364;&#23436;&#20840;&#12395;&#12394;&#12428;&#12400;&#12289;&#12454;&#12455;&#12502;&#12539;&#12505;&#12540;&#12473;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12518;&#12540;&#12470;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12398;&#32066;&#31471;&#12395;&#12362;&#12356;&#12390;&#12398;&#12415;&#12289;<tt class="literal">Session</tt>&#12434;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;&#12383;&#12417;&#12395;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12539;&#12501;&#12451;&#12523;&#12479;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12418;&#12385;&#12429;&#12435;&#12371;&#12398;&#12371;&#12392;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12452;&#12531;&#12501;&#12521;&#12395;&#20363;&#22806;&#20966;&#29702;&#12398;&#27491;&#30906;&#24615;&#12364;&#35201;&#27714;&#12373;&#12428;&#12414;&#12377;&#12290;&#12499;&#12517;&#12540;&#12434;&#25552;&#20379;&#12375;&#12390;&#12356;&#12427;&#26368;&#20013;&#12395;&#20363;&#22806;&#12364;&#36215;&#12371;&#12387;&#12383;&#12392;&#12365;&#12391;&#12373;&#12360;&#12289;&#12518;&#12540;&#12470;&#12540;&#12395;&#20966;&#29702;&#12364;&#25147;&#12427;&#21069;&#12395;<tt class="literal">Session</tt>&#12364;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12289;&#12381;&#12375;&#12390;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#32066;&#20102;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#26997;&#12417;&#12390;&#37325;&#35201;&#12391;&#12377;&#12290;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12539;&#12501;&#12451;&#12523;&#12479;&#12399;&#12371;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12398;&#12383;&#12417;&#12395;&#12289;<tt class="literal">Session</tt>&#12395;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#31169;&#12383;&#12385;&#12399;&#29694;&#22312;&#12398;<tt class="literal">Session</tt>&#12434;&#20445;&#25345;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;<tt class="literal">&#12473;&#12524;&#12483;&#12489;&#12539;&#12525;&#12540;&#12459;&#12523;</tt>&#12394;&#22793;&#25968;&#12398;&#20351;&#29992;&#12434;&#21223;&#12417;&#12414;&#12377;(&#23455;&#35013;&#20363;&#12399;1&#31456;&#12398;1.4&#31680;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356; <a href="quickstart.html#quickstart-playingwithcats" title="1.4. &#12493;&#12467;&#12392;&#36938;&#12406;">&#38917;1.4. &#12300;&#12493;&#12467;&#12392;&#36938;&#12406;&#12301;</a>)&#12290;
                </p></li><li><p>
                    &#20491;&#21029;&#12398;&#12499;&#12472;&#12493;&#12473;&#23652;&#12434;&#20633;&#12360;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12499;&#12472;&#12493;&#12473;&#12525;&#12472;&#12483;&#12463;&#12399;&#20966;&#29702;&#12364;&#36820;&#12427;&#21069;&#12395;&#12454;&#12455;&#12502;&#23652;&#12395;&#12424;&#12387;&#12390;&#24517;&#35201;&#12392;&#12373;&#12428;&#12427;&#12377;&#12409;&#12390;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#28310;&#20633;&#12375;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12371;&#12392;&#12399;&#12499;&#12472;&#12493;&#12473;&#23652;&#12399;&#29305;&#23450;&#12398;&#12518;&#12540;&#12473;&#12465;&#12540;&#12473;&#12395;&#23550;&#12375;&#24517;&#35201;&#12392;&#12394;&#12427;&#12503;&#12524;&#12476;&#12531;&#12486;&#12540;&#12471;&#12519;&#12531;&#23652;&#65295;Web&#23652;&#12395;&#12377;&#12391;&#12395;&#12289;&#21021;&#26399;&#21270;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#12377;&#12409;&#12390;&#12525;&#12540;&#12489;&#12375;&#36820;&#12377;&#12409;&#12365;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;&#36890;&#24120;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12454;&#12455;&#12502;&#23652;&#12395;&#12424;&#12387;&#12390;&#24517;&#35201;&#12392;&#12373;&#12428;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12381;&#12428;&#12382;&#12428;&#12395;&#23550;&#12375;<tt class="literal">Hibernate.initialize()</tt>&#12434;&#21628;&#12406;&#12363;(&#12371;&#12398;&#21628;&#12403;&#20986;&#12375;&#12399;Session&#12364;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;&#21069;&#12395;&#21628;&#12400;&#12428;&#12397;&#12400;&#12394;&#12425;&#12394;&#12356;)&#12289;<tt class="literal">FETCH</tt>&#21477;&#12398;&#12354;&#12427;&#12463;&#12456;&#12522;&#12540;&#12434;&#20351;&#12387;&#12390;eager&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#24489;&#20803;&#12375;&#12414;&#12377;&#12290;
                </p></li><li><p>
                    &#21021;&#26399;&#21270;&#12375;&#12390;&#12356;&#12394;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;(&#12414;&#12383;&#12399;&#12503;&#12525;&#12461;&#12471;)&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#21069;&#12395;&#12289;&#20197;&#21069;&#12395;&#12525;&#12540;&#12489;&#12375;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;<tt class="literal">update()</tt>&#12420;<tt class="literal">lock()</tt>&#12434;&#20351;&#12387;&#12390;&#26032;&#12375;&#12356;<tt class="literal">Session</tt>&#12395;&#38306;&#36899;&#12373;&#12379;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290;&#12450;&#12489;&#12507;&#12483;&#12463;&#12394;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12434;&#23566;&#20837;&#12375;&#12383;&#12398;&#12391;&#12289;Hibernate&#12399;&#12371;&#12428;&#12434;&#33258;&#21205;&#30340;&#12395;&#34892;&#12394;&#12358;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12379;&#12435;&#12290;
                </p></li></ul></div><p>
            &#21021;&#26399;&#21270;&#12379;&#12378;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12469;&#12452;&#12474;&#12434;&#24471;&#12427;&#12383;&#12417;&#12395;Hibernate Session API&#12398;<tt class="literal">filter()</tt>&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;:
        </p><pre class="programlisting">( (Integer) s.filter( collection, "select count(*)" ).get(0) ).intValue()</pre><p>
            <tt class="literal">filter()</tt>&#12420;<tt class="literal">createFilter()</tt>&#12418;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#20840;&#20307;&#12434;&#21021;&#26399;&#21270;&#12377;&#12427;&#24517;&#35201;&#12394;&#12375;&#12395;&#12289;&#21177;&#29575;&#30340;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#37096;&#20998;&#38598;&#21512;&#12434;&#24489;&#20803;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-sorted"></a>6.6. &#12477;&#12540;&#12488;&#12373;&#12428;&#12383;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;</h2></div></div><div></div></div><p>
            Hibernate&#12399;java.util&#12398;&#23455;&#35013;&#12391;&#12354;&#12427;<tt class="literal">java.util.SortedMap</tt>&#12392;<tt class="literal">java.util.SortedSet</tt>&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12377;&#12290;&#38283;&#30330;&#32773;&#12399;&#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12501;&#12449;&#12452;&#12523;&#12395;&#12467;&#12531;&#12497;&#12524;&#12540;&#12479;&#12540;&#12434;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;:
        </p><pre class="programlisting">&lt;set name="aliases" table="person_aliases" sort="natural"&gt;
    &lt;key column="person"/&gt;
    &lt;element column="name" type="string"/&gt;
&lt;/set&gt;

&lt;map name="holidays" sort="my.custom.HolidayComparator" lazy="true"&gt;
    &lt;key column="year_id"/&gt;
    &lt;index column="hol_name" type="string"/&gt;
    &lt;element column="hol_date" type="date"/&gt;
&lt;/map&gt;</pre><p>
            <tt class="literal">&#12477;&#12540;&#12488;</tt>&#23646;&#24615;&#12392;&#12375;&#12390;&#25351;&#23450;&#12391;&#12365;&#12427;&#20516;&#12399;<tt class="literal">unsorted</tt>,<tt class="literal">natural</tt>,&#12381;&#12375;&#12390;<tt class="literal">java.util.Comparator</tt>&#12398;&#23455;&#35013;&#12463;&#12521;&#12473;&#21517;&#12391;&#12377;&#12290;
        </p><p>
            &#12477;&#12540;&#12488;&#12373;&#12428;&#12383;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#23455;&#38555;&#12395;<tt class="literal">java.util.TreeSet</tt>&#12420;<tt class="literal">java.util.TreeMap</tt>&#12398;&#12424;&#12358;&#12395;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            &#12418;&#12375;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#33258;&#36523;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#35201;&#32032;&#12434;&#20006;&#12409;&#12373;&#12379;&#12383;&#12356;&#12394;&#12425;&#12400;<tt class="literal">set</tt>, <tt class="literal">bag</tt>, <tt class="literal">map</tt>&#12398;<tt class="literal">order-by</tt>&#23646;&#24615;&#12434;&#20351;&#12358;&#12392;&#33391;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#12371;&#12398;&#35299;&#27770;&#27861;&#12399;JDK 1.4&#12363;&#12354;&#12427;&#12356;&#12399;&#12381;&#12428;&#20197;&#19978;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#21033;&#29992;&#21487;&#33021;&#12391;&#12377;(<tt class="literal">LinkedHashSet</tt>&#12414;&#12383;&#12399;<tt class="literal">LinkedHashMap</tt>&#12434;&#20351;&#29992;&#12375;&#12390;&#23455;&#35013;&#12373;&#12428;&#12414;&#12377;)&#12290;&#12371;&#12428;&#12399;SQL&#12463;&#12456;&#12522;&#20869;&#12391;&#25972;&#21015;&#12434;&#23455;&#34892;&#12377;&#12427;&#12398;&#12391;&#12354;&#12387;&#12390;&#12513;&#12514;&#12522;&#19978;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p><pre class="programlisting">&lt;set name="aliases" table="person_aliases" order-by="name asc"&gt;
    &lt;key column="person"/&gt;
    &lt;element column="name" type="string"/&gt;
&lt;/set&gt;

&lt;map name="holidays" order-by="hol_date, hol_name" lazy="true"&gt;
    &lt;key column="year_id"/&gt;
    &lt;index column="hol_name" type="string"/&gt;
    &lt;element column="hol_date type="date"/&gt;
&lt;/map&gt;</pre><p>
            <tt class="literal">order-by</tt>&#23646;&#24615;&#12398;&#20516;&#12364;SQL&#21629;&#20196;&#12391;&#12354;&#12387;&#12390;HQL&#21629;&#20196;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65281;
        </p><p>
            &#38306;&#36899;&#12399;&#23455;&#34892;&#26178;&#12395;<tt class="literal">filter()</tt>&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#20219;&#24847;&#12398;criteria&#12395;&#12424;&#12387;&#12390;&#12477;&#12540;&#12488;&#12373;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
        </p><pre class="programlisting">sortedUsers = s.filter( group.getUsers(), "order by this.name" );</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-idbag"></a>6.7. <tt class="literal">&lt;idbag&gt;&#12398;&#20351;&#29992;</tt></h2></div></div><div></div></div><p>
            &#12418;&#12375;&#35079;&#21512;&#12461;&#12540;&#12399;&#24746;&#12356;&#12371;&#12392;&#12391;&#12354;&#12426;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#20154;&#24037;&#12398;&#35672;&#21029;&#23376;(&#20195;&#29702;&#12461;&#12540;)&#12434;&#25345;&#12388;&#12409;&#12365;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#32771;&#12360;&#26041;&#12395;&#36059;&#25104;&#12377;&#12427;&#12394;&#12425;&#12400;&#12289;&#25105;&#12293;&#12364;&#31034;&#12375;&#12383;many-to-many&#38306;&#36899;&#12392;&#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#35079;&#21512;&#12461;&#12540;&#12434;&#29992;&#12356;&#12383;&#12486;&#12540;&#12502;&#12523;&#12408;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12399;&#23569;&#12375;&#22855;&#22937;&#12395;&#24863;&#12376;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#32771;&#12360;&#12395;&#12399;&#30906;&#12363;&#12395;&#35696;&#35542;&#12398;&#20313;&#22320;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12428;&#12399;&#32020;&#31883;&#12394;&#38306;&#36899;&#12486;&#12540;&#12502;&#12523;&#12399;&#20195;&#29702;&#12461;&#12540;&#12395;&#12424;&#12387;&#12390;&#21313;&#20998;&#12394;&#21033;&#30410;&#12434;&#24471;&#12425;&#12428;&#12427;&#12424;&#12358;&#12395;&#12399;&#24605;&#12360;&#12394;&#12356;&#12363;&#12425;&#12391;&#12377;(&#21512;&#25104;&#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#21033;&#30410;&#12364;&#12354;&#12427;<span class="emphasis"><em>&#12363;&#12418;</em></span>&#12375;&#12428;&#12414;&#12379;&#12435;&#12364;)&#12290;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;Hibernate&#12399;&#20195;&#29702;&#12461;&#12540;&#12434;&#20351;&#12387;&#12383;&#12486;&#12540;&#12502;&#12523;&#12408;&#12398;many-to-many&#38306;&#36899;&#12392;&#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#35377;&#12377;&#29305;&#24500;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">&lt;idbag&gt;</tt>&#35201;&#32032;&#12391;bag&#12398;&#21205;&#20316;&#12434;&#25345;&#12387;&#12383;list(&#12414;&#12383;&#12399;<tt class="literal">Collection</tt>)&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">&lt;idbag name="lovers" table="LOVERS" lazy="true"&gt;
    &lt;collection-id column="ID" type="long"&gt;
        &lt;generator class="hilo"/&gt;
    &lt;/collection-id&gt;
    &lt;key column="PERSON1"/&gt;
    &lt;many-to-many column="PERSON2" class="eg.Person" outer-join="true"/&gt;
&lt;/idbag&gt;</pre><p>
            &#12372;&#35239;&#12398;&#12424;&#12358;&#12395;<tt class="literal">&lt;idbag&gt;</tt>&#12399;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12539;&#12463;&#12521;&#12473;&#12398;&#12424;&#12358;&#12395;&#20154;&#24037;&#12398;id&#12472;&#12455;&#12493;&#12524;&#12540;&#12479;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#30064;&#12394;&#12427;&#20195;&#29702;&#12461;&#12540;&#12399;&#12381;&#12428;&#12382;&#12428;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#21015;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;
&#12375;&#12363;&#12375;Hibernate&#12399;&#29305;&#23450;&#12398;&#21015;&#12398;&#20195;&#29702;&#12461;&#12540;&#12398;&#20516;&#12434;&#30330;&#35211;&#12377;&#12427;&#12513;&#12459;&#12491;&#12474;&#12512;&#12434;&#25552;&#20379;&#12375;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            <tt class="literal">&lt;idbag&gt;</tt>&#12398;&#26356;&#26032;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12399;&#36890;&#24120;&#12398;<tt class="literal">&lt;bag&gt;</tt>&#12424;&#12426;&#12418;<span class="emphasis"><em>&#12356;&#12356;</em></span>&#12371;&#12392;&#12395;&#27880;&#30446;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
Hibernate&#12399;&#20491;&#12293;&#12398;&#21015;&#12434;&#21177;&#26524;&#30340;&#12395;&#35211;&#12388;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12289;&#12385;&#12423;&#12358;&#12393;list&#12420;map&#12420;set&#12398;&#12424;&#12358;&#12395;&#20491;&#21029;&#12395;&#12381;&#12428;&#12425;&#12434;&#26356;&#26032;&#12289;&#21066;&#38500;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><p>
            &#29694;&#22312;&#12398;&#23455;&#35013;&#12391;&#12399;<tt class="literal">&lt;idbag&gt;</tt>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#35672;&#21029;&#23376;&#12395;&#23550;&#12375;&#12390;&#12289;<tt class="literal">native</tt>&#35672;&#21029;&#23376;&#29983;&#25104;&#25126;&#30053;&#12399;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-bidirectional"></a>6.8. &#21452;&#26041;&#21521;&#38306;&#36899;</h2></div></div><div></div></div><p>
            <span class="emphasis"><em>&#21452;&#26041;&#21521;&#38306;&#36899;</em></span>&#12399;&#38306;&#36899;&#12398;&#12393;&#12385;&#12425;&#12398;&#20596;&#12363;&#12425;&#12391;&#12418;&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12391;&#12365;&#12414;&#12377;&#12290;&#65298;&#31278;&#39006;&#12398;&#21452;&#26041;&#21521;&#38306;&#36899;&#12364;&#12469;&#12509;&#12540;&#12488;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;:
            </p><div class="variablelist"><dl><dt><span class="term">one-to-many</span></dt><dd><p>
                            &#29255;&#20596;&#12364;set&#12363;bag&#12289;&#12418;&#12358;&#29255;&#26041;&#12398;&#22810;&#37325;&#24230;&#12364;1&#12391;&#12377;&#12290;
                        </p></dd><dt><span class="term">many-to-many</span></dt><dd><p>
                            &#20001;&#20596;&#12364;set&#12363;bag&#12391;&#12377;&#12290;
                        </p></dd></dl></div><p>

        </p><p>
            Hibernate&#12399;many&#20596;&#12364;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20184;&#12369;&#12373;&#12428;&#12383;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;(list&#12420;map&#12420;&#37197;&#21015;)&#12391;&#12354;&#12427;&#21452;&#26041;&#21521;one-to-many&#38306;&#36899;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;set&#12414;&#12383;&#12399;bag&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><p>
            &#65298;&#12388;&#12398;many-to-many&#38306;&#36899;&#12363;&#12425;&#21516;&#12376;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12486;&#12540;&#12502;&#12523;&#12408;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#20351;&#29992;&#12377;&#12427;&#12363;&#12289;&#29255;&#20596;&#12434;<span class="emphasis"><em>inverse</em></span>&#12392;&#23459;&#35328;&#12375;&#12390;&#21452;&#26041;&#21521;many-to-many&#38306;&#36899;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;(&#12393;&#12385;&#12425;&#12434;&#36984;&#12406;&#12363;&#12399;&#36984;&#25246;&#27425;&#31532;&#12391;&#12377;)&#12290;&#20197;&#19979;&#12395;&#12289;&#12354;&#12427;&#12463;&#12521;&#12473;&#12363;&#12425;<span class="emphasis"><em>&#12381;&#12428;&#33258;&#36523;</em></span>&#12398;&#12463;&#12521;&#12473;&#12408;&#12398;&#21452;&#26041;&#21521;many-to-many&#38306;&#36899;&#12398;&#20363;&#12434;&#31034;&#12375;&#12414;&#12377;(&#21508;category&#12399;&#22810;&#12367;&#12398;items&#12434;&#25345;&#12388;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;&#21508;item&#12399;&#22810;&#12367;&#12398;category&#20869;&#12395;&#12354;&#12426;&#12360;&#12414;&#12377;)&#12290;:
        </p><pre class="programlisting">&lt;class name="org.hibernate.auction.Category"&gt;
    &lt;id name="id" column="ID"/&gt;
    ...
    &lt;bag name="items" table="CATEGORY_ITEM" lazy="true"&gt;
        &lt;key column="CATEGORY_ID"/&gt;
        &lt;many-to-many class="org.hibernate.auction.Item" column="ITEM_ID"/&gt;
    &lt;/bag&gt;
&lt;/class&gt;

&lt;class name="org.hibernate.auction.Item"&gt;
    &lt;id name="id" column="ID"/&gt;
    ...

    &lt;!-- inverse end --&gt;
    &lt;bag name="categories" table="CATEGORY_ITEM" inverse="true" lazy="true"&gt;
        &lt;key column="ITEM_ID"/&gt;
        &lt;many-to-many class="org.hibernate.auction.Category" column="CATEGORY_ID"/&gt;
    &lt;/bag&gt;
&lt;/class&gt;</pre><p>
            &#38306;&#36899;&#12398;&#36870;&#20596;&#12408;&#12398;&#12415;&#34892;&#12394;&#12431;&#12428;&#12383;&#22793;&#26356;&#12399;&#27704;&#32154;&#21270;<span class="emphasis"><em>&#12373;&#12428;&#12414;&#12379;&#12435;</em></span>&#12290;
&#12371;&#12398;&#12371;&#12392;&#12399;Hibernate&#12364;&#12513;&#12514;&#12522;&#20869;&#12398;&#12377;&#12409;&#12390;&#12398;&#21452;&#26041;&#21521;&#38306;&#36899;&#12395;&#23550;&#12375;&#12390;2&#12388;&#12398;&#34920;&#29694;&#12434;&#25345;&#12388;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;1&#12388;&#12399;A&#12363;&#12425;B&#12408;&#12398;&#12522;&#12531;&#12463;&#12392;&#12289;&#12418;&#12358;&#12402;&#12392;&#12388;&#12399;B&#12363;&#12425;A&#12391;&#12398;&#12522;&#12531;&#12463;&#12391;&#12377;&#12290;&#12418;&#12375;Java&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65381;&#12514;&#12487;&#12523;&#12398;&#12371;&#12392;&#12434;&#32771;&#12360;&#12289;&#12393;&#12398;&#12424;&#12358;&#12395;Java&#12391;many-to-many&#38306;&#36899;&#12434;&#20316;&#25104;&#12377;&#12427;&#12363;&#32771;&#12360;&#12428;&#12400;&#12371;&#12428;&#12434;&#29702;&#35299;&#12377;&#12427;&#12398;&#12399;&#31777;&#21336;&#12391;&#12377;&#12290;:
        </p><pre class="programlisting">
category.getItems().add(item);          // The category now "knows" about the relationship
item.getCategories().add(category);     // The item now "knows" about the relationship

session.update(item);                     // No effect, nothing will be saved!
session.update(category);                 // The relationship will be saved</pre><p>
            inverse&#12391;&#12399;&#12394;&#12356;&#20596;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12408;&#12513;&#12514;&#12522;&#20869;&#12398;&#34920;&#29694;&#12434;&#20445;&#23384;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12418;&#12375;&#20001;&#26041;&#12398;&#20596;&#12364;&#22793;&#26356;&#12434;&#24341;&#12365;&#36215;&#12371;&#12377;&#22580;&#21512;&#12289;&#19981;&#24517;&#35201;&#12394;Insert/Update&#12381;&#12375;&#12390;&#24656;&#12425;&#12367;&#22806;&#37096;&#12461;&#12540;&#21046;&#32004;&#36949;&#21453;&#12434;&#36215;&#12371;&#12377;&#12391;&#12375;&#12423;&#12358;&#12290;&#12418;&#12385;&#12429;&#12435;&#21452;&#26041;&#21521;one-to-many&#38306;&#36899;&#12395;&#23550;&#12375;&#12390;&#12418;&#21516;&#12376;&#12371;&#12392;&#12364;&#35328;&#12360;&#12414;&#12377;&#12290;
        </p><p>
            &#21516;&#12376;&#12486;&#12540;&#12502;&#12523;&#65381;&#12459;&#12521;&#12512;&#12408;&#12398;one-to-many&#38306;&#36899;&#12434;many-to-one&#38306;&#36899;&#12392;&#12375;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12289;many&#20596;&#12398;&#38306;&#36899;&#31471;&#12434;<tt class="literal">inverse="true"</tt>&#12392;&#23459;&#35328;&#12377;&#12427;&#12371;&#12392;&#12391;&#21452;&#26041;&#21521;one-to-many&#38306;&#36899;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">&lt;class name="eg.Parent"&gt;
    &lt;id name="id" column="id"/&gt;
    ....
    &lt;set name="children" inverse="true" lazy="true"&gt;
        &lt;key column="parent_id"/&gt;
        &lt;one-to-many class="eg.Child"/&gt;
    &lt;/set&gt;
&lt;/class&gt;

&lt;class name="eg.Child"&gt;
    &lt;id name="id" column="id"/&gt;
    ....
    &lt;many-to-one name="parent" class="eg.Parent" column="parent_id"/&gt;
&lt;/class&gt;</pre><p>
            <tt class="literal">inverse="true"</tt>&#12391;&#12354;&#12427;&#38306;&#36899;&#12398;one&#20596;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#12459;&#12473;&#12465;&#12540;&#12489;&#25805;&#20316;&#12395;&#24433;&#38911;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#20001;&#32773;&#12399;&#30064;&#12394;&#12427;&#27010;&#24565;&#12391;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-ternary"></a>6.9. 3&#38917;&#38306;&#36899;</h2></div></div><div></div></div><p>
            3&#38917;&#38306;&#36899;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12395;&#12399;&#65298;&#12388;&#12398;&#21487;&#33021;&#12394;&#12450;&#12503;&#12525;&#12540;&#12481;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#65297;&#12388;&#30446;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12399;composite&#35201;&#32032;&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;(&#35696;&#35542;&#12399;&#24460;&#12411;&#12393;)&#12290;&#12418;&#12358;&#12402;&#12392;&#12388;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12399;&#38306;&#36899;&#12434;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#20351;&#12387;&#12383;<tt class="literal">Map</tt>&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;:
        </p><pre class="programlisting">&lt;map name="contracts" lazy="true"&gt;
    &lt;key column="employer_id"/&gt;
    &lt;index-many-to-many column="employee_id" class="Employee"/&gt;
    &lt;one-to-many class="Contract"/&gt;
&lt;/map&gt;</pre><pre class="programlisting">&lt;map name="connections" lazy="true"&gt;
    &lt;key column="node1_id"/&gt;
    &lt;index-many-to-many column="node2_id" class="Node"/&gt;
    &lt;many-to-many column="connection_id" class="Connection"/&gt;
&lt;/map&gt;</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-heterogeneous"></a>6.10. Heterogeneous&#12394;&#38306;&#36899;</h2></div></div><div></div></div><p>
	        <tt class="literal">&lt;many-to-any&gt;</tt>&#12362;&#12424;&#12403;<tt class="literal">&lt;index-many-to-any&gt;</tt>&#35201;&#32032;&#12399;Heterogeneous&#12394;&#38306;&#36899;(&#30064;&#12394;&#12427;&#22411;&#12364;&#28151;&#22312;&#12377;&#12427;&#38306;&#36899;)&#12395;&#23550;&#12375;&#12390;&#25552;&#20379;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#35201;&#32032;&#12399;<tt class="literal">&lt;any&gt;</tt>&#35201;&#32032;&#12392;&#21516;&#27096;&#12398;&#20316;&#29992;&#12434;&#12375;&#12414;&#12377;&#12290;&#12354;&#12427;&#12392;&#12375;&#12390;&#12418;&#12417;&#12387;&#12383;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
	    </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="collections-example"></a>6.11. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#20363;</h2></div></div><div></div></div><p>
            &#20170;&#12414;&#12391;&#12398;&#31680;&#12399;&#12363;&#12394;&#12426;&#28151;&#20081;&#12373;&#12379;&#12425;&#12428;&#12427;&#12398;&#12391;&#20197;&#19979;&#12398;&#20363;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;:
        </p><pre class="programlisting">package eg;
import java.util.Set;

public class Parent {
    private long id;
    private Set children;

    public long getId() { return id; }
    private void setId(long id) { this.id=id; }

    private Set getChildren() { return children; }
    private void setChildren(Set children) { this.children=children; }

    ....
    ....
}</pre><p>
            &#12371;&#12398;&#12463;&#12521;&#12473;&#12399; <tt class="literal">eg.Child</tt>&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12418;&#12375;&#21508;&#12293;&#12398;child&#12364;&#26368;&#22823;&#12391;&#12418;&#65297;&#12388;&#12398;parent&#12434;&#25345;&#12388;&#12394;&#12425;&#12400;&#26368;&#12418;&#33258;&#28982;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;one-to-many&#38306;&#36899;&#12391;&#12377;&#12290;:
        </p><pre class="programlisting">&lt;hibernate-mapping&gt;

    &lt;class name="eg.Parent"&gt;
        &lt;id name="id"&gt;
            &lt;generator class="sequence"/&gt;
        &lt;/id&gt;
        &lt;set name="children" lazy="true"&gt;
            &lt;key column="parent_id"/&gt;
            &lt;one-to-many class="eg.Child"/&gt;
        &lt;/set&gt;
    &lt;/class&gt;

    &lt;class name="eg.Child"&gt;
        &lt;id name="id"&gt;
            &lt;generator class="sequence"/&gt;
        &lt;/id&gt;
        &lt;property name="name"/&gt;
    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>
            &#12371;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12399;&#19979;&#12398;&#12486;&#12540;&#12502;&#12523;&#23450;&#32681;&#12408;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">create table parent ( id bigint not null primary key )
create table child ( id bigint not null primary key, name varchar(255), parent_id bigint )
alter table child add constraint childfk0 (parent_id) references parent</pre><p>
            &#12418;&#12375;&#12381;&#12398;parent&#12364;<span class="emphasis"><em>&#35201;&#27714;&#12373;&#12428;&#12383;</em></span>&#12394;&#12425;&#12400;&#21452;&#26041;&#21521;one-to-many&#38306;&#36899;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;(Parent/Child&#38306;&#20418;&#12398;&#31456;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;:
        </p><pre class="programlisting">&lt;hibernate-mapping&gt;

    &lt;class name="eg.Parent"&gt;
        &lt;id name="id"&gt;
            &lt;generator class="sequence"/&gt;
        &lt;/id&gt;
        &lt;set name="children" inverse="true" lazy="true"&gt;
            &lt;key column="parent_id"/&gt;
            &lt;one-to-many class="eg.Child"/&gt;
        &lt;/set&gt;
    &lt;/class&gt;

    &lt;class name="eg.Child"&gt;
        &lt;id name="id"&gt;
            &lt;generator class="sequence"/&gt;
        &lt;/id&gt;
        &lt;property name="name"/&gt;
        &lt;many-to-one name="parent" class="eg.Parent" column="parent_id" not-null="true"/&gt;
    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>
            <tt class="literal">NOT NULL</tt>&#21046;&#32004;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><pre class="programlisting">create table parent ( id bigint not null primary key )
create table child ( id bigint not null
                     primary key,
                     name varchar(255),
                     parent_id bigint not null )
alter table child add constraint childfk0 (parent_id) references parent</pre><p>
            &#19968;&#26041;&#12391;&#12289;child&#12364;&#35079;&#25968;&#12398;parent&#12434;&#25345;&#12390;&#12427;&#12394;&#12425;&#12400;many-to-many&#38306;&#36899;&#12364;&#22949;&#24403;&#12391;&#12377;&#12290;:
        </p><pre class="programlisting">&lt;hibernate-mapping&gt;

    &lt;class name="eg.Parent"&gt;
        &lt;id name="id"&gt;
            &lt;generator class="sequence"/&gt;
        &lt;/id&gt;
        &lt;set name="children" lazy="true" table="childset"&gt;
            &lt;key column="parent_id"/&gt;
            &lt;many-to-many class="eg.Child" column="child_id"/&gt;
        &lt;/set&gt;
    &lt;/class&gt;

    &lt;class name="eg.Child"&gt;
        &lt;id name="id"&gt;
            &lt;generator class="sequence"/&gt;
        &lt;/id&gt;
        &lt;property name="name"/&gt;
    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>
            &#12486;&#12540;&#12502;&#12523;&#23450;&#32681;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;: 
        </p><pre class="programlisting">create table parent ( id bigint not null primary key )
create table child ( id bigint not null primary key, name varchar(255) )
create table childset ( parent_id bigint not null,
                        child_id bigint not null,
                        primary key ( parent_id, child_id ) )
alter table childset add constraint childsetfk0 (parent_id) references parent
alter table childset add constraint childsetfk1 (child_id) references child</pre></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="mapping.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="components.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;5&#31456; O/R&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#22522;&#26412;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;7&#31456; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</td></tr></table></div></body></html>