<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;7&#31456; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="collections.html" title="&#31532;6&#31456; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;"><link rel="next" href="inheritance.html" title="&#31532;8&#31456; &#32153;&#25215;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;7&#31456; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="collections.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="inheritance.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="components"></a>&#31532;7&#31456; &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</h2></div></div><div></div></div><p>
        <span class="emphasis"><em>&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</em></span>&#12399;&#12289;Hibernate&#12434;&#36890;&#12375;&#12390;&#27096;&#12293;&#12394;&#29366;&#27841;&#12398;&#20013;&#12391;&#30064;&#12394;&#12427;&#30446;&#30340;&#12398;&#12383;&#12417;&#12395;&#20877;&#21033;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
    </p><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="components-dependentobjects"></a>7.1. &#20381;&#23384;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</h2></div></div><div></div></div><p>
            &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12391;&#12399;&#12394;&#12367;&#12496;&#12522;&#12517;&#12540;&#65381;&#12479;&#12452;&#12503;&#12392;&#12375;&#12390;&#27704;&#32154;&#21270;&#12373;&#12428;&#12383;&#12289;&#21253;&#21547;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;&#12388;&#12414;&#12426;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12399;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12391;&#12399;&#12394;&#12367;&#12289;&#12496;&#12522;&#12517;&#12540;&#65381;&#12479;&#12452;&#12503;&#12391;&#12377;&#12290;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12356;&#12358;&#35328;&#33865;&#12399;&#12467;&#12531;&#12509;&#12472;&#12471;&#12519;&#12531;&#12392;&#12356;&#12358;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12398;&#27010;&#24565;&#12434;&#21442;&#29031;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;(&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12524;&#12505;&#12523;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;)&#12290;&#20363;&#12360;&#12400;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;Person&#12434;&#12514;&#12487;&#12523;&#12392;&#12375;&#12414;&#12377;&#12290;: 
        </p><pre class="programlisting">public class Person {
    private java.util.Date birthday;
    private Name name;
    private String key;
    public String getKey() {
        return key;
    }
    private void setKey(String key) {
        this.key=key;
    }
    public java.util.Date getBirthday() {
        return birthday;
    }
    public void setBirthday(java.util.Date birthday) {
        this.birthday = birthday;
    }
    public Name getName() {
        return name;
    }
    public void setName(Name name) {
        this.name = name;
    }
    ......
    ......
}</pre><pre class="programlisting">public class Name {
    char initial;
    String first;
    String last;
    public String getFirst() {
        return first;
    }
    void setFirst(String first) {
        this.first = first;
    }
    public String getLast() {
        return last;
    }
    void setLast(String last) {
        this.last = last;
    }
    public char getInitial() {
        return initial;
    }
    void setInitial(char initial) {
        this.initial = initial;
    }
}</pre><p>
            &#12356;&#12414;<tt class="literal">Name</tt>&#12399;<tt class="literal">Person</tt>&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12375;&#12390;&#27704;&#32154;&#21270;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12371;&#12391;<tt class="literal">Name</tt>&#12398;&#27704;&#32154;&#21270;&#23646;&#24615;&#12395;&#23550;&#12375;&#12390;&#12466;&#12483;&#12479;&#12540;&#12289;&#12475;&#12483;&#12479;&#12540;&#65381;&#12513;&#12477;&#12483;&#12489;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12364;&#12289;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12540;&#12473;&#12420;&#35672;&#21029;&#23376;&#12501;&#12451;&#12540;&#12523;&#12489;&#12434;&#23459;&#35328;&#12377;&#12427;&#24517;&#35201;&#12364;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;
        </p><p>
            &#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">&lt;class name="eg.Person" table="person"&gt;
    &lt;id name="Key" column="pid" type="string"&gt;
        &lt;generator class="uuid.hex"/&gt;
    &lt;/id&gt;
    &lt;property name="birthday" type="date"/&gt;
    &lt;component name="Name" class="eg.Name"&gt; &lt;!-- class attribute optional --&gt;
        &lt;property name="initial"/&gt;
        &lt;property name="first"/&gt;
        &lt;property name="last"/&gt;
    &lt;/component&gt;
&lt;/class&gt;</pre><p>
            person&#12486;&#12540;&#12502;&#12523;&#12399;<tt class="literal">pid</tt>,
            <tt class="literal">birthday</tt>,
            <tt class="literal">initial</tt>,
            <tt class="literal">first</tt> ,
            <tt class="literal">last</tt>&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;
        </p><p>
           &#12377;&#12409;&#12390;&#12398;&#12496;&#12522;&#12517;&#12540;&#65381;&#12479;&#12452;&#12503;&#12398;&#12424;&#12358;&#12395;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#21442;&#29031;&#12399;&#20849;&#26377;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;null&#20516;&#12395;&#12362;&#12369;&#12427;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12399;<span class="emphasis"><em>&#12450;&#12489;&#12507;&#12483;&#12463;</em></span>&#12391;&#12377;&#12290;&#21547;&#12435;&#12391;&#12356;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20877;&#35501;&#12415;&#36796;&#12415;&#12377;&#12427;&#22580;&#21512;&#12289;Hibernate&#12399;&#12377;&#12409;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12459;&#12521;&#12512;&#12364;null&#12391;&#12354;&#12427;&#12289;&#12377;&#12394;&#12431;&#12385;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#33258;&#20307;&#12364;null&#12391;&#12354;&#12427;&#12392;&#24819;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#20107;&#12399;&#22823;&#25269;&#12398;&#22580;&#21512;&#21839;&#38988;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12393;&#12435;&#12394;Hibernate&#12398;&#22411;&#12391;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;(&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12289;many-to-one&#38306;&#36899;&#12289;&#20182;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12394;&#12393;)&#12290;&#12493;&#12473;&#12488;&#12373;&#12428;&#12383;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12417;&#12387;&#12383;&#12395;&#20351;&#12431;&#12394;&#12356;&#20351;&#29992;&#27861;&#12392;&#32771;&#12360;&#12427;&#12409;&#12365;&#12391;&#12399;<span class="emphasis"><em>&#12354;&#12426;&#12414;&#12379;&#12435;</em></span>&#12290;Hibernate&#12399;&#38750;&#24120;&#12395;&#12365;&#12417;&#12398;&#32048;&#12363;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12514;&#12487;&#12523;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12424;&#12358;&#12395;&#24847;&#22259;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">&lt;component&gt;</tt>&#35201;&#32032;&#12399;&#35242;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#12398;&#36870;&#21442;&#29031;&#12392;&#12375;&#12390;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12539;&#12463;&#12521;&#12473;&#12398;&#23646;&#24615;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;<tt class="literal">&lt;parent&gt;</tt>&#12469;&#12502;&#35201;&#32032;&#12434;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">&lt;class name="eg.Person" table="person"&gt;
    &lt;id name="Key" column="pid" type="string"&gt;
        &lt;generator class="uuid.hex"/&gt;
    &lt;/id&gt;
    &lt;property name="birthday" type="date"/&gt;
    &lt;component name="Name" class="eg.Name"&gt;
        &lt;parent name="namedPerson"/&gt; &lt;!-- reference back to the Person --&gt;
        &lt;property name="initial"/&gt;
        &lt;property name="first"/&gt;
        &lt;property name="last"/&gt;
    &lt;/component&gt;
&lt;/class&gt;</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="components-incollections"></a>7.2. &#20381;&#23384;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;</h2></div></div><div></div></div><p>
            Hibernate&#12399;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;(&#20363;&#12360;&#12400;<tt class="literal">Name</tt>&#22411;&#12398;&#37197;&#21015;)&#12290;<tt class="literal">&lt;element&gt;</tt>&#12479;&#12464;&#12398;&#20195;&#12431;&#12426;&#12395;<tt class="literal">&lt;composite-element&gt;</tt>&#12479;&#12464;&#12434;&#20351;&#12387;&#12390;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#23459;&#35328;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;:
        </p><pre class="programlisting">&lt;set name="someNames" table="some_names" lazy="true"&gt;
    &lt;key column="id"/&gt;
    &lt;composite-element class="eg.Name"&gt; &lt;!-- class attribute required --&gt;
        &lt;property name="initial"/&gt;
        &lt;property name="first"/&gt;
        &lt;property name="last"/&gt;
    &lt;/composite-element&gt;
&lt;/set&gt;</pre><p>
            &#27880;&#24847;:&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;<tt class="literal">Set</tt>&#12434;&#23450;&#32681;&#12375;&#12383;&#12394;&#12425;&#12400;<tt class="literal">equals()</tt>&#12392;<tt class="literal">hashCode()</tt>&#12434;&#27491;&#12375;&#12367;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12399;&#37325;&#35201;&#12391;&#12377;&#12290;
        </p><p>
            &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12391;&#12399;&#12394;&#12367;&#12289;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#33258;&#36523;&#12364;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427;&#22580;&#21512;&#12399;<tt class="literal">&lt;nested-composite-element&gt;</tt>&#12479;&#12464;&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#33258;&#36523;&#12364;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#25345;&#12387;&#12390;&#12356;&#12427;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12289;&#12392;&#12356;&#12387;&#12383;&#12465;&#12540;&#12473;&#12399;&#12417;&#12387;&#12383;&#12395;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#27573;&#38542;&#12414;&#12391;&#12395;one-to-many&#38306;&#36899;&#12398;&#26041;&#12364;&#12424;&#12426;&#36969;&#20999;&#12394;&#12398;&#12391;&#12399;&#12394;&#12356;&#12363;&#12392;&#32771;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;&#12375;&#12390;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#12434;&#20877;&#12514;&#12487;&#12522;&#12531;&#12464;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12375;&#12363;&#12375;Java&#12514;&#12487;&#12523;&#12399;&#21516;&#12376;&#12391;&#12377;&#12364;&#12289;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12514;&#12487;&#12523;&#12392;&#27704;&#32154;&#21205;&#20316;&#12399;&#12414;&#12384;&#12431;&#12378;&#12363;&#12395;&#30064;&#12394;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><p>
           &#12418;&#12375;<tt class="literal">&lt;set&gt;</tt>&#12434;&#20351;&#29992;&#12377;&#12427;&#12394;&#12425;&#12289;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12364;null&#12434;&#25345;&#12388;&#23646;&#24615;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;Hibernate&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12392;&#12365;&#12395;&#12289;&#12524;&#12467;&#12540;&#12489;&#12434;&#35672;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#21508;&#12293;&#12398;&#12459;&#12521;&#12512;&#12398;&#20516;&#12434;&#20351;&#29992;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12398;&#12391;&#12289;null&#20516;&#12434;&#25345;&#12390;&#12414;&#12379;&#12435;(&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#12486;&#12540;&#12502;&#12523;&#12395;&#12399;&#21029;&#12398;&#20027;&#12461;&#12540;&#12459;&#12521;&#12512;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;)&#12290;not-null&#12398;&#23646;&#24615;&#12434;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#12391;&#20351;&#29992;&#12377;&#12427;&#12363;&#12289;&#12414;&#12383;&#12399;<tt class="literal">&lt;list&gt;</tt>, <tt class="literal">&lt;map&gt;</tt>,
            <tt class="literal">&lt;bag&gt;</tt>, <tt class="literal">&lt;idbag&gt;</tt>&#12434;&#36984;&#25246;&#12377;&#12427;&#12363;&#12375;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290; 
        </p><p>
            &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#12398;&#29305;&#21029;&#12394;&#12465;&#12540;&#12473;&#12399;&#20837;&#12428;&#23376;&#12398;<tt class="literal">&lt;many-to-one&gt;</tt> &#35201;&#32032;&#12434;&#25345;&#12387;&#12383;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#12391;&#12377;&#12290;&#12371;&#12398;&#12424;&#12358;&#12394;&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#12539;&#12463;&#12521;&#12473;&#12395;many-to-many&#38306;&#36899;&#12486;&#12540;&#12502;&#12523;&#12398;&#20313;&#20998;&#12394;&#12459;&#12521;&#12512;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12371;&#12392;&#12434;&#21487;&#33021;&#12395;&#12375;&#12414;&#12377;&#12290;&#27425;&#12399;<tt class="literal">Order</tt>&#12363;&#12425;&#12289;<tt class="literal">purchaseDate</tt>&#12289;<tt class="literal">price</tt>&#12289;<tt class="literal">quantity</tt>&#12364;&#38306;&#36899;&#12363;&#12425;&#12398;&#23646;&#24615;&#12391;&#12354;&#12427;<tt class="literal">Item</tt>&#12408;&#12398;many-to-many&#38306;&#36899;&#12398;&#20363;&#12391;&#12377;&#12290;
        </p><pre class="programlisting">&lt;class name="eg.Order" .... &gt;
    ....
    &lt;set name="purchasedItems" table="purchase_items" lazy="true"&gt;
        &lt;key column="order_id"&gt;
        &lt;composite-element class="eg.Purchase"&gt;
            &lt;property name="purchaseDate"/&gt;
            &lt;property name="price"/&gt;
            &lt;property name="quantity"/&gt;
            &lt;many-to-one name="item" class="eg.Item"/&gt; &lt;!-- class&#23646;&#24615;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377; --&gt;
        &lt;/composite-element&gt;
    &lt;/set&gt;
&lt;/class&gt;</pre><p>3&#38917;&#38306;&#36899;(&#12354;&#12427;&#12356;&#12399;4&#38917;&#12289;&#12381;&#12428;&#20197;&#19978;)&#12373;&#12360;&#21487;&#33021;&#12391;&#12377;:</p><pre class="programlisting">&lt;class name="eg.Order" .... &gt;
    ....
    &lt;set name="purchasedItems" table="purchase_items" lazy="true"&gt;
        &lt;key column="order_id"&gt;
        &lt;composite-element class="eg.OrderLine"&gt;
            &lt;many-to-one name="purchaseDetails class="eg.Purchase"/&gt;
            &lt;many-to-one name="item" class="eg.Item"/&gt;
        &lt;/composite-element&gt;
    &lt;/set&gt;
&lt;/class&gt;</pre><p>
            &#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;&#12399;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#12398;&#38306;&#36899;&#12392;&#12375;&#12390;&#21516;&#12376;&#12471;&#12531;&#12479;&#12483;&#12463;&#12473;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12463;&#12456;&#12522;&#20869;&#12391;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="components-asmapindex"></a>7.3. map&#12398;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12392;&#12375;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</h2></div></div><div></div></div><p>
            <tt class="literal">&lt;composite-index&gt;</tt>&#35201;&#32032;&#12399;<tt class="literal">Map</tt>&#12398;&#12461;&#12540;&#12392;&#12375;&#12390;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#12463;&#12521;&#12473;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;
&#24517;&#12378;&#12510;&#12483;&#12500;&#12531;&#12464;&#12463;&#12521;&#12473;&#19978;&#12391;<tt class="literal">hashCode()</tt>&#12362;&#12424;&#12403;<tt class="literal">equals()</tt>&#12434;&#27491;&#30906;&#12395;&#12458;&#12540;&#12496;&#12521;&#12452;&#12489;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290; 
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="components-compositeid"></a>7.4. &#35079;&#21512;&#35672;&#21029;&#23376;&#12392;&#12375;&#12390;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</h2></div></div><div></div></div><p>
            &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12434;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12539;&#12463;&#12521;&#12473;&#12398;&#35672;&#21029;&#23376;&#12392;&#12375;&#12390;&#12418;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12539;&#12463;&#12521;&#12473;&#12399;&#20197;&#19979;&#12398;&#12354;&#12427;&#26465;&#20214;&#12434;&#28288;&#12383;&#12373;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;:
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    <tt class="literal">java.io.Serializable</tt>&#12434;&#23455;&#35013;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
                </p></li><li><p>
                    &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#35079;&#21512;&#12461;&#12540;&#12392;&#21516;&#31561;&#12398;&#27010;&#24565;&#12392;&#12375;&#12390;<tt class="literal">equals()</tt> &#12392;
                    <tt class="literal">hashCode()</tt>&#12434;&#19968;&#36011;&#12375;&#12390;&#20877;&#23455;&#35013;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
                </p></li></ul></div><p>
            &#35079;&#21512;&#12461;&#12540;&#12434;&#29983;&#25104;&#12377;&#12427;&#12383;&#12417;&#12395;<tt class="literal">IdentifierGenerator</tt>&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#20195;&#12431;&#12426;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12381;&#12428;&#33258;&#36523;&#12398;&#35672;&#21029;&#23376;&#12434;&#21106;&#12426;&#24403;&#12390;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            &#35079;&#21512;&#35672;&#21029;&#23376;&#12399;&#20445;&#23384;&#12377;&#12427;&#21069;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12394;&#12367;&#12390;&#12399;&#12394;&#12425;&#12394;&#12356;&#12398;&#12391;&#12289;&#26032;&#12375;&#12367;&#20316;&#25104;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#20197;&#21069;&#12398;Session&#12391;&#20445;&#23384;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21306;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#35672;&#21029;&#23376;&#12398;<tt class="literal">unsaved-value</tt>&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            <tt class="literal">saveOrUpdate()</tt>&#12354;&#12427;&#12356;&#12399;&#20445;&#23384;/&#26356;&#26032;&#12398;&#12459;&#12473;&#12465;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12383;&#12369;&#12428;&#12400;&#12289;&#12381;&#12398;&#20195;&#12426;&#12395;<tt class="literal">Interceptor.isUnsaved()</tt>&#12434;&#23455;&#35013;&#12391;&#12365;&#12414;&#12377;&#12290;&#20195;&#26696;&#12392;&#12375;&#12390;&#12289;&#26032;&#12375;&#12356;&#19968;&#26178;&#30340;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#31034;&#12377;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;<tt class="literal">&lt;version&gt;</tt>&#35201;&#32032;(&#12414;&#12383;&#12399;<tt class="literal">&lt;timestamp&gt;</tt>&#35201;&#32032;)&#12395;<tt class="literal">unsaved-value</tt>&#23646;&#24615;&#12434;&#35373;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290; &#12371;&#12398;&#22580;&#21512;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;(&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;)&#35672;&#21029;&#23376;&#12398;&#20195;&#12431;&#12426;&#12395;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<tt class="literal">Interceptor.isUnsaved()</tt>&#12434;&#12354;&#12394;&#12383;&#33258;&#36523;&#12364;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            &#35079;&#21512;&#35672;&#21029;&#23376;&#12463;&#12521;&#12473;&#12398;&#23459;&#35328;&#12395;<tt class="literal">&lt;id&gt;</tt>&#12398;&#20195;&#12431;&#12426;&#12395;<tt class="literal">&lt;composite-id&gt;</tt>&#12479;&#12464;(<tt class="literal">&lt;component&gt;</tt>&#12392;&#21516;&#12376;&#23646;&#24615;&#12362;&#12424;&#12403;&#35201;&#32032;)&#12434;&#20351;&#29992;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;:
        </p><pre class="programlisting">&lt;class name="eg.Foo" table"FOOS"&gt;
    &lt;composite-id name="compId" class="eg.FooCompositeID"&gt;
        &lt;key-property name="string"/&gt;
        &lt;key-property name="short"/&gt;
        &lt;key-property name="date" column="date_" type="date"/&gt;
    &lt;/composite-id&gt;
    &lt;property name="name"/&gt;
    ....
&lt;/class&gt;</pre><p>
            &#12486;&#12540;&#12502;&#12523;<tt class="literal">FOOS</tt>&#12408;&#12398;&#22806;&#37096;&#12461;&#12540;&#12418;&#35079;&#21512;&#12461;&#12540;&#12391;&#12377;&#12290;&#20182;&#12398;&#12463;&#12521;&#12473;&#29992;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12398;&#20013;&#12391;&#12371;&#12428;&#12434;&#23459;&#35328;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;<tt class="literal">Foo</tt>&#12408;&#12398;&#38306;&#36899;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#23459;&#35328;&#12373;&#12428;&#12414;&#12377;&#12290;:
        </p><pre class="programlisting">&lt;many-to-one name="foo" class="eg.Foo"&gt;
&lt;!-- the "class" attribute is optional, as usual --&gt;
    &lt;column name="foo_string"/&gt;
    &lt;column name="foo_short"/&gt;
    &lt;column name="foo_date"/&gt;
&lt;/many-to-one&gt;</pre><p>
        &#12371;&#12398;&#26032;&#12375;&#12356;<tt class="literal">&lt;column&gt;</tt>&#12479;&#12464;&#12418;&#22810;&#37325;&#12459;&#12521;&#12512;&#65381;&#12459;&#12473;&#12479;&#12512;&#22411;&#12395;&#12424;&#12387;&#12390;&#20351;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;&#23455;&#38555;&#12395;&#12393;&#12371;&#12391;&#12418;<tt class="literal">column</tt>&#23646;&#24615;&#12398;&#20195;&#12431;&#12426;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;<tt class="literal">Foo</tt>&#22411;&#12398;&#35201;&#32032;&#12434;&#20633;&#12360;&#12383;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#20351;&#29992;&#12375;&#12414;&#12377;&#12290;:
    </p><pre class="programlisting">&lt;set name="foos"&gt;
    &lt;key column="owner_id"/&gt;
    &lt;many-to-many class="eg.Foo"&gt;
        &lt;column name="foo_string"/&gt;
        &lt;column name="foo_short"/&gt;
        &lt;column name="foo_date"/&gt;
    &lt;/many-to-many&gt;
&lt;/set&gt;</pre><p>
            &#20182;&#26041;&#12391;&#12289;&#36890;&#24120;<tt class="literal">&lt;one-to-many&gt;</tt>&#12399;&#12459;&#12521;&#12512;&#12434;&#23459;&#35328;&#12375;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            <tt class="literal">Foo</tt>&#33258;&#36523;&#12364;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427;&#22580;&#21512;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#35079;&#21512;&#22806;&#37096;&#12461;&#12540;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">&lt;class name="eg.Foo"&gt;
    ....
    ....
    &lt;set name="dates" lazy="true"&gt;
        &lt;key&gt;   &lt;!-- a collection inherits the composite key type --&gt;
            &lt;column name="foo_string"/&gt;
            &lt;column name="foo_short"/&gt;
            &lt;column name="foo_date"/&gt;
        &lt;/key&gt;
        &lt;element column="foo_date" type="date"/&gt;
    &lt;/set&gt;
&lt;/class&gt;</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="components-dynamic"></a>7.5. &#21205;&#30340;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;</h2></div></div><div></div></div><p>
            &#20197;&#19979;&#12398;&#12424;&#12358;&#12395;<tt class="literal">Map</tt>&#22411;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12418;&#21487;&#33021;&#12391;&#12377;&#65306; 
        </p><pre class="programlisting">&lt;dynamic-component name="userAttributes"&gt;
    &lt;property name="foo" column="FOO"/&gt;
    &lt;property name="bar" column="BAR"/&gt;
    &lt;many-to-one name="baz" class="eg.Baz" column="BAZ"/&gt;
&lt;/dynamic-component&gt;</pre><p>
            <tt class="literal">&lt;dynamic-component&gt;</tt>&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12399;<tt class="literal">&lt;component&gt;</tt>&#12392;&#21516;&#12376;&#12391;&#12377;&#12290;&#12371;&#12398;&#31278;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#21033;&#28857;&#12399;&#12510;&#12483;&#12500;&#12531;&#12464;&#25991;&#26360;&#32232;&#38598;&#12395;&#12424;&#12426;&#12289;&#37197;&#32622;&#26178;&#12395;&#12499;&#12540;&#12531;&#12398;&#23646;&#24615;&#12434;&#27770;&#23450;&#12391;&#12365;&#12427;&#28857;&#12391;&#12377;&#12290;(&#12373;&#12425;&#12395;&#12289;DOM&#12497;&#12540;&#12469;&#12434;&#20351;&#29992;&#12375;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#23455;&#34892;&#26178;&#12395;&#25805;&#20316;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;)&#12290; 
        </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="collections.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="inheritance.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;6&#31456; &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;8&#31456; &#32153;&#25215;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</td></tr></table></div></body></html>