<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;16&#31456; &#20363;: &#35242;/&#23376;&#38306;&#20418;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="toolsetguide.html" title="&#31532;15&#31456; &#12484;&#12540;&#12523;&#12475;&#12483;&#12488;&#65381;&#12460;&#12452;&#12489;"><link rel="next" href="example-weblog.html" title="&#31532;17&#31456; &#20363;: Weblog&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;16&#31456; &#20363;: &#35242;/&#23376;&#38306;&#20418;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="toolsetguide.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="example-weblog.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="example-parentchild"></a>&#31532;16&#31456; &#20363;: &#35242;/&#23376;&#38306;&#20418;</h2></div></div><div></div></div><p>
        &#26032;&#35215;&#12518;&#12540;&#12470;&#12364;Hibernate&#12434;&#20351;&#12356;&#12414;&#12378;&#26368;&#21021;&#12395;&#25201;&#12358;&#12514;&#12487;&#12523;&#12398;&#19968;&#12388;&#12399;&#12289;&#35242;&#23376;&#22411;&#12398;&#38306;&#20418;&#12391;&#12377;&#12290;&#12371;&#12428;&#12395;&#12399;&#30064;&#12394;&#12387;&#12383;2&#12388;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12364;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;&#12392;&#12426;&#12431;&#12369;&#26032;&#35215;&#12518;&#12540;&#12470;&#12395;&#12392;&#12387;&#12390;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394;&#29702;&#30001;&#12363;&#12425;&#26368;&#12418;&#20415;&#21033;&#12384;&#12392;&#24605;&#12431;&#12428;&#12427;&#12450;&#12503;&#12525;&#12540;&#12481;&#12399;&#12289;<tt class="literal">&#35242;</tt>&#12363;&#12425;<tt class="literal">&#23376;</tt>&#12408;&#12398;<tt class="literal">&lt;one-to-many&gt;</tt> &#38306;&#36899;&#12395;&#12424;&#12426;<tt class="literal">&#35242;</tt>&#12392;<tt class="literal">&#23376;</tt>&#12398;&#20001;&#26041;&#12434;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12463;&#12521;&#12473;&#12392;&#12375;&#12390;&#12514;&#12487;&#12522;&#12531;&#12464;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#12290;&#65288;&#12418;&#12358;&#19968;&#12388;&#12398;&#26041;&#27861;&#12399;&#12289;<tt class="literal">&#23376;</tt>&#12434;<tt class="literal">&lt;composite-element&gt;</tt>&#12392;&#12375;&#12390;&#23450;&#32681;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;&#65289;&#12371;&#12428;&#12414;&#12391;&#12391;&#12289;(Hibernate&#12391;&#12399;)one-to-many&#38306;&#36899;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#24847;&#21619;&#12364;&#12289;&#36890;&#24120;&#35079;&#21512;&#35201;&#32032;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12424;&#12426;&#12418;&#35242;&#23376;&#38306;&#20418;&#12398;&#24847;&#21619;&#12395;&#12363;&#12394;&#12426;&#36817;&#12356;&#12371;&#12392;&#12364;&#12431;&#12363;&#12426;&#12414;&#12375;&#12383;&#12290;
&#12381;&#12428;&#12391;&#12399;&#35242;&#23376;&#38306;&#20418;&#12434;&#21177;&#29575;&#30340;&#12363;&#12388;&#12456;&#12524;&#12460;&#12531;&#12488;&#12395;&#12514;&#12487;&#12522;&#12531;&#12464;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12393;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;<span class="emphasis"><em>&#12459;&#12473;&#12465;&#12540;&#12489;&#25805;&#20316;&#12434;&#20351;&#12387;&#12383;&#21452;&#26041;&#21521;one-to-many&#38306;&#36899;</em></span>&#12434;&#25201;&#12358;&#12398;&#12363;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;&#12381;&#12428;&#12399;&#12414;&#12387;&#12383;&#12367;&#38627;&#12375;&#12356;&#12418;&#12398;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#65281;
    </p><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="example-parentchild-collections"></a>16.1. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12388;&#12356;&#12390;&#12398;&#27880;&#24847;</h2></div></div><div></div></div><p>
            Hibernate&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;&#25152;&#25345;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#35542;&#29702;&#30340;&#12394;&#37096;&#20998;&#12392;&#32771;&#12360;&#12425;&#12428;&#12289;&#12381;&#12428;&#12399;&#25152;&#25345;&#12373;&#12428;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12391;&#12399;&#27770;&#12375;&#12390;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12399;&#33268;&#21629;&#30340;&#12394;&#36949;&#12356;&#12391;&#12377;&#65281;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#32080;&#26524;&#12395;&#12394;&#12426;&#12414;&#12377;&#65306;
        </p><div class="itemizedlist"><ul type="disc"><li><p>
                &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;&#21066;&#38500;&#12289;&#12414;&#12383;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12377;&#12427;&#12392;&#12365;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12458;&#12540;&#12490;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12399;&#12452;&#12531;&#12463;&#12522;&#12513;&#12531;&#12488;&#12373;&#12428;&#12414;&#12377;&#12290;
            </p></li><li><p>
                &#12418;&#12375;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12496;&#12522;&#12517;&#12540;&#65381;&#12479;&#12452;&#12503;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;(&#20363;&#12360;&#12400;&#12467;&#12531;&#12509;&#12472;&#12483;&#12488;&#65381;&#12456;&#12524;&#12513;&#12531;&#12488;)&#12384;&#12387;&#12383;&#12394;&#12425;&#12400;&#12289;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#27704;&#32154;&#21270;&#12373;&#12428;&#12378;&#12289;&#12381;&#12398;&#29366;&#24907;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#23436;&#20840;&#12395;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;&#21516;&#12376;&#12424;&#12358;&#12395;&#12289;&#12496;&#12522;&#12517;&#12540;&#65381;&#12479;&#12452;&#12503;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12377;&#12427;&#12392;&#12289;&#12381;&#12398;&#29366;&#24907;&#12399;&#21363;&#24231;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;
            </p></li><li><p>
                &#12381;&#12398;&#19968;&#26041;&#12289;&#12418;&#12375;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;(one-to-many&#12414;&#12383;&#12399;many-to-many&#38306;&#36899;)&#12363;&#12425;&#21066;&#38500;&#12373;&#12428;&#12390;&#12418;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12381;&#12428;&#12399;&#21066;&#38500;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#25391;&#12427;&#33310;&#12356;&#12399;&#23436;&#20840;&#12395;&#39318;&#23614;&#19968;&#36011;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12377;&#12394;&#12431;&#12385;&#12289;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#20869;&#37096;&#29366;&#24907;&#12408;&#12398;&#22793;&#26356;&#12395;&#12424;&#12387;&#12390;&#12289;&#38306;&#36899;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#28040;&#28357;&#12377;&#12409;&#12365;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#65281;&#21516;&#27096;&#12395;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12373;&#12428;&#12390;&#12418;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12381;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12399;&#27704;&#32154;&#21270;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
            </p></li></ul></div><p>
            &#12381;&#12398;&#20195;&#12431;&#12426;&#12395;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#25391;&#12427;&#33310;&#12356;&#12391;&#12399;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12377;&#12427;&#12392;&#21336;&#12395;2&#12388;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#38291;&#12398;&#12522;&#12531;&#12463;&#12434;&#20316;&#25104;&#12375;&#12289;&#19968;&#26041;&#12391;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#21066;&#38500;&#12377;&#12427;&#12392;&#12522;&#12531;&#12463;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12377;&#12409;&#12390;&#12398;&#12465;&#12540;&#12473;&#12395;&#12362;&#12356;&#12390;&#12289;&#38750;&#24120;&#12395;&#36969;&#20999;&#12384;&#12392;&#35328;&#12360;&#12414;&#12377;&#12290;&#12375;&#12363;&#12375;&#23376;&#12364;&#35242;&#12398;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12395;&#21046;&#38480;&#12373;&#12428;&#12427;&#35242;&#23376;&#38306;&#20418;&#12398;&#12465;&#12540;&#12473;&#12391;&#12399;&#12289;&#20840;&#12367;&#36969;&#20999;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="example-parentchild-bidir"></a>16.2. &#21452;&#26041;&#21521;one-to-many</h2></div></div><div></div></div><p>
            <tt class="literal">Parent</tt>&#12363;&#12425;<tt class="literal">Child</tt>&#12408;&#12398;&#21336;&#32020;&#12394;<tt class="literal">&lt;one-to-many&gt;</tt>&#38306;&#36899;&#12363;&#12425;&#22987;&#12417;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">&lt;set name="children"&gt;
    &lt;key column="parent_id"/&gt;
    &lt;one-to-many class="Child"/&gt;
&lt;/set&gt;</pre><p>
            &#12418;&#12375;&#20197;&#19979;&#12398;&#12467;&#12540;&#12489;&#12434;&#23455;&#34892;&#12377;&#12427;&#12392;&#12289;
        </p><pre class="programlisting">Parent p = .....;
Child c = new Child();
p.getChildren().add(c);
session.save(c);
session.flush();</pre><p>
            Hibernate&#12399;&#12289;2&#12388;&#12398;SQL&#25991;&#12434;&#30330;&#34892;&#12375;&#12414;&#12377;&#65306;
        </p><div class="itemizedlist"><ul type="disc"><li><p><tt class="literal">c</tt>&#12395;&#23550;&#12377;&#12427;&#12524;&#12467;&#12540;&#12489;&#12434;&#29983;&#25104;&#12377;&#12427;<tt class="literal">INSERT</tt></p></li><li><p>
                <tt class="literal">p</tt>&#12363;&#12425;<tt class="literal">c</tt>&#12408;&#12398;&#12522;&#12531;&#12463;&#12434;&#20316;&#25104;&#12377;&#12427;<tt class="literal">UPDATE</tt>
            </p></li></ul></div><p>
            &#12371;&#12428;&#12399;&#38750;&#21177;&#29575;&#30340;&#12394;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;<tt class="literal">parent_id</tt>&#12459;&#12521;&#12512;&#12395;&#12362;&#12356;&#12390;<tt class="literal">NOT NULL</tt>&#21046;&#32004;&#12395;&#36949;&#21453;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">p</tt>&#12363;&#12425;<tt class="literal">c</tt>&#12408;&#12398;&#12522;&#12531;&#12463;&#65288;&#22806;&#37096;&#12461;&#12540;<tt class="literal">parent_id</tt>)&#12399;<tt class="literal">Child</tt>&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12398;&#19968;&#37096;&#12392;&#12399;&#32771;&#12360;&#12425;&#12428;&#12378;&#12289;&#12381;&#12398;&#12383;&#12417;<tt class="literal">INSERT</tt>&#12395;&#12424;&#12387;&#12390;&#22806;&#37096;&#12461;&#12540;&#12399;&#20316;&#25104;&#12373;&#12428;&#12394;&#12356;&#12371;&#12392;&#12364;&#21407;&#22240;&#12391;&#12377;&#12290;&#12391;&#12377;&#12363;&#12425;&#12289;&#35299;&#27770;&#31574;&#12399;Child&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#19968;&#37096;&#12395;&#12522;&#12531;&#12463;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
        </p><pre class="programlisting">&lt;many-to-one name="parent" column="parent_id" not-null="true"/&gt;</pre><p>
            (&#12414;&#12383;<tt class="literal">Child</tt>&#12463;&#12521;&#12473;&#12395;<tt class="literal">parent</tt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#36861;&#21152;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
        </p><p>
            &#12373;&#12354;&#12381;&#12428;&#12391;&#12399;<tt class="literal">Child</tt>&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#12522;&#12531;&#12463;&#12398;&#29366;&#24907;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12398;&#12391;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#12522;&#12531;&#12463;&#12434;&#26356;&#26032;&#12375;&#12394;&#12356;&#12424;&#12358;&#12395;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;<tt class="literal">inverse</tt>&#23646;&#24615;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">&lt;set name="children" inverse="true"&gt;
    &lt;key column="parent_id"/&gt;
    &lt;one-to-many class="Child"/&gt;
&lt;/set&gt;</pre><p>
            &#20197;&#19979;&#12398;&#12467;&#12540;&#12489;&#12434;&#20351;&#12360;&#12400;&#12289;&#26032;&#12375;&#12356;<tt class="literal">Child</tt>&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">Parent p = (Parent) session.load(Parent.class, pid);
Child c = new Child();
c.setParent(p);
p.getChildren().add(c);
session.save(c);
session.flush();</pre><p>
            &#12381;&#12375;&#12390;&#20170;&#12289;&#12383;&#12387;&#12383;&#19968;&#12388;&#12398;SQL <tt class="literal">INSERT</tt>&#12384;&#12369;&#12364;&#30330;&#34892;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#65281;
        </p><p>
            &#21427;&#12375;&#12367;&#12377;&#12427;&#12395;&#12399;&#12289;<tt class="literal">Parent</tt>&#12398;<tt class="literal">addChild()</tt>&#12513;&#12477;&#12483;&#12489;&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">public void addChild(Child c) {
    c.setParent(this);
    children.add(c);
}</pre><p>
            <tt class="literal">Child</tt>&#12434;&#36861;&#21152;&#12377;&#12427;&#12467;&#12540;&#12489;&#12399;&#12371;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">Parent p = (Parent) session.load(Parent.class, pid);
Child c = new Child();
p.addChild(c);
session.save(c);
session.flush();</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="example-parentchild-cascades"></a>16.3. &#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12398;&#12459;&#12473;&#12465;&#12540;&#12489;</h2></div></div><div></div></div><p>
             &#26126;&#31034;&#30340;&#12395;<tt class="literal">save()</tt>&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#12398;&#12399;&#12414;&#12384;&#29033;&#12431;&#12375;&#12356;&#12418;&#12398;&#12391;&#12377;&#12290;&#12371;&#12428;&#12434;&#12459;&#12473;&#12465;&#12540;&#12489;&#12434;&#20351;&#12387;&#12390;&#23550;&#20966;&#12375;&#12414;&#12377;&#12290;
         </p><pre class="programlisting">&lt;set name="children" inverse="true" cascade="all"&gt;
    &lt;key column="parent_id"/&gt;
    &lt;one-to-many class="Child"/&gt;
&lt;/set&gt;</pre><p>
             &#12371;&#12428;&#12399;&#19978;&#12398;&#12467;&#12540;&#12489;&#12434;&#12371;&#12398;&#12424;&#12358;&#12395;&#21336;&#32020;&#21270;&#12375;&#12414;&#12377;
         </p><pre class="programlisting">Parent p = (Parent) session.load(Parent.class, pid);
Child c = new Child();
p.addChild(c);
session.flush();</pre><p>
             &#21516;&#27096;&#12395;<tt class="literal">Parent</tt>&#12434;&#12475;&#12540;&#12502;&#12414;&#12383;&#12399;&#21066;&#38500;&#12377;&#12427;&#12392;&#12365;&#12395;&#12289;&#23376;&#12434;&#19968;&#12388;&#19968;&#12388;&#21462;&#12426;&#20986;&#12375;&#12390;&#25201;&#12358;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#20197;&#19979;&#12398;&#12467;&#12540;&#12489;&#12399;<tt class="literal">p</tt>&#12434;&#21066;&#38500;&#12375;&#12289;&#12381;&#12375;&#12390;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#12381;&#12398;&#23376;&#12434;&#12377;&#12409;&#12390;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;
         </p><pre class="programlisting">Parent p = (Parent) session.load(Parent.class, pid);
session.delete(p);
session.flush();</pre><p>
             &#12375;&#12363;&#12375;&#12289;&#27425;&#12398;&#12467;&#12540;&#12489;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;<tt class="literal">c</tt>&#12434;&#21066;&#38500;&#12375;&#12414;&#12379;&#12435;&#12290;<tt class="literal">p</tt>&#12408;&#12398;&#12522;&#12531;&#12463;&#12434;&#21066;&#38500;&#12377;&#12427;&#65288;&#12381;&#12375;&#12390;&#12371;&#12398;&#12465;&#12540;&#12473;&#12391;&#12399;<tt class="literal">NOT NULL</tt>&#21046;&#32004;&#36949;&#21453;&#12434;&#24341;&#12365;&#36215;&#12371;&#12377;&#65289;&#12384;&#12369;&#12391;&#12377;&#12290;
         </p><pre class="programlisting">Parent p = (Parent) session.load(Parent.class, pid);
Child c = (Child) p.getChildren().iterator().next();
p.getChildren().remove(c);
c.setParent(null);
session.flush();</pre><p>
              &#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#26126;&#31034;&#30340;&#12395;&#23376;&#12434;delete()&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
             <tt class="literal">delete()</tt> the <tt class="literal">Child</tt>.
         </p><pre class="programlisting">Parent p = (Parent) session.load(Parent.class, pid);
Child c = (Child) p.getChildren().iterator().next();
p.getChildren().remove(c);
session.delete(c);
session.flush();</pre><p>
             &#12373;&#12354;&#31169;&#12383;&#12385;&#12398;&#12465;&#12540;&#12473;&#12391;&#12399;&#23455;&#38555;&#12395;<tt class="literal">Child</tt>&#12364;&#35242;&#12394;&#12375;&#12391;&#12399;&#23384;&#22312;&#12391;&#12365;&#12394;&#12356;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;&#12381;&#12398;&#12383;&#12417;&#12289;&#12418;&#12375;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;<tt class="literal">Child</tt>&#12434;&#21462;&#12426;&#38500;&#12369;&#12400;&#12289;&#26412;&#24403;&#12395;&#21066;&#38500;&#12375;&#12383;&#12356;&#12418;&#12398;&#12364;&#21462;&#12426;&#38500;&#12363;&#12428;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12383;&#12417;&#12395;<tt class="literal">cascade="all-delete-orphan"</tt>&#12434;&#20351;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
         </p><pre class="programlisting">&lt;set name="children" inverse="true" cascade="all-delete-orphan"&gt;
    &lt;key column="parent_id"/&gt;
    &lt;one-to-many class="Child"/&gt;
&lt;/set&gt;</pre><p>
             &#27880;&#24847;&#65306;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;<tt class="literal">inverse="true"</tt>&#12392;&#25351;&#23450;&#12375;&#12390;&#12418;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032;&#12398;&#32368;&#12426;&#36820;&#12375;&#12395;&#12424;&#12387;&#12390;&#12459;&#12473;&#12465;&#12540;&#12489;&#12364;&#20381;&#28982;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;&#12381;&#12428;&#12422;&#12360;&#12418;&#12375;&#12459;&#12473;&#12465;&#12540;&#12489;&#12391;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12475;&#12540;&#12502;&#12289;&#21066;&#38500;&#12289;&#26356;&#26032;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12394;&#12425;&#12289;&#12381;&#12428;&#12434;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#36861;&#21152;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#21336;&#12395;<tt class="literal">setParent()</tt>&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#12384;&#12369;&#12391;&#12399;&#19981;&#21313;&#20998;&#12391;&#12377;&#12290;
         </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="example-parentchild-update"></a>16.4. &#12459;&#12473;&#12465;&#12540;&#12489;<tt class="literal">update()</tt>&#12398;&#20351;&#29992;</h2></div></div><div></div></div><p>
             <tt class="literal">Parent</tt>&#12364;&#12354;&#12427;<tt class="literal">Session</tt>&#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12289;UI&#12398;&#12450;&#12463;&#12471;&#12519;&#12531;&#12391;&#22793;&#26356;&#12364;&#21152;&#12360;&#12425;&#12428;&#12289;&#12371;&#12398;&#22793;&#26356;&#12434;&#26032;&#12375;&#12356;Session&#12395;&#12362;&#12356;&#12390;&#27704;&#32154;&#21270;(<tt class="literal">update()</tt>&#12434;&#12467;&#12540;&#12523;&#12375;&#12390;)&#12375;&#12383;&#12356;&#12392;&#12375;&#12414;&#12377;&#12290;<tt class="literal">Parent</tt>&#12364;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#25345;&#12385;&#12289;&#12459;&#12473;&#12465;&#12540;&#12489;&#26356;&#26032;&#12364;&#26377;&#21177;&#12395;&#12394;&#12387;&#12390;&#12356;&#12427;&#12383;&#12417;&#12289;
Hibernate&#12399;&#12393;&#12398;&#23376;&#12364;&#26032;&#12375;&#12367;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12383;&#12363;&#12289;&#12393;&#12428;&#12364;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#34892;&#12392;&#12375;&#12390;&#34920;&#29694;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;
&#30693;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290; <tt class="literal">Parent</tt>&#12392;<tt class="literal">Child</tt>&#12398;&#20001;&#26041;&#12364;<tt class="literal">java.lang.Long</tt>&#22411;&#12398;&#65288;&#20154;&#24037;&#30340;&#65289;&#35672;&#21029;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25345;&#12388;&#12392;&#20206;&#23450;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;Hibernate&#12399;&#12393;&#12398;&#23376;&#12364;&#26032;&#12375;&#12356;&#12398;&#12363;&#12434;&#27770;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#35672;&#21029;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12434;&#20351;&#12356;&#12414;&#12377;(version&#12420;timestamp&#12503;&#12525;&#12497;&#12486;&#12451;&#12418;&#20351;&#12360;&#12414;&#12377;&#12290;<a href="manipulatingdata.html#manipulatingdata-updating-detached" title="9.4.2. &#38306;&#36899;&#20184;&#12369;&#12434;&#12420;&#12417;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#26356;&#26032;">&#38917;9.4.2. &#12300;&#38306;&#36899;&#20184;&#12369;&#12434;&#12420;&#12417;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#26356;&#26032;&#12301;</a>&#21442;&#29031;)&#12290;
         </p><p>
             <tt class="literal">unsaved-value</tt>&#23646;&#24615;&#12399;&#26032;&#12375;&#12367;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#35672;&#21029;&#23376;&#12398;&#20516;&#12434;&#29305;&#23450;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;<tt class="literal">unsaved-value</tt> &#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#12399;null&#12391;&#12289;&#12371;&#12428;&#12399; <tt class="literal">Long</tt>&#35672;&#21029;&#23376;&#22411;&#12395;&#12392;&#12387;&#12390;&#21313;&#20998;&#12391;&#12377;&#12290;&#12418;&#12375;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#35672;&#21029;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#12358;&#12394;&#12425;&#12400;&#12289;<tt class="literal">Child</tt>&#12510;&#12483;&#12500;&#12531;&#12464;&#12395;&#20197;&#19979;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#65306;
         </p><pre class="programlisting">&lt;id name="id" type="long" unsaved-value="0"&gt;</pre><p>
             (version&#12392;timestamp&#12503;&#12525;&#12497;&#12486;&#12451;&#65381;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;<tt class="literal">unsaved-value</tt>&#23646;&#24615;&#12418;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;)
         </p><p>
             &#20197;&#19979;&#12398;&#12467;&#12540;&#12489;&#12399;<tt class="literal">parent</tt>&#12392;<tt class="literal">child</tt>&#12434;&#26356;&#26032;&#12375;&#12289;<tt class="literal">newChild</tt>.&#12434;&#25407;&#20837;&#12375;&#12414;&#12377;&#12290;
         </p><pre class="programlisting">//parent&#12392;child&#12399;&#20001;&#26041;&#12392;&#12418;&#21069;&#12398;Session&#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;n
parent.addChild(child);
Child newChild = new Child();
parent.addChild(newChild);
session.update(parent);
session.flush();</pre><p>
             &#12371;&#12428;&#12425;&#12399;&#29983;&#25104;&#12373;&#12428;&#12383;&#35672;&#21029;&#23376;&#12398;&#22580;&#21512;&#12395;&#12399;&#38750;&#24120;&#12395;&#33391;&#12356;&#12398;&#12391;&#12377;&#12364;&#12289;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#35672;&#21029;&#23376;&#12392;&#35079;&#21512;&#35672;&#21029;&#23376;&#12398;&#22580;&#21512;&#12399;&#12393;&#12358;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;&#12371;&#12428;&#12399;<tt class="literal">unsaved-value</tt>&#12364;&#12289;&#65288;&#12518;&#12540;&#12470;&#12395;&#12424;&#12426;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#35672;&#21029;&#23376;&#12434;&#25345;&#12388;&#65289;&#26032;&#12375;&#12367;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#21069;&#12398;Session&#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21306;&#21029;&#12391;&#12365;&#12394;&#12356;&#12383;&#12417;&#12424;&#12426;&#38627;&#12375;&#12356;&#12391;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#22810;&#20998;Hibernate&#12395;&#12498;&#12531;&#12488;&#12434;&#19982;&#12360;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12381;&#12428;&#12425;&#12399;
         </p><div class="itemizedlist"><ul type="disc"><li><p>
                 <tt class="literal">&lt;version&gt;</tt>&#12395;&#12362;&#12356;&#12390;<tt class="literal">unsaved-value="null"</tt>&#12414;&#12383;&#12399;<tt class="literal">unsaved-value="negative"</tt>&#12289;&#12414;&#12383;&#12399;&#12463;&#12521;&#12473;&#12395;&#23550;&#12375;&#12390;<tt class="literal">&lt;timestamp&gt;</tt>&#12503;&#12525;&#12497;&#12486;&#12451;&#65381;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;
             </p></li><li><p>
                 <tt class="literal">unsaved-value="none"</tt>&#12434;&#35373;&#23450;&#12375;&#12289;<tt class="literal">update(parent)</tt>&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#21069;&#12395;&#26032;&#12375;&#12367;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12383;&#23376;&#12434;&#26126;&#31034;&#30340;&#12395;<tt class="literal">save()</tt>&#12375;&#12414;&#12377;&#12290;
             </p></li><li><p>
                 <tt class="literal">unsaved-value="any"</tt>&#12434;&#35373;&#23450;&#12375;&#12289;<tt class="literal">update(parent)</tt>&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#21069;&#12395;&#20197;&#21069;&#12398;&#27704;&#32154;&#12398;&#23376;&#12434;&#26126;&#31034;&#30340;&#12395;<tt class="literal">update()</tt>&#12375;&#12414;&#12377;&#12290;
             </p></li></ul></div><p>
             <tt class="literal">none</tt>&#12399;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#35672;&#21029;&#23376;&#12392;&#35079;&#21512;&#35672;&#21029;&#23376;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;<tt class="literal">unsaved-value</tt>&#12391;&#12377;&#12290;
         </p><p>
             &#19968;&#12388;&#12398;&#26356;&#12394;&#12427;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;<tt class="literal">isUnsaved()</tt>&#12392;&#12356;&#12358;&#21517;&#21069;&#12398;&#26032;&#12375;&#12356;<tt class="literal">Interceptor</tt>&#12513;&#12477;&#12483;&#12489;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#26032;&#12375;&#12367;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21306;&#21029;&#12377;&#12427;&#12383;&#12417;&#12398;&#29420;&#33258;&#12398;&#25126;&#30053;&#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23455;&#35013;&#12373;&#12379;&#12427;&#12371;&#12392;&#12434;&#21487;&#33021;&#12395;&#12375;&#12414;&#12377;&#12290;&#20363;&#12360;&#12400;&#12289;&#27704;&#32154;&#12463;&#12521;&#12473;&#12395;&#23550;&#12375;&#12390;&#22522;&#26412;&#12463;&#12521;&#12473;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
         </p><pre class="programlisting">public class Persistent {
    private boolean _saved = false;
    public void onSave() {
        _saved=true;
    }
    public void onLoad() {
        _saved=true;
    }
    ......
    public boolean isSaved() {
        return _saved;
    }
}</pre><p>
             (<tt class="literal">saved</tt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#27704;&#32154;&#30340;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;)&#12381;&#12428;&#12391;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;<tt class="literal">onLoad()</tt>
             &#12392; <tt class="literal">onSave()</tt>&#12392;&#19968;&#32210;&#12395;<tt class="literal">isUnsaved()</tt>&#12434;&#23455;&#35013;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
         </p><pre class="programlisting">public Boolean isUnsaved(Object entity) {
    if (entity instanceof Persistent) {
        return new Boolean( !( (Persistent) entity ).isSaved() );
    }
    else {
        return null;
    }
}

public boolean onLoad(Object entity, 
    Serializable id,
    Object[] state,
    String[] propertyNames,
    Type[] types) {

    if (entity instanceof Persistent) ( (Persistent) entity ).onLoad();
    return false;
}

public boolean onSave(Object entity,
    Serializable id,
    Object[] state,
    String[] propertyNames,
    Type[] types) {
        
    if (entity instanceof Persistent) ( (Persistent) entity ).onSave();
    return false;
}</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="example-parentchild-conclusion"></a>16.5. &#32080;&#35542;</h2></div></div><div></div></div><p>
             &#12371;&#12371;&#12391;&#12399;&#12363;&#12394;&#12426;&#12398;&#37327;&#12434;&#35201;&#32004;&#12375;&#12383;&#12398;&#12391;&#12289;&#26368;&#21021;&#12398;&#38915;&#12399;&#28151;&#20081;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#24605;&#12431;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12375;&#12363;&#12375;&#23455;&#38555;&#12399;&#12289;&#12377;&#12409;&#12390;&#38750;&#24120;&#12395;&#33391;&#12367;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;&#12411;&#12392;&#12435;&#12393;&#12398;Hibernate&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#22810;&#12367;&#12398;&#23616;&#38754;&#12391;&#12391;&#35242;&#23376;&#12497;&#12479;&#12540;&#12531;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
         </p><p>
             &#26368;&#21021;&#12398;&#27573;&#33853;&#12391;&#20195;&#12431;&#12426;&#12398;&#26041;&#27861;&#12395;&#12388;&#12356;&#35302;&#12428;&#12414;&#12375;&#12383;&#12290;&#12381;&#12428;&#12425;&#12399;<tt class="literal">&lt;composite-element&gt;</tt>&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#22580;&#21512;&#12399;
&#23384;&#22312;&#12379;&#12378;&#12289;&#12381;&#12428;&#12399;&#30906;&#12363;&#12395;&#35242;&#23376;&#38306;&#20418;&#12398;&#24847;&#21619;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;&#19981;&#24184;&#12395;&#12418;&#35079;&#21512;&#35201;&#32032;&#12463;&#12521;&#12473;&#12395;&#12399;&#20108;&#12388;&#12398;&#22823;&#12365;&#12394;&#21046;&#38480;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#65306;&#19968;&#12388;&#12399;&#35079;&#21512;&#35201;&#32032;&#12364;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#25345;&#12388;&#12371;&#12392;&#12364;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12290;&#12418;&#12358;&#19968;&#12388;&#12399;&#20182;&#12398;&#12518;&#12491;&#12540;&#12463;&#12394;&#35242;&#12391;&#12399;&#12394;&#12356;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#23376;&#12392;&#12394;&#12427;&#12409;&#12365;&#12391;&#12399;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;(&#12375;&#12363;&#12375;&#12289;&#12381;&#12428;&#12425;&#12399;<tt class="literal">&lt;idbag&gt;</tt>&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#20351;&#12387;&#12390;&#12289;&#20195;&#29702;&#12398;&#20027;&#12461;&#12540;&#12434;<span class="emphasis"><em>&#25345;&#12390;&#12414;&#12377;</em></span>&#12290;)
         </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="toolsetguide.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="example-weblog.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;15&#31456; &#12484;&#12540;&#12523;&#12475;&#12483;&#12488;&#65381;&#12460;&#12452;&#12489;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;17&#31456; &#20363;: Weblog&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;</td></tr></table></div></body></html>