<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;9&#31456; &#27704;&#32154;&#12487;&#12540;&#12479;&#12398;&#25805;&#20316;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="inheritance.html" title="&#31532;8&#31456; &#32153;&#25215;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;"><link rel="next" href="transactions.html" title="&#31532;10&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#21516;&#26178;&#20006;&#34892;&#24615;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;9&#31456; &#27704;&#32154;&#12487;&#12540;&#12479;&#12398;&#25805;&#20316;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="inheritance.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="transactions.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="manipulatingdata"></a>&#31532;9&#31456; &#27704;&#32154;&#12487;&#12540;&#12479;&#12398;&#25805;&#20316;</h2></div></div><div></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-creating"></a>9.1. &#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20316;&#25104;</h2></div></div><div></div></div><p>
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65288;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12539;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#65289;&#12399;&#29305;&#23450;&#12398; <tt class="literal">Session</tt> &#12395;&#23550;&#12375;&#12390; 
            <span class="emphasis"><em>&#19968;&#26178;&#30340;</em></span> &#12414;&#12383;&#12399; <span class="emphasis"><em>&#27704;&#32154;&#30340;</em></span> &#12391;&#12377;&#12290;
            &#26032;&#12375;&#12367;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#24403;&#28982;&#19968;&#26178;&#30340;&#12391;&#12377;&#12290;
            Session&#12399;&#19968;&#26178;&#30340;&#12394;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12475;&#12540;&#12502;&#12377;&#12427;&#12469;&#12540;&#12499;&#12473;&#65288;&#12388;&#12414;&#12426;&#27704;&#32154;&#21270;&#65289;&#12434;&#34892;&#12356;&#12414;&#12377;&#65306;
        </p><pre class="programlisting">DomesticCat fritz = new DomesticCat();
fritz.setColor(Color.GINGER);
fritz.setSex('M');
fritz.setName("Fritz");
Long generatedId = (Long) sess.save(fritz);</pre><pre class="programlisting">DomesticCat pk = new DomesticCat();
pk.setColor(Color.TABBY);
pk.setSex('F');
pk.setName("PK");
pk.setKittens( new HashSet() );
pk.addKitten(fritz);
sess.save( pk, new Long(1234) );</pre><p>
            &#24341;&#25968;&#12364;1&#20491;&#12398; <tt class="literal">save()</tt> &#12399;&#12289;<tt class="literal">fritz</tt> &#12395;&#12518;&#12491;&#12540;&#12463;&#12394;&#35672;&#21029;&#23376;&#12434;&#29983;&#25104;&#12375;&#12289;&#20195;&#20837;&#12375;&#12414;&#12377;&#12290;
            &#24341;&#25968;&#12364;2&#20491;&#12398;&#26041;&#12399;&#12289;&#19982;&#12360;&#12425;&#12428;&#12383;&#35672;&#21029;&#23376;&#12434;&#20351;&#12356; <tt class="literal">pk</tt> &#12434;&#27704;&#32154;&#21270;&#12375;&#12424;&#12358;&#12392;&#12375;&#12414;&#12377;&#12290;
            &#12499;&#12472;&#12493;&#12473;&#19978;&#12398;&#24847;&#21619;&#12434;&#25345;&#12388;&#20027;&#12461;&#12540;&#12434;&#20316;&#25104;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12360;&#12390;&#12375;&#12414;&#12358;&#12398;&#12391;&#12289;
            &#19968;&#33324;&#12395;&#24341;&#25968;&#12364;2&#20491;&#12398;&#26041;&#12399;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12379;&#12435;&#12290;
            &#12375;&#12363;&#12375;BMP&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12539;&#12499;&#12540;&#12531;&#12398;&#27704;&#32154;&#21270;&#12395;Hibernate&#12434;&#20351;&#12358;&#12424;&#12358;&#12394;&#29305;&#27530;&#12394;&#29366;&#27841;&#12394;&#12425;&#12289;&#24341;&#25968;&#12364;2&#20491;&#12398;&#26041;&#12399;&#26377;&#29992;&#12391;&#12377;&#12290;
        </p><p>
            &#22806;&#37096;&#12461;&#12540;&#12398;&#12459;&#12521;&#12512;&#12395;&#23550;&#12375;&#12390; <tt class="literal">NOT NULL</tt> &#21046;&#32004;&#12364;&#12394;&#12369;&#12428;&#12400;&#12289;
            &#22909;&#12365;&#12394;&#38918;&#24207;&#12391;&#38306;&#36899;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#27704;&#32154;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290;
            &#22806;&#37096;&#12461;&#12540;&#21046;&#32004;&#12395;&#36949;&#21453;&#12377;&#12427;&#12522;&#12473;&#12463;&#12399;&#20840;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
            &#12375;&#12363;&#12375;&#12289;&#38291;&#36949;&#12387;&#12383;&#38918;&#24207;&#12391;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; <tt class="literal">save()</tt> &#12375;&#12390;&#12375;&#12414;&#12358;&#12392;&#12289;
            <tt class="literal">NOT NULL</tt> &#21046;&#32004;&#12395;&#36949;&#21453;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-loading"></a>9.2. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12489;</h2></div></div><div></div></div><p>
            &#12418;&#12375;&#35672;&#21029;&#23376;&#12364;&#12431;&#12363;&#12387;&#12390;&#12356;&#12428;&#12400;&#12289;<tt class="literal">Session</tt> &#12398; <tt class="literal">load()</tt> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12356;&#12289;
            &#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#24489;&#20803;&#12391;&#12365;&#12414;&#12377;&#12290;
            1&#30058;&#30446;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12463;&#12521;&#12473;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#24341;&#25968;&#12395;&#21462;&#12426;&#12289;
            &#26032;&#12375;&#12367;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12375;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#29366;&#24907;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
            &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#24341;&#25968;&#12395;&#21462;&#12427;&#12418;&#12358;1&#12388;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12399;&#12289;
            Hibernate&#12434;BMP&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12539;&#12499;&#12540;&#12531;&#12392;&#19968;&#32210;&#12395;&#20351;&#12358;&#30446;&#30340;&#12398;&#12383;&#12417;&#12394;&#12425;&#12289;&#29305;&#12395;&#26377;&#29992;&#12391;&#12377;&#12290;
            &#12414;&#12383;&#20182;&#12395;&#12418;&#20351;&#12356;&#12415;&#12385;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#65288;DIY&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12539;&#12503;&#12540;&#12523;&#12394;&#12393;&#65289;
        </p><pre class="programlisting">Cat fritz = (Cat) sess.load(Cat.class, generatedId);</pre><pre class="programlisting">// &#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#22411;&#12398;&#35672;&#21029;&#23376;&#12399;&#12521;&#12483;&#12503;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;
long pkId = 1234;
DomesticCat pk = (DomesticCat) sess.load( Cat.class, new Long(pkId) );</pre><pre class="programlisting">Cat cat = new DomesticCat();
// pk&#12398;&#29366;&#24907;&#12434;cat&#12395;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;
sess.load( cat, new Long(pkId) );
Set kittens = cat.getKittens();</pre><p>
            &#35442;&#24403;&#12377;&#12427;&#34892;&#12364;&#23384;&#22312;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;<tt class="literal">load()</tt> &#12399;&#24489;&#24112;&#19981;&#21487;&#33021;&#12394;&#20363;&#22806;&#12434;&#12473;&#12525;&#12540;&#12377;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            &#12463;&#12521;&#12473;&#12364;&#12503;&#12525;&#12461;&#12471;&#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;<tt class="literal">load()</tt> &#12399;&#21021;&#26399;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12461;&#12471;&#12434;&#36820;&#12375;&#12289;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12477;&#12483;&#12489;&#12434;&#36215;&#21205;&#12377;&#12427;&#12414;&#12391;&#12399;&#12289;&#23455;&#38555;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#21839;&#12356;&#21512;&#12431;&#12379;&#12414;&#12379;&#12435;&#12290;
            &#23455;&#38555;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#12525;&#12540;&#12489;&#12379;&#12378;&#12395;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12408;&#12398;&#38306;&#36899;&#12434;&#20316;&#25104;&#12375;&#12383;&#12369;&#12428;&#12400;&#12289;&#12371;&#12398;&#25391;&#12427;&#33310;&#12356;&#12399;&#12392;&#12390;&#12418;&#24441;&#12395;&#31435;&#12385;&#12414;&#12377;&#12290;
        </p><p>
            &#35442;&#24403;&#12377;&#12427;&#34892;&#12364;&#23384;&#22312;&#12377;&#12427;&#12371;&#12392;&#12364;&#30906;&#23455;&#12391;&#12394;&#12369;&#12428;&#12400;&#12289;<tt class="literal">get()</tt> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290;
            &#12371;&#12428;&#12399;&#12377;&#12368;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#21839;&#12356;&#21512;&#12431;&#12379;&#12289;&#35442;&#24403;&#12377;&#12427;&#34892;&#12364;&#23384;&#22312;&#12375;&#12394;&#12369;&#12428;&#12400;null&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">Cat cat = (Cat) sess.get(Cat.class, id);
if (cat==null) {
    cat = new Cat();
    sess.save(cat, id);
}
return cat;</pre><p>
            SQL&#12398; <tt class="literal">SELECT ... FOR UPDATE</tt> &#12434;&#20351;&#12356;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
            Hibernate&#12398; <tt class="literal">LockMode</tt> &#12395;&#12388;&#12356;&#12390;&#12398;&#35696;&#35542;&#12399;&#12289;&#27425;&#31680;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><pre class="programlisting">Cat cat = (Cat) sess.get(Cat.class, id, LockMode.UPGRADE);</pre><p>
            <tt class="literal">FOR UPDATE</tt> &#12391;&#12399;&#12289;&#38306;&#36899;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12420;&#21547;&#12435;&#12391;&#12356;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;
            &#36984;&#25246; <span class="emphasis"><em>&#12373;&#12428;&#12394;&#12356;</em></span> &#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><p>
            <tt class="literal">refresh()</tt> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12358;&#12392;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12420;&#12377;&#12409;&#12390;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#12356;&#12388;&#12391;&#12418;&#12522;&#12525;&#12540;&#12489;&#12391;&#12365;&#12414;&#12377;&#12290;
            &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12488;&#12522;&#12460;&#12434;&#20351;&#12387;&#12390;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12356;&#12367;&#12388;&#12363;&#12364;&#21021;&#26399;&#21270;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12289;&#12371;&#12428;&#12399;&#24441;&#12395;&#31435;&#12385;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">sess.save(cat);
sess.flush(); // SQL&#12398;INSERT&#12434;&#24375;&#21046;&#12375;&#12414;&#12377;
sess.refresh(cat); // &#29366;&#24907;&#12434;&#20877;&#12403;&#35501;&#12415;&#36796;&#12415;&#12414;&#12377;&#65288;&#12488;&#12522;&#12460;&#12398;&#23455;&#34892;&#24460;&#12395;&#65289;</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-querying"></a>9.3. &#12463;&#12456;&#12522;&#12398;&#23455;&#34892;</h2></div></div><div></div></div><p>
            &#25506;&#12377;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12364;&#12431;&#12363;&#12425;&#12394;&#12369;&#12428;&#12400;&#12289;
            <tt class="literal">Session</tt> &#12398; <tt class="literal">find()</tt> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            Hibernate&#12399;&#12471;&#12531;&#12503;&#12523;&#12363;&#12388;&#24375;&#21147;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12463;&#12456;&#12522;&#35328;&#35486;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">List cats = sess.find(
    "from Cat as cat where cat.birthdate = ?",
    date,
    Hibernate.DATE
);

List mates = sess.find(
    "select mate from Cat as cat join cat.mate as mate " +
    "where cat.name = ?",
    name,
    Hibernate.STRING
);

List cats = sess.find( "from Cat as cat where cat.mate.bithdate is null" );

List moreCats = sess.find(
    "from Cat as cat where " + 
    "cat.name = 'Fritz' or cat.id = ? or cat.id = ?",
    new Object[] { id1, id2 },
    new Type[] { Hibernate.LONG, Hibernate.LONG }
);

List mates = sess.find(
    "from Cat as cat where cat.mate = ?",
    izi,
    Hibernate.entity(Cat.class)
);

List problems = sess.find(
    "from GoldFish as fish " +
    "where fish.birthday &gt; fish.deceased or fish.birthday is null"
);</pre><p>
            <tt class="literal">find()</tt> &#12398;2&#30058;&#30446;&#12398;&#24341;&#25968;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12414;&#12383;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#37197;&#21015;&#12434;&#21463;&#12369;&#21462;&#12426;&#12414;&#12377;&#12290;
            3&#30058;&#30446;&#12398;&#24341;&#25968;&#12399;Hibernate&#22411;&#12414;&#12383;&#12399;Hibernate&#22411;&#12398;&#37197;&#21015;&#12434;&#21463;&#12369;&#21462;&#12426;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12425;&#12399;&#12289;&#19982;&#12360;&#12425;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; <tt class="literal">?</tt> &#12463;&#12456;&#12522;&#12539;&#12503;&#12524;&#12540;&#12473;&#12507;&#12523;&#12480;&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;
            &#65288;JDBC&#12398; <tt class="literal">PreparedStatement</tt> &#12398;IN&#12497;&#12521;&#12513;&#12540;&#12479;&#12408;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12414;&#12377;&#12290;&#65289;
            JDBC&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#12289;&#25991;&#23383;&#21015;&#25805;&#20316;&#12391;&#12399;&#12394;&#12367;&#12371;&#12398;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#27231;&#27083;&#12434;&#20351;&#12358;&#12409;&#12365;&#12391;&#12377;&#12290;
        </p><p>
            &#12411;&#12392;&#12435;&#12393;&#12398;&#32068;&#12415;&#36796;&#12415;&#22411;&#12408;&#12398;&#12450;&#12463;&#12475;&#12473;&#12434;&#25552;&#20379;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
            <tt class="literal">net.sf.hibernate.type.Type</tt> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12375;&#12390;&#12289;
            <tt class="literal">Hibernate</tt> &#12398;&#12463;&#12521;&#12473;&#12399;static&#12513;&#12477;&#12483;&#12489;&#12392;&#23450;&#25968;&#12434;&#12383;&#12367;&#12373;&#12435;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
        </p><p>
            &#12463;&#12456;&#12522;&#12364;&#38750;&#24120;&#12395;&#22810;&#12367;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#36820;&#12377;&#12395;&#12418;&#12363;&#12363;&#12431;&#12425;&#12378;&#12289;&#12381;&#12428;&#12425;&#12377;&#12409;&#12390;&#12434;&#20351;&#12358;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12394;&#12425;&#12400;&#12289;
            <tt class="literal">iterate()</tt> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12358;&#12392;&#33391;&#12356;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12364;&#24471;&#12425;&#12428;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12399; <tt class="literal">java.util.Iterator</tt> &#12434;&#36820;&#12375;&#12414;&#12377;&#12290;
            &#12452;&#12486;&#12524;&#12540;&#12479;&#12399;&#21021;&#26399;&#12398;SQL&#12463;&#12456;&#12522;&#12363;&#12425;&#36820;&#12373;&#12428;&#12427;&#35672;&#21029;&#23376;&#12434;&#20351;&#12356;&#12289;
            &#35201;&#27714;&#12395;&#24540;&#12376;&#12390;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#65288;&#20840;&#37096;&#12391;n+1&#12398;&#12475;&#12524;&#12463;&#12488;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#65289;
        </p><pre class="programlisting">// id&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;
Iterator iter = sess.iterate("from eg.Qux q order by q.likeliness"); 
while ( iter.hasNext() ) {
    Qux qux = (Qux) iter.next();  // &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;
    // &#12463;&#12456;&#12522;&#12391;&#12399;&#34920;&#29694;&#12391;&#12365;&#12394;&#12356;&#20309;&#12363;
    if ( qux.calculateComplicatedAlgorithm() ) {
        // &#29694;&#22312;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;
        iter.remove();
        // &#27531;&#12426;&#12434;&#23455;&#34892;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;
        break;
    }
}</pre><p>
            &#12354;&#12356;&#12395;&#12367; <tt class="literal">java.util.Iterator</tt> &#12399;&#20309;&#12418;&#20363;&#22806;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12394;&#12356;&#12398;&#12391;&#12289;
            &#30330;&#29983;&#12377;&#12427;SQL&#12420;Hibernate&#12398;&#20363;&#22806;&#12399; <tt class="literal">LazyInitializationException</tt> 
            &#65288; <tt class="literal">RuntimeException</tt> &#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#65289;&#12391;&#12521;&#12483;&#12503;&#12373;&#12428;&#12414;&#12377;&#12290;
        </p><p>
            &#22810;&#12367;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12377;&#12391;&#12395;Session&#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12390;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12390;&#12356;&#12427;&#12363;&#12289;
            &#12463;&#12456;&#12522;&#12398;&#12522;&#12470;&#12523;&#12488;&#12364;&#21516;&#12376;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20309;&#24230;&#12418;&#21547;&#12416;&#12394;&#12425;&#12289;
            <tt class="literal">iterate()</tt> &#12513;&#12477;&#12483;&#12489;&#12418;&#12424;&#12367;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;
            &#65288;&#12487;&#12540;&#12479;&#12364;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12383;&#12426;&#12452;&#12486;&#12524;&#12540;&#12488;&#12373;&#12428;&#12383;&#12426;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;
            &#12411;&#12392;&#12435;&#12393;&#12398;&#22580;&#21512; <tt class="literal">find()</tt> &#12398;&#26041;&#12364;&#12424;&#12426;&#39640;&#36895;&#12391;&#12377;&#12290;&#65289;
            &#20197;&#19979;&#12399; <tt class="literal">iterate()</tt> &#12434;&#20351;&#12387;&#12390;&#12467;&#12540;&#12523;&#12377;&#12409;&#12365;&#12463;&#12456;&#12522;&#12398;&#20363;&#12391;&#12377;&#65306;
        </p><pre class="programlisting">
Iterator iter = sess.iterate(
    "select customer, product " + 
    "from Customer customer, " +
    "Product product " +
    "join customer.purchases purchase " +
    "where product = purchase.product"
);</pre><p>
            <tt class="literal">find()</tt> &#12434;&#20351;&#12387;&#12390;&#19978;&#35352;&#12398;&#12463;&#12456;&#12522;&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#12392;&#12289;
            &#21516;&#12376;&#12487;&#12540;&#12479;&#12434;&#20309;&#24230;&#12418;&#21547;&#12416;&#38750;&#24120;&#12395;&#22823;&#12365;&#12394;JDBC <tt class="literal">ResultSet</tt> &#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;
        </p><p>
            Hibernate&#12463;&#12456;&#12522;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12479;&#12503;&#12523;&#12434;&#36820;&#12377;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
            &#12381;&#12398;&#22580;&#21512;&#12289;&#21508;&#12479;&#12503;&#12523;&#12399;&#37197;&#21015;&#12392;&#12375;&#12390;&#36820;&#12373;&#12428;&#12414;&#12377;&#65306;
        </p><pre class="programlisting">Iterator foosAndBars = sess.iterate(
    "select foo, bar from Foo foo, Bar bar " +
    "where bar.date = foo.date"
);
while ( foosAndBars.hasNext() ) {
    Object[] tuple = (Object[]) foosAndBars.next();
    Foo foo = tuple[0]; Bar bar = tuple[1];
    ....
}</pre><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-scalarqueries"></a>9.3.1. &#12473;&#12459;&#12521;&#12539;&#12463;&#12456;&#12522;</h3></div></div><div></div></div><p>
                <tt class="literal">select</tt> &#21477;&#12398;&#20013;&#12391;&#12289;&#12463;&#12521;&#12473;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12391;&#12365;&#12414;&#12377;&#12290;
                &#12373;&#12425;&#12395;SQL&#12398;&#38598;&#35336;&#38306;&#25968;&#12418;&#12467;&#12540;&#12523;&#12391;&#12365;&#12414;&#12377;&#12290;&#12503;&#12525;&#12497;&#12486;&#12451;&#12420;&#38598;&#35336;&#12399;&#12300;&#12473;&#12459;&#12521;&#12301;&#12391;&#12377;&#12290;
            </p><pre class="programlisting">Iterator results = sess.iterate(
        "select cat.color, min(cat.birthdate), count(cat) from Cat cat " +
        "group by cat.color"
);
while ( results.hasNext() ) {
    Object[] row = results.next();
    Color type = (Color) row[0];
    Date oldest = (Date) row[1];
    Integer count = (Integer) row[2];
    .....
}</pre><pre class="programlisting">Iterator iter = sess.iterate(
    "select cat.type, cat.birthdate, cat.name from DomesticCat cat"
);</pre><pre class="programlisting">List list = sess.find(
    "select cat, cat.mate.name from DomesticCat cat"
);</pre></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-queryinterface"></a>9.3.2. &#12463;&#12456;&#12522;&#12539;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;</h3></div></div><div></div></div><p>
                &#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12395;&#22659;&#30028;&#65288;&#24489;&#20803;&#12375;&#12383;&#12356;&#34892;&#12398;&#26368;&#22823;&#25968;&#12420;&#24489;&#20803;&#12375;&#12383;&#12356;&#26368;&#21021;&#12398;&#34892;&#65289;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12428;&#12400;&#12289;
                <tt class="literal">net.sf.hibernate.Query</tt> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21462;&#24471;&#12377;&#12409;&#12365;&#12391;&#12377;&#65306;
            </p><pre class="programlisting">Query q = sess.createQuery("from DomesticCat cat");
q.setFirstResult(20);
q.setMaxResults(10);
List cats = q.list();</pre><p>
                &#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#20013;&#12391;&#12289;&#21517;&#21069;&#20184;&#12365;&#12398;&#12463;&#12456;&#12522;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;
                &#65288;&#12510;&#12540;&#12463;&#12450;&#12483;&#12503;&#12392;&#12375;&#12390;&#32763;&#35379;&#12373;&#12428;&#12427;&#25991;&#23383;&#12434;&#21547;&#12435;&#12391;&#12356;&#12428;&#12400; 
                <tt class="literal">CDATA</tt> &#12475;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12358;&#12371;&#12392;&#12434;&#24536;&#12428;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#65289;&#12290;
            </p><pre class="programlisting">&lt;query name="eg.DomesticCat.by.name.and.minimum.weight"&gt;&lt;![CDATA[
    from eg.DomesticCat as cat
        where cat.name = ?
        and cat.weight &gt; ?
] ]&gt;&lt;/query&gt;</pre><pre class="programlisting">Query q = sess.getNamedQuery("eg.DomesticCat.by.name.and.minimum.weight");
q.setString(0, name);
q.setInt(1, minWeight);
List cats = q.list();</pre><p>
                &#12463;&#12456;&#12522;&#12539;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12391;&#12399;&#21517;&#21069;&#20184;&#12365;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12434;&#20351;&#12360;&#12414;&#12377;&#12290;
                &#21517;&#21069;&#20184;&#12365;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12392;&#12399;&#12289;&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#20013;&#12398; <tt class="literal">:name</tt> &#12398;&#24418;&#24335;&#12398;&#35672;&#21029;&#23376;&#12398;&#12371;&#12392;&#12434;&#35328;&#12356;&#12414;&#12377;&#12290;
                <tt class="literal">Query</tt> &#12395;&#12399;&#12289;&#21517;&#21069;&#20184;&#12365;&#12398;&#12497;&#12521;&#12513;&#12540;&#12479;&#12420;JDBC&#12473;&#12479;&#12452;&#12523;&#12398; <tt class="literal">?</tt> 
                &#12497;&#12521;&#12513;&#12540;&#12479;&#12395;&#12496;&#12452;&#12531;&#12489;&#12377;&#12427;&#12383;&#12417;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
                <span class="emphasis"><em>JDBC&#12392;&#12399;&#36949;&#12356;&#12289;Hibernate&#12398;&#25968;&#12497;&#12521;&#12513;&#12540;&#12479;&#12399;0&#12363;&#12425;&#22987;&#12414;&#12426;&#12414;&#12377;&#12290;</em></span>
                &#21517;&#21069;&#20184;&#12365;&#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#21033;&#28857;&#12399;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12418;&#12398;&#12391;&#12377;&#65306;
            </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                        &#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#20013;&#12395;&#29694;&#12428;&#12427;&#38918;&#24207;&#12395;&#24433;&#38911;&#12373;&#12428;&#12394;&#12356;&#12290;
                    </p></li><li><p>
                        &#21516;&#12376;&#12463;&#12456;&#12522;&#20013;&#12395;&#35079;&#25968;&#22238;&#29694;&#12428;&#12390;&#12418;&#12424;&#12356;&#12290;
                    </p></li><li><p>
                        &#21517;&#21069;&#12391;&#24847;&#21619;&#12434;&#34920;&#29694;&#12391;&#12365;&#12427;&#12290;
                    </p></li></ul></div><pre class="programlisting">// &#21517;&#21069;&#20184;&#12365;&#12497;&#12521;&#12513;&#12540;&#12479;&#65288;&#12362;&#12377;&#12377;&#12417;&#65289;
Query q = sess.createQuery("from DomesticCat cat where cat.name = :name");
q.setString("name", "Fritz");
Iterator cats = q.iterate();</pre><pre class="programlisting">// &#20301;&#32622;&#12496;&#12521;&#12513;&#12540;&#12479;
Query q = sess.createQuery("from DomesticCat cat where cat.name = ?");
q.setString(0, "Izi");
Iterator cats = q.iterate();</pre><pre class="programlisting">// &#21517;&#21069;&#20184;&#12365;&#12497;&#12521;&#12513;&#12540;&#12479;&#12398;&#12522;&#12473;&#12488;
List names = new ArrayList();
names.add("Izi");
names.add("Fritz");
Query q = sess.createQuery("from DomesticCat cat where cat.name in (:namesList)");
q.setParameterList("namesList", names);
List cats = q.list();</pre></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-scrolling"></a>9.3.3. &#12473;&#12463;&#12525;&#12540;&#12521;&#12502;&#12523;&#12539;&#12452;&#12486;&#12524;&#12540;&#12471;&#12519;&#12531;</h3></div></div><div></div></div><p>
                JDBC&#12489;&#12521;&#12452;&#12496;&#12364;&#12473;&#12463;&#12525;&#12540;&#12521;&#12502;&#12523; <tt class="literal">ResultSet</tt> &#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12428;&#12400;&#12289;
                <tt class="literal">Query</tt> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#20351;&#12387;&#12390; <tt class="literal">ScrollableResults</tt> &#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
                &#12371;&#12428;&#12434;&#20351;&#12358;&#12392;&#12289;&#12463;&#12456;&#12522;&#12398;&#12522;&#12470;&#12523;&#12488;&#12434;&#26580;&#36575;&#12395;&#12490;&#12499;&#12466;&#12540;&#12471;&#12519;&#12531;&#12391;&#12365;&#12414;&#12377;&#12290;
            </p><pre class="programlisting">Query q = sess.createQuery("select cat.name, cat from DomesticCat cat " +
                            "order by cat.name");
ScrollableResults cats = q.scroll();
if ( cats.first() ) {

    // cat&#12434;&#21517;&#21069;&#12398;&#12450;&#12523;&#12501;&#12449;&#12505;&#12483;&#12488;&#38918;&#12391;&#20006;&#12409;&#12383;&#12522;&#12473;&#12488;&#12398;&#12289;&#21508;&#12506;&#12540;&#12472;&#12398;&#26368;&#21021;&#12398;&#21517;&#21069;&#12434;&#35211;&#12388;&#12369;&#12414;&#12377;
    firstNamesOfPages = new ArrayList();
    do {
        String name = cats.getString(0);
        firstNamesOfPages.add(name);
    }
    while ( cats.scroll(PAGE_SIZE) );

    // cat&#12398;&#26368;&#21021;&#12398;&#12506;&#12540;&#12472;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;
    pageOfCats = new ArrayList();
    cats.beforeFirst();
    int i=0;
    while( ( PAGE_SIZE &gt; i++ ) &amp;&amp; cats.next() ) pageOfCats.add( cats.get(1) );

}</pre></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-filtering"></a>9.3.4. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12501;&#12451;&#12523;&#12479;&#12522;&#12531;&#12464;</h3></div></div><div></div></div><p>
                &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398; <span class="emphasis"><em>&#12501;&#12451;&#12523;&#12479;</em></span> &#12399;&#12289;
                &#27704;&#32154;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#37197;&#21015;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12463;&#12456;&#12522;&#12398;&#29305;&#21029;&#12394;&#12479;&#12452;&#12503;&#12391;&#12377;&#12290;
                &#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12363;&#12425;&#12289;&#29694;&#26178;&#28857;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#35201;&#32032;&#12434;&#24847;&#21619;&#12377;&#12427; <tt class="literal">this</tt>
            </p><pre class="programlisting">Collection blackKittens = session.filter(
    pk.getKittens(), "where this.color = ?", Color.BLACK, Hibernate.enum(Color.class)
);</pre><p>
                &#36820;&#12373;&#12428;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12399;bag&#12391;&#12377;&#12290;
            </p><p>
                &#12501;&#12451;&#12523;&#12479;&#12395;&#12399; <tt class="literal">from</tt> &#21477;&#12364;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#65288;&#12354;&#12387;&#12390;&#12418;&#12363;&#12414;&#12356;&#12414;&#12379;&#12435;&#65289;&#12290;
                &#12414;&#12383;&#12501;&#12451;&#12523;&#12479;&#12399;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#35201;&#32032;&#12381;&#12398;&#12418;&#12398;&#12434;&#36820;&#12379;&#12414;&#12377;&#12290;
            </p><pre class="programlisting">Collection blackKittenMates = session.filter(
    pk.getKittens(), "select this.mate where this.color = eg.Color.BLACK"
);</pre></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-criteria"></a>9.3.5. Criteria&#12463;&#12456;&#12522;</h3></div></div><div></div></div><p>
                HQL&#12399;&#26997;&#12417;&#12390;&#24375;&#21147;&#12391;&#12377;&#12364;&#12289;Java&#12467;&#12540;&#12489;&#12398;&#20013;&#12395;&#25991;&#23383;&#21015;&#12392;&#12375;&#12390;&#22475;&#12417;&#36796;&#12416;&#12398;&#12391;&#12399;&#12394;&#12367;&#12289;
                &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12398;API&#12434;&#20351;&#12387;&#12390;&#12289;&#21205;&#30340;&#12395;&#12463;&#12456;&#12522;&#12434;&#32068;&#12415;&#31435;&#12390;&#12427;&#26041;&#27861;&#12434;&#22909;&#12416;&#20154;&#12418;&#12356;&#12414;&#12377;&#12290;
                &#12381;&#12358;&#12356;&#12358;&#20154;&#12398;&#12383;&#12417;&#12395;&#12289;Hibernate&#12391;&#12399;&#30452;&#24863;&#30340;&#12394; <tt class="literal">Criteria</tt> &#12463;&#12456;&#12522;API&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
            </p><pre class="programlisting">Criteria crit = session.createCriteria(Cat.class);
crit.add( Expression.eq("color", eg.Color.BLACK) );
crit.setMaxResults(10);
List cats = crit.list();</pre><p>
                SQL&#12521;&#12452;&#12463;&#12394;&#27083;&#25991;&#12364;&#23244;&#12356;&#12394;&#12425;&#12289;&#22810;&#20998;&#12371;&#12428;&#12364;Hibernate&#12434;&#22987;&#12417;&#12427;&#26368;&#12418;&#31777;&#21336;&#12394;&#26041;&#27861;&#12391;&#12377;&#12290;
                &#12371;&#12398;API&#12399;HQL&#12424;&#12426;&#31777;&#21336;&#12395;&#25313;&#24373;&#12391;&#12365;&#12414;&#12377;&#12290;
                &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391; <tt class="literal">Criterion</tt> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#29420;&#33258;&#12398;&#23455;&#35013;&#12434;&#29992;&#24847;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-nativesql"></a>9.3.6. &#12493;&#12452;&#12486;&#12451;&#12502;SQL&#12398;&#12463;&#12456;&#12522;</h3></div></div><div></div></div><p>
                <tt class="literal">createSQLQuery()</tt> &#12434;&#20351;&#12356;&#12289;SQL&#12398;&#20013;&#12391;&#12463;&#12456;&#12522;&#12434;&#34920;&#29694;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
                &#12381;&#12398;&#22580;&#21512;&#12289;&#20013;&#25324;&#24359;&#12391;SQL&#12398;&#12456;&#12452;&#12522;&#12450;&#12473;&#12434;&#22258;&#12414;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
            </p><pre class="programlisting">List cats = session.createSQLQuery(
    "SELECT {cat.*} FROM CAT {cat} WHERE ROWNUM&lt;10",
    "cat",
    Cat.class
).list();</pre><pre class="programlisting">List cats = session.createSQLQuery(
    "SELECT {cat}.ID AS {cat.id}, {cat}.SEX AS {cat.sex}, " +
           "{cat}.MATE AS {cat.mate}, {cat}.SUBCLASS AS {cat.class}, ... " +
    "FROM CAT {cat} WHERE ROWNUM&lt;10",
    "cat",
    Cat.class
).list()</pre><p>
                Hibernate&#12463;&#12456;&#12522;&#12392;&#21516;&#12376;&#12424;&#12358;&#12395;&#12289;SQL&#12463;&#12456;&#12522;&#12391;&#12418;&#21517;&#21069;&#20184;&#12365;&#12497;&#12521;&#12513;&#12540;&#12479;&#12392;&#20301;&#32622;&#12497;&#12521;&#12513;&#12540;&#12479;&#12364;&#20351;&#12360;&#12414;&#12377;&#12290;
            </p></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-updating"></a>9.4. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#26356;&#26032;</h2></div></div><div></div></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-updating-insession"></a>9.4.1. &#21516;&#12376;Session&#12391;&#12398;&#26356;&#26032;</h3></div></div><div></div></div><p>
                <span class="emphasis"><em>&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12490;&#12523;&#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;</em></span>&#12288;
                &#65288; <tt class="literal">Session</tt> &#12391;&#12525;&#12540;&#12489;&#12289;&#12475;&#12540;&#12502;&#12289;&#20316;&#25104;&#12289;
                &#12463;&#12456;&#12522;&#23455;&#34892;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65289;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#25805;&#20316;&#12391;&#12365;&#12289;
                <tt class="literal">Session</tt> &#12364; <span class="emphasis"><em>&#12501;&#12521;&#12483;&#12471;&#12517;</em></span> &#12373;&#12428;&#12427;&#12392;&#12365;&#12395;
                &#27704;&#32154;&#29366;&#24907;&#12408;&#12398;&#22793;&#26356;&#12364;&#27704;&#32154;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;
               &#65288;&#12371;&#12398;&#31456;&#12398;&#32066;&#12431;&#12426;&#12395;&#35696;&#35542;&#12375;&#12414;&#12377;&#12290;&#65289;
                &#12381;&#12398;&#12383;&#12417;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12434;&#26356;&#26032;&#12377;&#12427;&#26368;&#12418;&#31777;&#21336;&#12394;&#26041;&#27861;&#12399;&#12289;
                <tt class="literal">Session</tt> &#12364;&#12458;&#12540;&#12503;&#12531;&#12375;&#12390;&#12356;&#12427;&#38291;&#12395; <tt class="literal">load()</tt> &#12375;&#12390;&#30452;&#25509;&#25805;&#20316;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#65306;
            </p><pre class="programlisting">DomesticCat cat = (DomesticCat) sess.load( Cat.class, new Long(69) );
cat.setName("PK");
sess.flush();  // cat&#12408;&#12398;&#22793;&#26356;&#12399;&#33258;&#21205;&#30340;&#12395;&#26908;&#30693;&#12373;&#12428;&#27704;&#32154;&#21270;&#12373;&#12428;&#12414;&#12377;</pre><p>
                &#21516;&#12376;Session&#12391;&#65288;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12383;&#12417;&#12398;&#65289;SQL <tt class="literal">SELECT</tt> &#12392;
                &#65288;&#26356;&#26032;&#12373;&#12428;&#12383;&#29366;&#24907;&#12434;&#27704;&#32154;&#21270;&#12377;&#12427;&#12383;&#12417;&#12398;&#65289;SQL <tt class="literal">UPDATE</tt> &#12398;&#20001;&#26041;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12383;&#12417;&#12289;
                &#12371;&#12398;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12539;&#12514;&#12487;&#12523;&#12399;&#12392;&#12365;&#12393;&#12365;&#38750;&#21177;&#29575;&#12391;&#12377;&#12290;
                &#12381;&#12398;&#12383;&#12417;&#12289;Hibernate&#12399;&#20195;&#12431;&#12426;&#12398;&#26041;&#27861;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-updating-detached"></a>9.4.2. &#38306;&#36899;&#20184;&#12369;&#12434;&#12420;&#12417;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#26356;&#26032;</h3></div></div><div></div></div><p>
                &#22810;&#12367;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;1&#12388;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#24489;&#20803;&#12375;&#12390;&#12289;
                &#25805;&#20316;&#12398;&#12383;&#12417;&#12395;UI&#23652;&#12408;&#36865;&#12387;&#12390;&#12289;&#26032;&#12375;&#12356;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#22793;&#26356;&#12434;&#12475;&#12540;&#12502;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                &#65288;&#21516;&#26178;&#20006;&#34892;&#24615;&#12398;&#39640;&#12356;&#29872;&#22659;&#12391;&#12371;&#12398;&#31278;&#12398;&#26041;&#27861;&#12434;&#20351;&#12358;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12289;
                &#26222;&#36890;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#20998;&#38626;&#12434;&#30906;&#23455;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#12539;&#12487;&#12540;&#12479;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;&#65289;
                &#12371;&#12398;&#26041;&#27861;&#12399;&#12289;&#21069;&#12398;&#31680;&#12391;&#36848;&#12409;&#12383;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12539;&#12514;&#12487;&#12523;&#12392;&#12399;&#12363;&#12394;&#12426;&#30064;&#12394;&#12387;&#12383;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12539;&#12514;&#12487;&#12523;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
                Hibernate&#12399; <tt class="literal">Session.update()</tt> &#12513;&#12477;&#12483;&#12489;&#12434;&#29992;&#24847;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
                &#12371;&#12398;&#12514;&#12487;&#12523;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            </p><pre class="programlisting">// &#26368;&#21021;&#12398;Session&#12391;
Cat cat = (Cat) firstSession.load(Cat.class, catId);
Cat potentialMate = new Cat();
firstSession.save(potentialMate);

// &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12424;&#12426;&#39640;&#12356;&#23652;&#12391;
cat.setMate(potentialMate);

// &#12381;&#12398;&#24460;&#12289;&#26032;&#12375;&#12356;Session&#12391;
secondSession.update(cat);  // cat&#12398;&#26356;&#26032;
secondSession.update(mate); // mate&#12398;&#26356;&#26032;</pre><p>
                &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#26356;&#26032;&#12434;&#34892;&#12362;&#12358;&#12392;&#12377;&#12427;&#12392;&#12365;&#12289;
                &#35672;&#21029;&#23376; <tt class="literal">catId</tt> &#12434;&#25345;&#12388; <tt class="literal">Cat</tt> &#12364; 
                <tt class="literal">secondSession</tt> &#12391;&#12377;&#12391;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12414;&#12377;&#12290;
            </p><p>
                &#19982;&#12360;&#12425;&#12428;&#12383;&#19968;&#26178;&#30340;&#12394;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12363;&#12425;&#21040;&#36948;&#21487;&#33021;&#12394;&#19968;&#26178;&#30340;&#12394;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12289;
                &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#20491;&#21029;&#12395; <tt class="literal">update()</tt> &#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
                &#12381;&#12375;&#12390;&#12381;&#12428;&#12399;&#29366;&#24907;&#12418;&#26356;&#26032;&#12375;&#12383;&#12356;&#12392;&#12365;&#12395; <span class="emphasis"><em>&#38480;&#12426;&#12414;&#12377;</em></span> &#12290;
                &#65288;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#38500;&#12367;&#12290;&#24460;&#12391;&#35696;&#35542;&#12375;&#12414;&#12377;&#12290;&#65289;
            </p><p>
                Hibernate&#12398;&#12518;&#12540;&#12470;&#12399;&#26032;&#12375;&#12356;&#35672;&#21029;&#23376;&#12434;&#29983;&#25104;&#12375;&#12390;&#19968;&#26178;&#30340;&#12394;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12475;&#12540;&#12502;&#12375;&#12383;&#12426;&#12289;
                &#29694;&#22312;&#12398;&#35672;&#21029;&#23376;&#12395;&#38306;&#36899;&#12377;&#12427;&#27704;&#32154;&#29366;&#24907;&#12434;&#26356;&#26032;&#12377;&#12427;&#27726;&#29992;&#30340;&#12394;&#12513;&#12477;&#12483;&#12489;&#12434;&#12522;&#12463;&#12456;&#12473;&#12488;&#12375;&#12390;&#12356;&#12414;&#12375;&#12383;&#12290;
                &#20170;&#12391;&#12399;&#12371;&#12398;&#27231;&#33021;&#12434;&#23455;&#35013;&#12377;&#12427; <tt class="literal">saveOrUpdate()</tt> &#12513;&#12477;&#12483;&#12489;&#12364;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
            </p><p>
                Hibernate&#12399;&#35672;&#21029;&#23376;&#65288;&#12414;&#12383;&#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#12363;&#12479;&#12452;&#12512;&#12473;&#12479;&#12531;&#12503;&#65289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#20516;&#12391;&#12289;
                &#12300;&#26032;&#12375;&#12356;&#12301;&#65288;&#12475;&#12540;&#12502;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#65289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12300;&#26082;&#23384;&#12398;&#12301;
                &#65288;&#20197;&#21069;&#12398;Session&#12391;&#12475;&#12540;&#12502;&#12414;&#12383;&#12399;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#65289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21306;&#21029;&#12375;&#12414;&#12377;&#12290;
                <tt class="literal">&lt;id&gt;</tt>&#65288;&#12414;&#12383;&#12399; <tt class="literal">&lt;version&gt;</tt>, 
                &#12414;&#12383;&#12399; <tt class="literal">&lt;timestamp&gt;</tt> &#65289;&#12398; <tt class="literal">unsaved-value</tt> &#23646;&#24615;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12289;
                &#12393;&#12398;&#20516;&#12364;&#12300;&#26032;&#12375;&#12356;&#12301;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#34920;&#12377;&#12363;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
            </p><pre class="programlisting">&lt;id name="id" type="long" column="uid" unsaved-value="null"&gt;
    &lt;generator class="hilo"/&gt;
&lt;/id&gt;</pre><p>
                <tt class="literal">unsaved-value</tt> &#12399;&#20197;&#19979;&#12398;&#20516;&#12434;&#21462;&#12426;&#12414;&#12377;&#65306;
            </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    <tt class="literal">any</tt> - &#24120;&#12395;&#12475;&#12540;&#12502;&#12377;&#12427;
                    </p></li><li><p>
                    <tt class="literal">none</tt> - &#24120;&#12395;&#26356;&#26032;&#12377;&#12427;
                    </p></li><li><p>
                    <tt class="literal">null</tt> - &#35672;&#21029;&#23376;&#12364;null&#12398;&#12392;&#12365;&#12395;&#12475;&#12540;&#12502;&#12377;&#12427;&#65288;&#12371;&#12428;&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12377;&#65289;
                    </p></li><li><p>
                    &#22949;&#24403;&#12394;&#35672;&#21029;&#23376;&#12398;&#20516; - &#35672;&#21029;&#23376;&#12364;null&#12363;&#20516;&#12364;&#19982;&#12360;&#12425;&#12428;&#12383;&#12392;&#12365;&#12395;&#12475;&#12540;&#12502;&#12377;&#12427;
                    </p></li><li><p>
                    <tt class="literal">undefined</tt> - <tt class="literal">version</tt> &#12420; 
                    <tt class="literal">timestamp</tt> &#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12289;&#12381;&#12398;&#12392;&#12365;&#35672;&#21029;&#23376;&#12364;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12427;
                    </p></li></ul></div><pre class="programlisting">// &#26368;&#21021;&#12398;Session&#12391;
Cat cat = (Cat) firstSession.load(Cat.class, catID);

// &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12424;&#12426;&#39640;&#12356;&#23652;&#12391;
Cat mate = new Cat();
cat.setMate(mate);

// &#12381;&#12398;&#24460;&#12289;&#26032;&#12375;&#12356;Session&#12391;
secondSession.saveOrUpdate(cat);   // &#26082;&#23384;&#12398;&#29366;&#24907;&#12434;&#26356;&#26032;&#12375;&#12414;&#12377;&#65288;cat&#12399;null&#12391;&#12394;&#12356;id&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#65289;
secondSession.saveOrUpdate(mate);  // &#26032;&#12375;&#12356;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12475;&#12540;&#12502;&#12375;&#12414;&#12377;&#65288;mate&#12399;null&#12398;id&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#65289;</pre><p>
                &#26032;&#12375;&#12356;&#12518;&#12540;&#12470;&#12395;&#12399;&#12289;<tt class="literal">saveOrUpdate()</tt> &#12398;&#20351;&#12356;&#12415;&#12385;&#12392;&#24847;&#21619;&#12364;
                &#28151;&#20081;&#12375;&#12390;&#12356;&#12427;&#12424;&#12358;&#12395;&#24605;&#12431;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
                &#12354;&#12427;Session&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20182;&#12398;&#26032;&#12375;&#12356;Session&#12391;&#20351;&#12362;&#12358;&#12392;&#12375;&#12394;&#12356;&#38480;&#12426;&#12399;&#12289;
                <tt class="literal">update()</tt> &#12420; <tt class="literal">saveOrUpdate()</tt> &#12434;&#20351;&#12358;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                &#12371;&#12428;&#12425;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#12393;&#12385;&#12425;&#12418;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20840;&#20307;&#12434;&#36890;&#12375;&#12390;&#20840;&#12367;&#20351;&#12431;&#12394;&#12356;&#12518;&#12540;&#12470;&#12418;&#12356;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
            </p><p>
                &#26222;&#36890; <tt class="literal">update()</tt> &#12420; <tt class="literal">saveOrUpdate()</tt> &#12399;&#12289;
                &#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12471;&#12490;&#12522;&#12458;&#12391;&#20351;&#12431;&#12428;&#12414;&#12377;&#65306;
            </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                        &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#26368;&#21021;&#12398;Session&#12391;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;
                    </p></li><li><p>
                        &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;UI&#23652;&#12408;&#28193;&#12373;&#12428;&#12427;
                    </p></li><li><p>
                        &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12356;&#12367;&#12388;&#12363;&#26356;&#26032;&#12364;&#34892;&#12431;&#12428;&#12427;
                    </p></li><li><p>
                        &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12499;&#12472;&#12493;&#12473;&#12539;&#12525;&#12472;&#12483;&#12463;&#23652;&#12395;&#36820;&#12373;&#12428;&#12427;
                    </p></li><li><p>
                        &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;2&#30058;&#30446;&#12398;Session&#12391; <tt class="literal">update()</tt> &#12434;&#12467;&#12540;&#12523;&#12375;&#12390;&#12289;
                        &#12371;&#12428;&#12425;&#12398;&#26356;&#26032;&#12434;&#27704;&#32154;&#21270;&#12377;&#12427;
                    </p></li></ul></div><p>
                <tt class="literal">saveOrUpdate()</tt> &#12399;&#20197;&#19979;&#12398;&#12371;&#12392;&#12434;&#34892;&#12356;&#12414;&#12377;&#65306;
            </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                        &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12371;&#12398;Session&#12391;&#12377;&#12391;&#12395;&#27704;&#32154;&#21270;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;&#20309;&#12418;&#12375;&#12394;&#12356;
                    </p></li><li><p>
                        &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12394;&#12369;&#12428;&#12400;&#12289;<tt class="literal">save()</tt> &#12377;&#12427;
                    </p></li><li><p>
                        &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12364; <tt class="literal">unsaved-value</tt> &#12391;&#25351;&#23450;&#12373;&#12428;&#12383;criteria&#12395;&#12510;&#12483;&#12481;&#12377;&#12428;&#12400;&#12289;
                        <tt class="literal">save()</tt> &#12377;&#12427;
                    </p></li><li><p>
                        &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12496;&#12540;&#12472;&#12519;&#12531;&#20184;&#12369;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12290;
                        &#65288; <tt class="literal">version</tt> &#12414;&#12383;&#12399; <tt class="literal">timestamp</tt> &#65289;&#12289;
                        &#12496;&#12540;&#12472;&#12519;&#12531;&#12364; <tt class="literal">unsaved-value="undefined"</tt> 
                        &#65288;&#12487;&#12501;&#12457;&#12523;&#12488;&#20516;&#65289;&#12391;&#12394;&#12356;&#38480;&#12426;&#12289;  &#12496;&#12540;&#12472;&#12519;&#12531;&#12364;&#35672;&#21029;&#23376;&#12398;&#12481;&#12455;&#12483;&#12463;&#12395;&#20778;&#20808;&#12377;&#12427;
                    </p></li><li><p>
                        &#12418;&#12375;Session&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#20182;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21516;&#12376;&#35672;&#21029;&#23376;&#12434;&#25345;&#12388;&#12394;&#12425;&#12289;&#20363;&#22806;&#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12427;
                    </p></li></ul></div><p>
                &#26368;&#24460;&#12398;&#12465;&#12540;&#12473;&#12399;&#12289; <tt class="literal">saveOrUpdateCopy(Object o)</tt> &#12434;&#20351;&#12358;&#12371;&#12392;&#12391;&#36991;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;
                &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#12289;&#19982;&#12360;&#12425;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12434;&#12289;&#21516;&#12376;&#35672;&#21029;&#23376;&#12434;&#25345;&#12388;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;
                &#29694;&#22312;&#12398;Session&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#23384;&#22312;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;
                &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12399;&#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#36820;&#12375;&#12414;&#12377;&#12290;
                &#19982;&#12360;&#12425;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12289;&#12475;&#12540;&#12502;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12363;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23384;&#22312;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;
                Hibernate&#12399;&#12381;&#12428;&#12434;&#12475;&#12540;&#12502;&#12375;&#12390;&#12289;&#26032;&#12375;&#12367;&#27704;&#32154;&#21270;&#12375;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12375;&#12390;&#36820;&#12375;&#12414;&#12377;&#12290;
                &#12381;&#12358;&#12391;&#12394;&#12369;&#12428;&#12400;&#12289;&#19982;&#12360;&#12425;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;Session&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12414;&#12379;&#12435;&#12290;
                &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20999;&#12426;&#38626;&#12375;&#12434;&#20351;&#12358;&#12411;&#12392;&#12435;&#12393;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;
                <tt class="literal">saveOrUpdate()</tt> &#12392; <tt class="literal">saveOrUpdateCopy()</tt> &#12398;&#20001;&#26041;&#12398;&#12513;&#12477;&#12483;&#12489;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
             </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-update-lock"></a>9.4.3. &#38306;&#36899;&#20184;&#12369;&#12434;&#12420;&#12417;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#20877;&#38306;&#36899;&#20184;&#12369;</h3></div></div><div></div></div><p>
                <tt class="literal">lock()</tt> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12360;&#12400;&#12289;
                &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#26032;&#12375;&#12356;Session&#12391;&#26356;&#26032;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12289;
                &#20877;&#12403;&#38306;&#36899;&#20184;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
            </p><pre class="programlisting">// &#21336;&#32020;&#12395;&#20877;&#25509;&#32154;&#12377;&#12427;&#65306;
sess.lock(fritz, LockMode.NONE);
// &#12496;&#12540;&#12472;&#12519;&#12531;&#12539;&#12481;&#12455;&#12483;&#12463;&#12434;&#34892;&#12356;&#12289;&#20877;&#25509;&#32154;&#12375;&#12414;&#12377;&#65306;
sess.lock(izi, LockMode.READ);
// SELECT ... FOR UPDATE&#12434;&#20351;&#12387;&#12390;&#12496;&#12540;&#12472;&#12519;&#12531;&#12539;&#12481;&#12455;&#12483;&#12463;&#12434;&#34892;&#12356;&#12289;&#20877;&#25509;&#32154;&#12375;&#12414;&#12377;
sess.lock(pk, LockMode.UPGRADE);</pre></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-deleting"></a>9.5. &#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#21066;&#38500;</h2></div></div><div></div></div><p>
            <tt class="literal">Session.delete()</tt> &#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12434;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;
            &#12418;&#12385;&#12429;&#12435;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12414;&#12384;&#12381;&#12428;&#12408;&#12398;&#21442;&#29031;&#12434;&#20445;&#25345;&#12375;&#12390;&#12356;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
            &#12381;&#12398;&#12383;&#12417; <tt class="literal">delete()</tt> &#12399;&#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#19968;&#26178;&#30340;&#12395;&#12377;&#12427;&#12418;&#12398;&#12392;&#32771;&#12360;&#12427;&#12398;&#12364;&#19968;&#30058;&#12391;&#12377;&#12290;
        </p><pre class="programlisting">sess.delete(cat);</pre><p>
            Hibernate&#12463;&#12456;&#12522;&#25991;&#23383;&#21015;&#12434; <tt class="literal">delete()</tt> &#12395;&#28193;&#12377;&#12392;&#12289;
            &#22810;&#12367;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#19968;&#24230;&#12395;&#21066;&#38500;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><p>             
            &#20170;&#12391;&#12399;&#12418;&#12358;&#12289;&#22806;&#37096;&#12461;&#12540;&#21046;&#32004;&#12395;&#36949;&#21453;&#12377;&#12427;&#12522;&#12473;&#12463;&#12394;&#12375;&#12391;&#12289;
            &#22909;&#12365;&#12394;&#38918;&#24207;&#12391;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
            &#12418;&#12385;&#12429;&#12435;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#38291;&#36949;&#12387;&#12383;&#38918;&#24207;&#12391;&#21066;&#38500;&#12377;&#12427;&#12392;&#12289;
            &#22806;&#37096;&#12461;&#12540;&#12398; <tt class="literal">NOT NULL</tt> &#21046;&#32004;&#12395;&#36949;&#21453;&#12377;&#12427;&#21487;&#33021;&#24615;&#12399;&#12414;&#12384;&#12354;&#12426;&#12414;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-flushing"></a>9.6. &#12501;&#12521;&#12483;&#12471;&#12517;</h2></div></div><div></div></div><p>
            JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12398;&#29366;&#24907;&#12434;&#12513;&#12514;&#12522;&#20869;&#37096;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12392;&#21516;&#26399;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;SQL&#25991;&#12434; 
            <tt class="literal">Session</tt> &#12364;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12364;&#12383;&#12414;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
            &#12371;&#12398;&#20966;&#29702; <span class="emphasis"><em>&#12501;&#12521;&#12483;&#12471;&#12517;</em></span> &#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#20197;&#19979;&#12398;&#12509;&#12452;&#12531;&#12488;&#12391;&#36215;&#12371;&#12426;&#12414;&#12377;&#12290;
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    <tt class="literal">find()</tt> &#12420; <tt class="literal">iterate()</tt> &#12398;&#12356;&#12367;&#12388;&#12363;&#12398;&#36215;&#21205;&#12363;&#12425;
                </p></li><li><p>
                    <tt class="literal">net.sf.hibernate.Transaction.commit()</tt> &#12363;&#12425;
                </p></li><li><p>
                    <tt class="literal">Session.flush()</tt> &#12363;&#12425;
                </p></li></ul></div><p>
            SQL&#25991;&#12399;&#20197;&#19979;&#12398;&#38918;&#30058;&#12391;&#30330;&#34892;&#12373;&#12428;&#12414;&#12377;
        </p><div class="orderedlist"><ol type="1" compact><li><p>
                    &#12377;&#12409;&#12390;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#25407;&#20837;&#12399; <tt class="literal">Session.save()</tt> &#12434;&#20351;&#12387;&#12390;&#12289;
                    &#23550;&#24540;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#21516;&#12376;&#38918;&#24207;&#12391;&#12475;&#12540;&#12502;&#12373;&#12428;&#12427;
                </p></li><li><p>
                    &#12377;&#12409;&#12390;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#26356;&#26032;
                </p></li><li><p>
                    &#12377;&#12409;&#12390;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#21066;&#38500;
                </p></li><li><p>
                    &#12377;&#12409;&#12390;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#35201;&#32032;&#12398;&#21066;&#38500;&#12289;&#26356;&#26032;&#12289;&#25407;&#20837;
                </p></li><li><p>
                    &#12377;&#12409;&#12390;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#25407;&#20837;
                </p></li><li><p>
                    &#12377;&#12409;&#12390;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#21066;&#38500;&#65288;<tt class="literal">Session.delete()</tt> &#12434;&#20351;&#12356;
                    &#23550;&#24540;&#12377;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#12398;&#12392;&#21516;&#12376;&#38918;&#24207;&#12391;&#65289;
                </p></li></ol></div><p>
            &#65288;&#20363;&#22806;&#12399; <tt class="literal">native</tt> ID&#29983;&#25104;&#12434;&#20351;&#12356;&#12289;
            &#12381;&#12428;&#12425;&#12364;&#12475;&#12540;&#12502;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#25407;&#20837;&#12373;&#12428;&#12427;&#22580;&#21512;&#12391;&#12377;&#12290;&#65289;
        </p><p>
            &#26126;&#31034;&#30340;&#12395; <tt class="literal">flush()</tt> &#12373;&#12428;&#12427;&#12392;&#12365;&#12434;&#38500;&#12356;&#12390;&#12289;
            <span class="emphasis"><em>&#12356;&#12388;</em></span> <tt class="literal">Session</tt> &#12364;JDBC&#12467;&#12540;&#12523;&#12434;&#23455;&#34892;&#12377;&#12427;&#12363;&#12398;&#32118;&#23550;&#30340;&#12394;&#20445;&#35388;&#12399;&#12394;&#12367;&#12289;
            &#23455;&#34892;&#12398; <span class="emphasis"><em>&#38918;&#24207;</em></span> &#12384;&#12369;&#12364;&#20445;&#35388;&#12373;&#12428;&#12414;&#12377;&#12290;
            &#12375;&#12363;&#12375;Hibernate&#12399; <tt class="literal">Session.find(..)</tt> &#12513;&#12477;&#12483;&#12489;&#12364;&#12289;
            &#21476;&#12356;&#12487;&#12540;&#12479;&#12420;&#38291;&#36949;&#12387;&#12383;&#12487;&#12540;&#12479;&#12434;&#36820;&#12377;&#12371;&#12392;&#12399;&#32118;&#23550;&#12395;&#12394;&#12356;&#12371;&#12392;&#12434;&#20445;&#35388;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
        </p><p>
            &#12501;&#12521;&#12483;&#12471;&#12517;&#12364;&#12381;&#12358;&#38971;&#32321;&#12395;&#36215;&#12371;&#12425;&#12394;&#12356;&#12424;&#12358;&#12395;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#25391;&#12427;&#33310;&#12356;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;&#12290;
            <tt class="literal">FlushMode</tt> &#12463;&#12521;&#12473;&#12399;3&#12388;&#12398;&#30064;&#12394;&#12387;&#12383;&#12514;&#12540;&#12489;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12399;&#12300;&#35501;&#12415;&#36796;&#12415;&#12398;&#12415;&#12301;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#22580;&#21512;&#12395;&#26368;&#12418;&#26377;&#29992;&#12391;&#12377;&#12290;
            &#12381;&#12428;&#12399;&#65288;&#38750;&#24120;&#12395;&#65289;&#12431;&#12378;&#12363;&#12394;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;&#12398;&#12383;&#12417;&#12395;&#20351;&#12431;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
        </p><pre class="programlisting">sess = sf.openSession();
Transaction tx = sess.beginTransaction();
sess.setFlushMode(FlushMode.COMMIT); // &#12463;&#12456;&#12522;&#12364;&#21476;&#12356;&#12487;&#12540;&#12479;&#12434;&#36820;&#12377;&#12371;&#12392;&#12434;&#35377;&#12375;&#12414;&#12377;
Cat izi = (Cat) sess.load(Cat.class, id);
izi.setName(iznizi);
// &#12463;&#12456;&#12522;&#12434;&#12356;&#12367;&#12388;&#12363;&#23455;&#34892;&#12375;&#12414;&#12377;....
sess.find("from Cat as cat left outer join cat.kittens kitten");
// izi&#12408;&#12398;&#22793;&#26356;&#12399;&#12501;&#12521;&#12483;&#12471;&#12517;&#12373;&#12428;&#12414;&#12379;&#12435;
...
tx.commit(); // &#12501;&#12521;&#12483;&#12471;&#12517;&#12364;&#36215;&#12371;&#12426;&#12414;&#12377;</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-endingsession"></a>9.7. Session&#12398;&#32066;&#20102;</h2></div></div><div></div></div><p>
            Session&#12398;&#32066;&#20102;&#12395;&#12399;4&#12388;&#12398;&#26126;&#30906;&#12394;&#12501;&#12455;&#12540;&#12474;&#12364;&#12354;&#12426;&#12414;&#12377;&#65306;
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    Session&#12434;&#12501;&#12521;&#12483;&#12471;&#12517;&#12377;&#12427;
                </p></li><li><p>
                    &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12467;&#12511;&#12483;&#12488;&#12377;&#12427;
                </p></li><li><p>
                    Session&#12434;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;
                </p></li><li><p>
                    &#20363;&#22806;&#12395;&#23550;&#20966;&#12377;&#12427;
                </p></li></ul></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-endingsession-flushing"></a>9.7.1. Session&#12398;&#12501;&#12521;&#12483;&#12471;&#12517;</h3></div></div><div></div></div><p>
                &#20598;&#28982; <tt class="literal">Transaction</tt> API&#12434;&#20351;&#12358;&#12371;&#12392;&#12395;&#12394;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;
                &#12371;&#12398;&#12473;&#12486;&#12483;&#12503;&#12434;&#24515;&#37197;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
                &#12371;&#12428;&#12399;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#12467;&#12511;&#12483;&#12488;&#12373;&#12428;&#12427;&#12392;&#12365;&#12395;&#12289;&#26263;&#40665;&#30340;&#12395;&#23455;&#34892;&#12373;&#12428;&#12414;&#12377;&#12290;
                &#12381;&#12358;&#12391;&#12394;&#12369;&#12428;&#12400;&#12289;&#12377;&#12409;&#12390;&#12398;&#22793;&#26356;&#12364;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#21516;&#26399;&#12434;&#21462;&#12427;&#12371;&#12392;&#12434;&#30906;&#23455;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
                <tt class="literal">Session.flush()</tt> &#12434;&#12467;&#12540;&#12523;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-endingsession-commit"></a>9.7.2. &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#12467;&#12511;&#12483;&#12488;</h3></div></div><div></div></div><p>
                Hibernate&#12398; <tt class="literal">Transaction</tt> API&#12434;&#20351;&#12358;&#12394;&#12425;&#12289;&#12371;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#65306;
            </p><pre class="programlisting">tx.commit(); // Session&#12434;&#12501;&#12521;&#12483;&#12471;&#12517;&#12375;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12414;&#12377;</pre><p>
                &#12418;&#12375;JDBC&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#29420;&#33258;&#12395;&#31649;&#29702;&#12377;&#12427;&#12394;&#12425;&#12289;
                JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#25163;&#20316;&#26989;&#12391; <tt class="literal">commit()</tt> &#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
            </p><pre class="programlisting">sess.flush();
sess.connection().commit();  // JTA&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12395;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;</pre><p>
                &#12418;&#12375;&#22793;&#26356;&#12434;&#12467;&#12511;&#12483;&#12488; <span class="emphasis"><em>&#12375;&#12394;&#12356;</em></span>&#12392;&#27770;&#12417;&#12383;&#12394;&#12425;&#65306;
            </p><pre class="programlisting">tx.rollback();  // &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12375;&#12414;&#12377;]&gt;&lt;/programlisting&gt;

            &lt;para&gt;
                or:
            &lt;/para&gt;

            &lt;programlisting&gt;&lt;![CDATA[// JTA&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12395;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;&#12289;&#12381;&#12358;&#12391;&#12394;&#12369;&#12428;&#12400;&#37325;&#35201;&#12391;&#12377;
sess.connection().rollback();</pre><p>
                &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12377;&#12427;&#12394;&#12425;&#12289;
                Hibernate&#12398;&#20869;&#37096;&#29366;&#24907;&#12398;&#25972;&#21512;&#24615;&#12364;&#21462;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;&#30906;&#23455;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
                &#29694;&#22312;&#12398;Session&#12434;&#21363;&#24231;&#12395;&#12463;&#12525;&#12540;&#12474;&#12375;&#12390;&#25448;&#12390;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="manipulatingdata-endingsession-close"></a>9.7.3. Session&#12398;&#12463;&#12525;&#12540;&#12474;</h3></div></div><div></div></div><p>
                <tt class="literal">Session.close()</tt> &#12408;&#12398;&#12467;&#12540;&#12523;&#12399;Session&#12398;&#32066;&#20102;&#12434;&#12510;&#12540;&#12463;&#12375;&#12414;&#12377;&#12290; 
                JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12364;Session&#12363;&#12425;&#25918;&#26820;&#12373;&#12428;&#12427;&#12371;&#12392;&#12364; <tt class="literal">close()</tt> &#12398;&#20027;&#12394;&#24847;&#21619;&#12391;&#12377;&#12290;
            </p><pre class="programlisting">tx.commit();
sess.close();</pre><pre class="programlisting">sess.flush();
sess.connection().commit();  // JTA&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12395;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;
sess.close();</pre><p>   
                &#29420;&#33258;&#12395;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#29992;&#24847;&#12377;&#12428;&#12400;&#12289;<tt class="literal">close()</tt> &#12399;&#12381;&#12428;&#12408;&#12398;&#21442;&#29031;&#12434;&#36820;&#12377;&#12398;&#12391;&#12289;
                &#25163;&#20316;&#26989;&#12391;&#12463;&#12525;&#12540;&#12474;&#12375;&#12390;&#12503;&#12540;&#12523;&#12395;&#25147;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
                &#12373;&#12418;&#12394;&#12369;&#12428;&#12400; <tt class="literal">close()</tt> &#12399;&#12381;&#12428;&#12434;&#12503;&#12540;&#12523;&#12395;&#25147;&#12375;&#12414;&#12377;&#12290;
            </p></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-exceptions"></a>9.8. &#20363;&#22806;&#20966;&#29702;</h2></div></div><div></div></div><p>
			Hibernate&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12392;&#20363;&#22806;&#12395;&#20986;&#12367;&#12431;&#12377;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
			&#12381;&#12428;&#12399;&#22823;&#25269;&#12289;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12383; <tt class="literal">HibernateException</tt> &#12391;&#12377;&#12290;
			&#12371;&#12398;&#20363;&#22806;&#12399;&#12289;&#20837;&#12428;&#23376;&#29366;&#12398;&#26681;&#26412;&#21407;&#22240;&#65288;root cause&#65289;&#12434;&#25345;&#12388;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
			&#12381;&#12428;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12395;&#12399;&#12289;<tt class="literal">getCause()</tt> &#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
		</p><p>
			<tt class="literal">Session</tt> &#12364;&#20363;&#22806;&#12434;&#12473;&#12525;&#12540;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;
			&#21363;&#24231;&#12395;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12375;&#12289;<tt class="literal">Session.close()</tt> 
			&#12434;&#12467;&#12540;&#12523;&#12375;&#12289;<tt class="literal">Session</tt> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#25448;&#12390;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
			<tt class="literal">Session</tt> &#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#20013;&#12395;&#12399;&#12289;
			Session&#12434;&#25972;&#21512;&#24615;&#12398;&#12354;&#12427;&#29366;&#24907;&#12395; <span class="emphasis"><em>&#12375;&#12394;&#12356;</em></span> &#12418;&#12398;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
			&#12388;&#12414;&#12426;&#12371;&#12428;&#12399;&#12289;Hibernate&#12364;&#12473;&#12525;&#12540;&#12377;&#12427;&#20363;&#22806;&#12399;&#20840;&#12390;&#33268;&#21629;&#30340;&#12394;&#12418;&#12398;&#12391;&#12354;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
			&#12381;&#12398;&#12383;&#12417;&#12289;&#12481;&#12455;&#12483;&#12463;&#12373;&#12428;&#12383; <tt class="literal">HibernateException</tt> &#12434; 
			<tt class="literal">RuntimeException</tt> &#12395;&#22793;&#25563;&#12375;&#12383;&#12356;&#22580;&#21512;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;
			&#65288;&#26368;&#12418;&#31777;&#21336;&#12394;&#12398;&#12399;&#12289;<tt class="literal">HibernateException.java</tt> &#12398; 
			<tt class="literal">extends</tt> &#12434;&#32622;&#12365;&#25563;&#12360;&#12390;&#12289;Hibernate&#12434;&#20877;&#12467;&#12531;&#12497;&#12452;&#12523;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#65289;&#12290;
			&#12481;&#12455;&#12483;&#12463;&#20363;&#22806;&#12399;Hibernate&#12398;&#36986;&#29289;&#12391;&#12354;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
			&#12371;&#12428;&#12399;Hibernate&#12398;&#23558;&#26469;&#12398;&#12513;&#12472;&#12515;&#12540;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#22793;&#26356;&#12373;&#12428;&#12414;&#12377;&#12290;
		</p><p>
			&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12398;&#12420;&#12426;&#12392;&#12426;&#12398;&#26368;&#20013;&#12395;&#12473;&#12525;&#12540;&#12373;&#12428;&#12383;SQLException&#12399;&#12289;
			Hibernate&#12395;&#12424;&#12387;&#12390;JDBCException&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12408;&#12398;&#22793;&#25563;&#12364;&#35430;&#12415;&#12425;&#12428;&#12414;&#12377;&#12290;
			&#26681;&#26412;&#21407;&#22240;&#12398;SQLException&#12395;&#12399;&#12289;<tt class="literal">JDBCException.getCause()</tt> 
			&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12391;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290;
			Hibernate&#12395;&#12424;&#12427;SQLException&#12363;&#12425;&#36969;&#20999;&#12394;JDBCException&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12408;&#12398;&#22793;&#25563;&#12399;&#12289;
			SessionFactory&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;SQLExceptionConverter&#12395;&#22522;&#12389;&#12356;&#12390;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;
			&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;&#12393;&#12398;SQLExceptionConverter&#12364;&#20351;&#12431;&#12428;&#12427;&#12363;&#12399;&#12289;
			&#35373;&#23450;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#26041;&#35328;&#12395;&#12424;&#12387;&#12390;&#27770;&#12414;&#12426;&#12414;&#12377;&#12290;
			&#12375;&#12363;&#12375;&#12289;&#12459;&#12473;&#12479;&#12512;&#12398;&#23455;&#35013;&#12434;&#12503;&#12521;&#12464;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;
			&#65288;&#35443;&#32048;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;SQLExceptionConverterFactory&#12463;&#12521;&#12473;&#12398;javadoc&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;&#12290;
			&#27161;&#28310;&#12398;JDBCException&#12398;&#12469;&#12502;&#12479;&#12452;&#12503;&#12399;&#12289;&#20197;&#19979;&#12398;&#12418;&#12398;&#12391;&#12377;&#65306;
		</p><div class="itemizedlist"><ul type="disc" compact><li><p>
					<tt class="literal">JDBCConnectionException</tt> - &#12505;&#12540;&#12473;&#12392;&#12394;&#12427;
					JDBC&#12467;&#12511;&#12517;&#12491;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#38306;&#12377;&#12427;&#12456;&#12521;&#12540;&#12434;&#31034;&#21766;&#12375;&#12414;&#12377;&#12290;
				</p></li><li><p>
					<tt class="literal">SQLGrammarException</tt> - &#30330;&#34892;&#12375;&#12383;SQL&#12395;&#38306;&#12377;&#12427;
					&#25991;&#27861;&#12420;&#27083;&#25991;&#12398;&#21839;&#38988;&#12434;&#31034;&#21766;&#12375;&#12414;&#12377;&#12290;
				</p></li><li><p>
					<tt class="literal">ConstraintViolationException</tt> - &#20309;&#12425;&#12363;&#12398;
					&#25972;&#21512;&#24615;&#21046;&#32004;&#36949;&#21453;&#12434;&#31034;&#21766;&#12375;&#12414;&#12377;&#12290;
				</p></li><li><p>
					<tt class="literal">LockAcquisitionException</tt> - &#12522;&#12463;&#12456;&#12473;&#12488;&#12373;&#12428;&#12383;&#25805;&#20316;&#12398;&#23455;&#34892;&#12395;
					&#24517;&#35201;&#12394;&#12525;&#12483;&#12463;&#12524;&#12505;&#12523;&#12398;&#21462;&#24471;&#12395;&#38306;&#12377;&#12427;&#12456;&#12521;&#12540;&#12434;&#31034;&#21766;&#12375;&#12414;&#12377;&#12290;
				</p></li><li><p>
					<tt class="literal">GenericJDBCException</tt> - &#20182;&#12398;&#12459;&#12486;&#12468;&#12522;&#12395;&#35442;&#24403;&#12375;&#12394;&#12356;
					&#19968;&#33324;&#30340;&#12394;&#20363;&#22806;&#12391;&#12377;&#12290;
				</p></li></ul></div><p>
			&#24120;&#12395;&#20840;&#12390;&#12398;&#20363;&#22806;&#12399;&#12289;&#29694;&#26178;&#28857;&#12398; <tt class="literal">Session</tt> 
			&#12392;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#33268;&#21629;&#30340;&#12391;&#12354;&#12427;&#12392;&#32771;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;
			Hibernate&#12364;&#12373;&#12414;&#12374;&#12414;&#12394;SQLException&#12398;&#22411;&#12434;&#21306;&#21029;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12383;&#12363;&#12425;&#12392;&#12356;&#12387;&#12390;&#12289;
			Session&#12395;&#23550;&#12375;&#12390;&#12371;&#12428;&#12425;&#12398;&#20363;&#22806;&#12364;&#24489;&#24112;&#21487;&#33021;&#12394;&#12418;&#12398;&#12395;&#12394;&#12387;&#12383;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
			&#12371;&#12398;&#20363;&#22806;&#12398;&#22411;&#38542;&#23652;&#12395;&#12424;&#12387;&#12390;&#12289;&#20363;&#22806;&#12398;&#21407;&#22240;&#12398;&#12459;&#12486;&#12468;&#12522;&#12395;&#23550;&#12377;&#12427;
			&#12503;&#12525;&#12464;&#12521;&#12512;&#12398;&#21453;&#24540;&#12434;&#23481;&#26131;&#12395;&#12375;&#12383;&#12384;&#12369;&#12391;&#12377;&#12290;
		</p><p>
			&#20197;&#19979;&#12398;&#20363;&#22806;&#20966;&#29702;&#12452;&#12487;&#12451;&#12458;&#12512;&#12399;&#12289;Hibernate&#12434;&#20351;&#12358;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12398;&#20856;&#22411;&#20363;&#12391;&#12377;&#65306;
		</p><pre class="programlisting">Session sess = factory.openSession();
Transaction tx = null;
try {
    tx = sess.beginTransaction();
    // do some work
    ...
    tx.commit();
}
catch (Exception e) {
    if (tx!=null) tx.rollback();
    throw e;
}
finally {
    sess.close();
}</pre><p>
			&#12414;&#12383;&#12289;JDBC&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#33258;&#20998;&#12391;&#31649;&#29702;&#12377;&#12427;&#12392;&#12365;&#12399;&#65306;
		</p><pre class="programlisting">Session sess = factory.openSession();
try {
    // do some work
    ...
    sess.flush();
    sess.connection().commit();
}
catch (Exception e) {
    sess.connection().rollback();
    throw e;
}
finally {
    sess.close();
}</pre><p>
			&#12414;&#12383;&#12289;JTA&#12395;&#30331;&#37682;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12434;&#20351;&#12358;&#12392;&#12365;&#12399;&#65306;
		</p><pre class="programlisting">SessionContext ctx = ... ;
Session sess = factory.openSession();
try {
    // do some work
    ...
    sess.flush();
}
catch (Exception e) {
    // ctx.setRollbackOnly();
    throw new EJBException(e);
}
finally {
    sess.close();
}</pre><p>
			&#65288;JTA&#12391;&#31649;&#29702;&#12373;&#12428;&#12427;&#29872;&#22659;&#12395;&#12362;&#12369;&#12427;&#65289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#65381;&#12469;&#12540;&#12496;&#12399;&#12289;
			<tt class="literal">java.lang.RuntimeException</tt> &#12395;&#23550;&#12375;&#12390;&#12398;&#12415;&#12289;
			&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12434;&#33258;&#21205;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12434;&#24515;&#12395;&#30041;&#12417;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
			&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20363;&#22806;&#65288;&#12388;&#12414;&#12426; <tt class="literal">HibernateException</tt> &#65289;&#12364;&#30330;&#29983;&#12375;&#12383;&#22580;&#21512;&#12399;&#12289;
			<tt class="literal">EJBContext</tt> &#12395;&#12362;&#12356;&#12390; <tt class="literal">setRollbackOnly()</tt> 
			&#12434;&#33258;&#20998;&#12391;&#12467;&#12540;&#12523;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
			&#12418;&#12375;&#12367;&#12399;&#19978;&#12398;&#20363;&#12398;&#12424;&#12358;&#12395;&#12289;&#33258;&#21205;&#12525;&#12540;&#12523;&#12496;&#12483;&#12463;&#12377;&#12427;&#12383;&#12417;&#12395; <tt class="literal">RuntimeException</tt> 
			&#65288;&#20363;&#12360;&#12400;&#12289;<tt class="literal">EJBException</tt> &#65289;&#12391;&#12521;&#12483;&#12503;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
		</p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-graphs"></a>9.9. &#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12392;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12464;&#12521;&#12501;</h2></div></div><div></div></div><p>
            &#38306;&#36899;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12464;&#12521;&#12501;&#12398;&#20013;&#12398;&#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12475;&#12540;&#12502;&#12414;&#12383;&#12399;&#26356;&#26032;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;
            &#20197;&#19979;&#12398;&#12393;&#12385;&#12425;&#12363;&#12434;&#34892;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    &#20491;&#12293;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390; <tt class="literal">save()</tt> &#12414;&#12383;&#12399; 
                    <tt class="literal">saveOrUpdate()</tt> &#12414;&#12383;&#12399; <tt class="literal">update()</tt> &#12377;&#12427;&#12363;
                </p></li><li><p>
                    <tt class="literal">cascade="all"</tt> &#12414;&#12383;&#12399; <tt class="literal">cascade="save-update"</tt> &#12434;&#20351;&#12356;&#12289;
                    &#38306;&#36899;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12290;
                </p></li></ul></div><p>
            &#21516;&#12376;&#12424;&#12358;&#12395;&#12289;&#12464;&#12521;&#12501;&#12398;&#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21066;&#38500;&#12377;&#12427;&#12395;&#12399;&#12289;&#20197;&#19979;&#12398;&#12393;&#12385;&#12425;&#12363;&#12434;&#34892;&#12356;&#12414;&#12377;
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    &#20491;&#12293;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434; <tt class="literal">delete()</tt> &#12377;&#12427;&#12363;
                </p></li><li><p>
                    <tt class="literal">cascade="all"</tt> &#12414;&#12383;&#12399; <tt class="literal">cascade="all-delete-orphan"</tt> &#12414;&#12383;&#12399; 
                    <tt class="literal">cascade="delete"</tt> &#12434;&#20351;&#12356;&#12289;&#38306;&#36899;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12290;
                </p></li></ul></div><p>
            &#12362;&#12377;&#12377;&#12417;&#65306;
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    &#12418;&#12375;&#23376;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29983;&#23384;&#26399;&#38291;&#12364;&#35242;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29983;&#23384;&#26399;&#38291;&#12395;&#21046;&#38480;&#12434;&#21463;&#12369;&#12427;&#12394;&#12425;&#12289;
                    <tt class="literal">cascade="all"</tt> &#12392;&#25351;&#23450;&#12375;&#12390;&#12289;
                    &#12381;&#12428;&#12434; <span class="emphasis"><em>&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;</em></span>&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></li><li><p>
                    &#12373;&#12418;&#12394;&#12369;&#12428;&#12400;&#26126;&#31034;&#30340;&#12395;&#12381;&#12428;&#12434; <tt class="literal">save()</tt> &#12375;&#12289;
                    &#12381;&#12375;&#12390;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12540;&#12489;&#12363;&#12425; <tt class="literal">delete()</tt> &#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12418;&#12375;&#26412;&#24403;&#12395;&#20313;&#20998;&#12394;&#12479;&#12452;&#12500;&#12531;&#12464;&#12434;&#12375;&#12390;&#12475;&#12540;&#12502;&#12434;&#34892;&#12356;&#12383;&#12369;&#12428;&#12400;&#12289;
                    <tt class="literal">cascade="save-update"</tt> &#12434;&#20351;&#12356;&#12289;
                    &#26126;&#31034;&#30340;&#12395; <tt class="literal">delete()</tt> &#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></li></ul></div><p>
            <tt class="literal">cascade="all"</tt> &#12392;&#38306;&#36899;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12392;&#65288;many-to-one&#12414;&#12383;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65289;&#12289;
            &#12381;&#12398;&#38306;&#36899;&#12399; <span class="emphasis"><em>&#35242; / &#23376;</em></span> &#12473;&#12479;&#12452;&#12523;&#12398;&#38306;&#20418;&#12392;&#12375;&#12390;&#12510;&#12540;&#12463;&#12373;&#12428;&#12414;&#12377;&#12290;
            &#12381;&#12428;&#12399;&#35242;&#12398;&#12475;&#12540;&#12502;/&#26356;&#26032;/&#21066;&#38500;&#12434;&#34892;&#12358;&#12392;&#12289;&#23376;&#12398;&#12475;&#12540;&#12502;/&#26356;&#26032;/&#21066;&#38500;&#12364;&#34892;&#12431;&#12428;&#12427;&#38306;&#20418;&#12391;&#12377;&#12290;
            &#12373;&#12425;&#12395;&#27704;&#32154;&#30340;&#12394;&#35242;&#12363;&#12425;&#23376;&#12408;&#12398;&#21336;&#12394;&#12427;&#21442;&#29031;&#12377;&#12427;&#12392;&#12289;&#23376;&#12398;&#12475;&#12540;&#12502;/&#26356;&#26032;&#12364;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;
            &#12375;&#12363;&#12375;&#12513;&#12479;&#12501;&#12449;&#12540;&#12399;&#19981;&#23436;&#20840;&#12391;&#12377;&#12290;
            <tt class="literal">cascade="all-delete-orphan"</tt> &#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12383; 
            <tt class="literal">&lt;one-to-many&gt;</tt> &#38306;&#36899;&#12398;&#22580;&#21512;&#12434;&#38500;&#12356;&#12390;&#12289;
            &#23376;&#12364;&#35242;&#12363;&#12425;&#21442;&#29031;&#12373;&#12428;&#12394;&#12367;&#12394;&#12387;&#12390;&#12418;&#33258;&#21205;&#30340;&#12395;&#12399;&#21066;&#38500; <span class="emphasis"><em>&#12373;&#12428;&#12414;&#12379;&#12435;</em></span>&#12290;
            &#25805;&#20316;&#12398;&#12459;&#12473;&#12465;&#12540;&#12489;&#12398;&#27491;&#30906;&#12394;&#24847;&#21619;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#65306;
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    &#12418;&#12375;&#35242;&#12364;&#12475;&#12540;&#12502;&#12373;&#12428;&#12428;&#12400;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12399; <tt class="literal">saveOrUpdate()</tt> &#12395;&#28193;&#12373;&#12428;&#12427;
                </p></li><li><p>
                    &#12418;&#12375;&#35242;&#12364; <tt class="literal">update()</tt> &#12414;&#12383;&#12399; <tt class="literal">saveOrUpdate()</tt> &#12395;&#28193;&#12373;&#12428;&#12428;&#12400;&#12289;
                    &#12377;&#12409;&#12390;&#12398;&#23376;&#12399; <tt class="literal">saveOrUpdate()</tt> &#12395;&#28193;&#12373;&#12428;&#12427;
                </p></li><li><p>
                    &#12418;&#12375;&#19968;&#26178;&#30340;&#12394;&#23376;&#12364;&#27704;&#32154;&#30340;&#12394;&#35242;&#12363;&#12425;&#21442;&#29031;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12428;&#12400;&#12289;
                    &#23376;&#12399; <tt class="literal">saveOrUpdate()</tt> &#12395;&#28193;&#12373;&#12428;&#12427;
                </p></li><li><p>
                    &#12418;&#12375;&#35242;&#12364;&#21066;&#38500;&#12373;&#12428;&#12428;&#12400;&#12289;&#12377;&#12409;&#12390;&#12398;&#23376;&#12399; <tt class="literal">delete()</tt> &#12395;&#28193;&#12373;&#12428;&#12427;
                </p></li><li><p>
                    &#12418;&#12375;&#19968;&#26178;&#30340;&#12394;&#23376;&#12364;&#27704;&#32154;&#30340;&#12394;&#35242;&#12363;&#12425;&#21442;&#29031;&#12373;&#12428;&#12394;&#12367;&#12394;&#12387;&#12390;&#12418;&#12289;
                    <span class="emphasis"><em>&#29305;&#21029;&#12395;&#12399;&#20309;&#12418;&#36215;&#12371;&#12425;&#12394;&#12356;</em></span>&#12290;
                    &#65288;&#24517;&#35201;&#12394;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#26126;&#31034;&#30340;&#12395;&#23376;&#12434;&#21066;&#38500;&#12377;&#12409;&#12365;&#12391;&#12377;&#65289;
                    &#12383;&#12384;&#12375; <tt class="literal">cascade="all-delete-orphan"</tt> &#12398;&#22580;&#21512;&#12399;&#38500;&#12365;&#12414;&#12377;&#12290;
                    &#12371;&#12398;&#22580;&#21512;&#12399;&#12300;&#12415;&#12394;&#12375;&#12372;&#12301;&#12399;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;&#12290;
                </p></li></ul></div><p>
            Hibernate&#12399;&#12300;&#21040;&#36948;&#21487;&#33021;&#24615;&#12395;&#12424;&#12427;&#27704;&#32154;&#21270;&#12301;&#12434;&#23436;&#20840;&#12395;&#12399;&#23455;&#35013;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
            &#12381;&#12428;&#12399;&#65288;&#38750;&#21177;&#29575;&#30340;&#12394;&#65289;&#27704;&#32154;&#12460;&#12505;&#12540;&#12472;&#12539;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21547;&#24847;&#12377;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;
            &#12375;&#12363;&#12375;&#19968;&#33324;&#30340;&#12394;&#35201;&#27714;&#12398;&#12383;&#12417;&#12289;Hibernate&#12399;&#20182;&#12398;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12363;&#12425;&#21442;&#29031;&#12373;&#12428;&#12383;&#12392;&#12365;&#12395;&#12289;
            &#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12364;&#27704;&#32154;&#21270;&#12373;&#12428;&#12427;&#12424;&#12358;&#12395;&#12394;&#12427;&#32771;&#12360;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            <tt class="literal">cascade="save-update"</tt> &#12392;&#12510;&#12540;&#12463;&#12373;&#12428;&#12383;&#38306;&#36899;&#12399;&#12371;&#12398;&#12424;&#12358;&#12395;&#25391;&#12427;&#33310;&#12356;&#12414;&#12377;&#12290;
            &#12418;&#12375;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#36890;&#12375;&#12390;&#12371;&#12398;&#26041;&#27861;&#12434;&#20351;&#12356;&#12383;&#12369;&#12428;&#12400;&#12289;
            &#21336;&#32020;&#12395; <tt class="literal">&lt;hibernate-mapping&gt;</tt> &#35201;&#32032;&#12398; 
            <tt class="literal">default-cascade</tt> &#23646;&#24615;&#12434;&#25351;&#23450;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-interceptors"></a>9.10. &#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;</h2></div></div><div></div></div><p>                
            <tt class="literal">Interceptor</tt> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12399;Session&#12363;&#12425;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12408;&#12398;
            &#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12381;&#12428;&#12399;&#12475;&#12540;&#12502;&#12289;&#26356;&#26032;&#12289;&#21066;&#38500;&#12289;&#12525;&#12540;&#12489;&#12398;&#21069;&#12395;&#12289;
            &#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35211;&#12383;&#12426;&#25805;&#20316;&#12375;&#12383;&#12426;&#12391;&#12365;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12398;&#20351;&#12356;&#12415;&#12385;&#12391;&#32771;&#12360;&#12425;&#12428;&#12427;&#12418;&#12398;&#12399;&#12289;&#12467;&#12540;&#12489;&#30435;&#26619;&#12398;&#12383;&#12417;&#12398;&#24773;&#22577;&#12434;&#36861;&#36321;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
            &#20363;&#12360;&#12400;&#20197;&#19979;&#12398; <tt class="literal">Interceptor</tt> &#12399;&#12289;
            <tt class="literal">Auditable</tt> &#12364;&#20316;&#25104;&#12373;&#12428;&#12383;&#12392;&#12365; <tt class="literal">createTimestamp</tt>&gt; &#12434;&#33258;&#21205;&#30340;&#12395;&#35373;&#23450;&#12375;&#12289;
            <tt class="literal">Auditable</tt> &#12364;&#26356;&#26032;&#12373;&#12428;&#12383;&#12392;&#12365; <tt class="literal">lastUpdateTimestamp</tt> &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#26356;&#26032;&#12375;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">package net.sf.hibernate.test;

import java.io.Serializable;
import java.util.Date;
import java.util.Iterator;

import net.sf.hibernate.Interceptor;
import net.sf.hibernate.type.Type;

public class AuditInterceptor implements Interceptor, Serializable {

    private int updates;
    private int creates;

    public void onDelete(Object entity,
                         Serializable id,
                         Object[] state,
                         String[] propertyNames,
                         Type[] types) {
        // &#20309;&#12418;&#12375;&#12414;&#12379;&#12435;
    }

    public boolean onFlushDirty(Object entity, 
                                Serializable id, 
                                Object[] currentState,
                                Object[] previousState,
                                String[] propertyNames,
                                Type[] types) {

        if ( entity instanceof Auditable ) {
            updates++;
            for ( int i=0; i &lt; propertyNames.length; i++ ) {
                if ( "lastUpdateTimestamp".equals( propertyNames[i] ) ) {
                    currentState[i] = new Date();
                    return true;
                }
            }
        }
        return false;
    }

    public boolean onLoad(Object entity, 
                          Serializable id,
                          Object[] state,
                          String[] propertyNames,
                          Type[] types) {
        return false;
    }

    public boolean onSave(Object entity,
                          Serializable id,
                          Object[] state,
                          String[] propertyNames,
                          Type[] types) {
        
        if ( entity instanceof Auditable ) {
            creates++;
            for ( int i=0; i&lt;propertyNames.length; i++ ) {
                if ( "createTimestamp".equals( propertyNames[i] ) ) {
                    state[i] = new Date();
                    return true;
                }
            }
        }
        return false;
    }

    public void postFlush(Iterator entities) {
        System.out.println("Creations: " + creates + ", Updates: " + updates);
    }

    public void preFlush(Iterator entities) {
        updates=0;
        creates=0;
    }
    
    ......
    ......
    
}</pre><p>
            &#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12399;Session&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12365;&#12395;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">Session session = sf.openSession( new AuditInterceptor() );</pre><p>
            &#12414;&#12383;&#12289;<tt class="literal">Configuration</tt> &#12434;&#20351;&#12356;&#12289;&#12464;&#12525;&#12540;&#12496;&#12523;&#12524;&#12505;&#12523;&#12391;&#12452;&#12531;&#12479;&#12540;&#12475;&#12503;&#12479;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#65306;
        </p><pre class="programlisting">new Configuration().setInterceptor( new AuditInterceptor() );</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="manipulatingdata-metadata"></a>9.11. &#12513;&#12479;&#12487;&#12540;&#12479;API</h2></div></div><div></div></div><p>
            Hibernate&#12399;&#12377;&#12409;&#12390;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12392;&#12496;&#12522;&#12517;&#12540;&#12398;&#22411;&#12398;&#38750;&#24120;&#12395;&#12522;&#12483;&#12481;&#12394;&#12513;&#12479;&#12524;&#12505;&#12523;&#12539;&#12514;&#12487;&#12523;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#12290;
            &#12371;&#12398;&#12514;&#12487;&#12523;&#12364;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#33258;&#20307;&#12395;&#12392;&#12387;&#12390;&#12392;&#12390;&#12418;&#24441;&#12395;&#31435;&#12388;&#12371;&#12392;&#12364;&#26178;&#25240;&#12354;&#12426;&#12414;&#12377;&#12290;
            &#20363;&#12360;&#12400;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12300;&#36066;&#12356;&#12301;&#12487;&#12451;&#12540;&#12503;&#12539;&#12467;&#12500;&#12540;&#12450;&#12523;&#12468;&#12522;&#12474;&#12512;&#12434;&#23455;&#35013;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
            Hibernate&#12398;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#20351;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
            &#12381;&#12428;&#12399;&#12393;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12467;&#12500;&#12540;&#12377;&#12409;&#12365;&#12363;&#65288;&#20363; &#26356;&#26032;&#21487;&#33021;&#12394;&#12496;&#12522;&#12517;&#12540;&#22411;&#65289;&#12289;
            &#12414;&#12383;&#12399;&#12377;&#12409;&#12365;&#12391;&#12394;&#12356;&#12363;&#65288;&#20363; &#26356;&#26032;&#19981;&#33021;&#12496;&#12522;&#12517;&#12540;&#22411;&#12289;&#21487;&#33021;&#12394;&#12425;&#38306;&#36899;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#65289;&#12434;
            &#29702;&#35299;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#35201;&#12391;&#12377;&#12290;
        </p><p>
            Hibernate&#12399; <tt class="literal">ClassMetadata</tt> &#12392; <tt class="literal">CollectionMetadata</tt> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12392; 
            <tt class="literal">Type</tt> &#38542;&#23652;&#12434;&#36890;&#12375;&#12390;&#12289;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#20844;&#38283;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12513;&#12479;&#12487;&#12540;&#12479;&#12539;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399; <tt class="literal">SessionFactory</tt> &#12363;&#12425;&#21462;&#24471;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">Cat fritz = ......;
Long id = (Long) catMeta.getIdentifier(fritz);
ClassMetadata catMeta = sessionfactory.getClassMetadata(Cat.class);
Object[] propertyValues = catMeta.getPropertyValues(fritz);
String[] propertyNames = catMeta.getPropertyNames();
Type[] propertyTypes = catMeta.getPropertyTypes();
// &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#38306;&#36899;&#12391;&#12399;&#12394;&#12356;&#12289;&#12377;&#12409;&#12390;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12510;&#12483;&#12503;&#12434;&#21462;&#24471;&#12375;&#12414;&#12377;
// TODO: &#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12398;&#20309;?
Map namedValues = new HashMap();
for ( int i=0; i&lt;propertyNames.length; i++ ) {
    if ( !propertyTypes[i].isEntityType() &amp;&amp; !propertyTypes[i].isCollectionType() ) {
        namedValues.put( propertyNames[i], propertyValues[i] );
    }
}</pre></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="inheritance.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="transactions.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;8&#31456; &#32153;&#25215;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;10&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#21516;&#26178;&#20006;&#34892;&#24615;</td></tr></table></div></body></html>