<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;14&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="querysql.html" title="&#31532;13&#31456; &#12493;&#12452;&#12486;&#12451;&#12502;SQL&#12463;&#12456;&#12522;"><link rel="next" href="toolsetguide.html" title="&#31532;15&#31456; &#12484;&#12540;&#12523;&#12475;&#12483;&#12488;&#65381;&#12460;&#12452;&#12489;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;14&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="querysql.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="toolsetguide.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="performance"></a>&#31532;14&#31456; &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#25913;&#21892;</h2></div></div><div></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="performance-collections"></a>14.1. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#29702;&#35299;</h2></div></div><div></div></div><p>
            &#12377;&#12391;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35441;&#38988;&#12395;&#32080;&#27083;&#12394;&#26178;&#38291;&#12434;&#21106;&#12365;&#12414;&#12375;&#12383;&#12290;&#12371;&#12398;&#31680;&#12391;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;&#23455;&#34892;&#26178;&#12395;&#12393;&#12398;&#12424;&#12358;&#12395;&#25391;&#12427;&#33310;&#12358;&#12363;&#12395;&#12388;&#12356;&#12390;&#35441;&#38988;&#12434;2&#65292;3&#21462;&#12426;&#19978;&#12370;&#12414;&#12377;&#12290;
        </p><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="performance-collections-taxonomy"></a>14.1.1. &#20998;&#39006;</h3></div></div><div></div></div><p>Hibernate&#12399;&#20197;&#19979;&#12398;3&#12388;&#12398;&#31278;&#39006;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;</p><div class="itemizedlist"><ul type="disc"><li><p>&#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;</p></li><li><p>one-to-many&#38306;&#36899;</p></li><li><p>many-to-many&#38306;&#36899;</p></li></ul></div><p>
                &#12371;&#12398;&#20998;&#39006;&#27861;&#12391;&#12399;&#12373;&#12414;&#12374;&#12414;&#12394;&#12486;&#12540;&#12502;&#12523;&#12392;&#22806;&#37096;&#12461;&#12540;&#38306;&#20418;&#12434;&#20998;&#39006;&#12375;&#12414;&#12375;&#12383;&#12290;&#12375;&#12363;&#12375;&#12371;&#12428;&#12399;&#38306;&#20418;&#12514;&#12487;&#12523;&#12395;&#12388;&#12356;&#12390;&#30693;&#12427;&#24517;&#35201;&#12398;&#12354;&#12427;&#12371;&#12392;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;&#12411;&#12392;&#12435;&#12393;&#20309;&#12418;&#25945;&#12360;&#12390;&#12399;&#12367;&#12428;&#12414;&#12379;&#12435;&#12290;&#38306;&#20418;&#27083;&#36896;&#12392;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#29305;&#24500;&#12434;&#23436;&#20840;&#12395;&#29702;&#35299;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#34892;&#12434;&#26356;&#26032;&#12289;&#21066;&#38500;&#12377;&#12427;&#12383;&#12417;&#12395;Hibernate&#12364;&#20351;&#29992;&#12377;&#12427;&#20027;&#12461;&#12540;&#12398;&#27083;&#36896;&#12434;&#32771;&#12360;&#12394;&#12367;&#12390;&#12399;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12371;&#12392;&#12399;&#20197;&#19979;&#12398;&#20998;&#39006;&#12434;&#31034;&#21766;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            </p><div class="itemizedlist"><ul type="disc"><li><p>&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20184;&#12365;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;</p></li><li><p>set</p></li><li><p>bag</p></li></ul></div><p>
                &#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20184;&#12365;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65288;map&#12289;list&#12289;&#37197;&#21015;&#65289;&#12399;&#12377;&#12409;&#12390;&#12289;<tt class="literal">&lt;key&gt;</tt> &#12392; <tt class="literal">&lt;index&gt;</tt>&#12459;&#12521;&#12512;&#12363;&#12425;&#12394;&#12427;&#20027;&#12461;&#12540;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#26356;&#26032;&#12399;&#36890;&#24120;&#12289;&#38750;&#24120;&#12395;&#21177;&#29575;&#30340;&#12391;&#12377;&#12290;&#20027;&#12461;&#12540;&#12399;&#21177;&#29575;&#30340;&#12395;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#20184;&#12369;&#12425;&#12428;&#12289;Hibernate&#12364;&#26356;&#26032;&#12414;&#12383;&#12399;&#21066;&#38500;&#12375;&#12424;&#12358;&#12392;&#12377;&#12427;&#12392;&#12365;&#12289;&#29305;&#23450;&#12398;&#34892;&#12399;&#21177;&#29575;&#30340;&#12395;&#26908;&#32034;&#12373;&#12428;&#12414;&#12377;&#12290;
            </p><p>
                set&#12399;<tt class="literal">&lt;key&gt;</tt>&#12391;&#27083;&#25104;&#12373;&#12428;&#12427;&#20027;&#12461;&#12540;&#12392;&#35201;&#32032;&#12398;&#12459;&#12521;&#12512;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#35201;&#32032;&#12398;&#22411;&#12398;&#12356;&#12367;&#12388;&#12363;&#12395;&#12388;&#12356;&#12390;&#12399;&#21177;&#29575;&#30340;&#12391;&#12399;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#29305;&#12395;&#35079;&#21512;&#35201;&#32032;&#12289;&#12521;&#12540;&#12472;&#65381;&#12486;&#12461;&#12473;&#12488;&#12289;&#12496;&#12452;&#12490;&#12522;&#65381;&#12501;&#12451;&#12540;&#12523;&#12489;&#12394;&#12393;&#12399;&#38750;&#21177;&#29575;&#12391;&#12377;&#12290;&#12381;&#12428;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#35079;&#21512;&#20027;&#12461;&#12540;&#12434;&#21177;&#29575;&#30340;&#12395;&#32034;&#24341;&#20184;&#12369;&#12391;&#12365;&#12394;&#12356;&#12371;&#12392;&#12364;&#12354;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;&#19968;&#26041;&#12391;&#12289;one-to-many&#38306;&#36899;&#12420;many-to-many&#38306;&#36899;&#12289;&#29305;&#12395;&#20154;&#24037;&#35672;&#21029;&#23376;&#12398;&#22580;&#21512;&#12399;&#21516;&#12376;&#12367;&#12425;&#12356;&#21177;&#29575;&#30340;&#12391;&#12377;&#12290;&#65288;&#20313;&#35527;&#65306;<tt class="literal">SchemaExport</tt>&#12395;<tt class="literal">&lt;set&gt;</tt>&#12398;&#20027;&#12461;&#12540;&#12434;&#23455;&#38555;&#12395;&#29983;&#25104;&#12373;&#12379;&#12383;&#12356;&#12394;&#12425;&#12289;&#12377;&#12409;&#12390;&#12398;&#12459;&#12521;&#12512;&#12434;<tt class="literal">not-null="true"</tt>&#12392;&#23450;&#32681;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#65289;
            </p><p>
                bag&#12399;&#26368;&#24746;&#12398;&#12465;&#12540;&#12473;&#12391;&#12377;&#12290;bag&#12399;&#37325;&#35079;&#12375;&#12383;&#35201;&#32032;&#12398;&#20516;&#12434;&#35377;&#12375;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12459;&#12521;&#12512;&#12434;&#25345;&#12383;&#12394;&#12356;&#12398;&#12391;&#12289;&#20027;&#12461;&#12540;&#12399;&#23450;&#32681;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;Hibernate&#12395;&#12399;&#37325;&#35079;&#12375;&#12383;&#34892;&#21516;&#22763;&#12434;&#21306;&#21029;&#12377;&#12427;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;Hibernate&#12399;&#12371;&#12398;&#21839;&#38988;&#12434;&#12289;&#22793;&#26356;&#12364;&#34892;&#12394;&#12431;&#12428;&#12383;&#12392;&#12365;&#12395;&#12399;&#24120;&#12395;&#23436;&#20840;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21066;&#38500;&#12375;(&#19968;&#24230;&#12398;<tt class="literal">DELETE</tt>&#12391;)&#12289;&#12418;&#12358;&#19968;&#24230;&#20316;&#25104;&#12375;&#12394;&#12362;&#12377;&#12371;&#12392;&#12391;&#35299;&#27770;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12428;&#12399;&#38750;&#24120;&#12395;&#38750;&#21177;&#29575;&#12391;&#12377;&#12290; 
            </p><p>
                one-to-many&#38306;&#36899;&#12395;&#12392;&#12387;&#12390;&#12289;&#12300;&#20027;&#12461;&#12540;&#12301;&#12364;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12486;&#12540;&#12502;&#12523;&#12398;&#29289;&#29702;&#30340;&#12394;&#20027;&#12461;&#12540;&#12391;&#12399;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12375;&#12363;&#12375;&#12371;&#12398;&#12465;&#12540;&#12473;&#12391;&#12399;&#20197;&#19978;&#12398;&#20998;&#39006;&#12399;&#12414;&#12384;&#26377;&#29992;&#12391;&#12377;&#12290;&#65288;&#12371;&#12398;&#20998;&#39006;&#12399;&#12289;&#12414;&#12384;Hibernate&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#20491;&#21029;&#12398;&#34892;&#12434;&#12300;&#26908;&#32034;&#12301;&#12375;&#12390;&#12356;&#12427;&#12363;&#12434;&#21453;&#26144;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#65289;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="performance-collections-mostefficientupdate"></a>14.1.2. &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#26356;&#26032;&#12395;&#26368;&#12418;&#21177;&#29575;&#30340;&#12394;list&#12289;map&#12289;set</h3></div></div><div></div></div><p>
                &#19978;&#12391;&#12398;&#35696;&#35542;&#12363;&#12425;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20184;&#12365;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;(&#22823;&#25269;&#12399;)set&#12364;&#35201;&#32032;&#12398;&#36861;&#21152;&#12289;&#21066;&#38500;&#12289;&#26356;&#26032;&#12394;&#12393;&#12398;&#25805;&#20316;&#12434;&#26368;&#12418;&#21177;&#29575;&#30340;&#12395;&#34892;&#12358;&#12371;&#12392;&#12399;&#26126;&#12425;&#12363;&#12391;&#12377;&#12290;
            </p><p>
                &#12414;&#12378;&#38291;&#36949;&#12356;&#12394;&#12367;&#12289;many-to-many&#38306;&#36899;&#12420;&#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#12362;&#12356;&#12390;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#20184;&#12365;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;<tt class="literal">Set</tt>&#12395;&#23550;&#12377;&#12427;&#12450;&#12489;&#12496;&#12531;&#12486;&#12540;&#12472;&#12364;&#65297;&#12388;&#20197;&#19978;&#12354;&#12426;&#12414;&#12377;&#12290;<tt class="literal">Set</tt>&#12399;&#12381;&#12398;&#27083;&#36896;&#12398;&#12383;&#12417;&#12289;&#35201;&#32032;&#12364;&#12300;&#22793;&#26356;&#12301;&#12373;&#12428;&#12383;&#12392;&#12365;Hibernate&#12399;&#27770;&#12375;&#12390;&#34892;&#12434;<tt class="literal">UPDATE</tt>&#12375;&#12414;&#12379;&#12435;&#12290;set&#12408;&#12398;&#22793;&#26356;&#12399;&#24517;&#12378;(&#20491;&#21029;&#12398;&#34892;&#12395;&#23550;&#12377;&#12427;)<tt class="literal">INSERT</tt> &#12392; <tt class="literal">DELETE</tt>&#12434;&#36890;&#12375;&#12390;&#34892;&#12431;&#12428;&#12414;&#12377;&#12290;&#32368;&#12426;&#36820;&#12375;&#12395;&#12394;&#12426;&#12414;&#12377;&#12364;&#12289;&#12371;&#12428;&#12399;one-to-many&#38306;&#36899;&#12395;&#12399;&#24403;&#12390;&#12399;&#12414;&#12426;&#12414;&#12379;&#12435;&#12290;
            </p><p>
                &#37197;&#21015;&#12364;lazy&#12391;&#12399;&#12356;&#12369;&#12394;&#12356;&#12392;&#12356;&#12358;&#27770;&#12414;&#12426;&#12394;&#12398;&#12391;&#12289;list&#12289;map&#12289;set&#12364;&#26368;&#12418;&#21177;&#29575;&#12398;&#33391;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#22411;&#12391;&#12354;&#12427;&#12392;&#32080;&#35542;&#20184;&#12369;&#12427;&#12391;&#12375;&#12423;&#12358;(set&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12399;&#21177;&#29575;&#30340;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12364;)&#12290;
            </p><p>
                Hibernate&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12289;set&#12399;&#26368;&#12418;&#19968;&#33324;&#30340;&#12394;&#31278;&#39006;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12391;&#12354;&#12427;&#12392;&#24605;&#12431;&#12428;&#12414;&#12377;&#12290;
            </p><p>
                <span class="emphasis"><em>&#20170;&#22238;&#12398;&#12522;&#12522;&#12540;&#12473;&#12391;&#12399;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#29305;&#24500;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
<tt class="literal">&lt;idbag&gt;</tt>&#12434;&#20351;&#12387;&#12383;&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#20516;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;many-to-many&#38306;&#36899;&#12398;&#12383;&#12417;&#12398;bag&#12475;&#12510;&#12531;&#12486;&#12451;&#12463;&#12473;&#12398;&#23455;&#35013;&#12391;&#12354;&#12426;&#12289;&#12371;&#12398;&#12465;&#12540;&#12473;&#12395;&#12362;&#12356;&#12390;&#12399;&#20182;&#12398;&#12393;&#12398;&#12473;&#12479;&#12452;&#12523;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12424;&#12426;&#12418;&#21177;&#29575;&#30340;&#12391;&#12377;&#65281;</em></span>
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="performance-collections-mostefficentinverse"></a>14.1.3. &#12452;&#12531;&#12496;&#12540;&#12473;&#65381;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#26368;&#12418;&#21177;&#29575;&#30340;&#12394;bag&#12392;list</h3></div></div><div></div></div><p>
                bag&#12434;&#35211;&#25918;&#12375;&#12390;&#12375;&#12414;&#12358;&#21069;&#12395;&#12289;bag&#65288;&#12381;&#12375;&#12390;list&#65289;&#12364;set&#12424;&#12426;&#12378;&#12387;&#12392;&#21177;&#29575;&#30340;&#12391;&#12354;&#12427;&#29305;&#21029;&#12394;&#12465;&#12540;&#12473;&#12434;&#12372;&#32057;&#20171;&#12375;&#12414;&#12377;&#12290;<tt class="literal">inverse="true"</tt>&#12391;&#12354;&#12427;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;(&#20363;&#12360;&#12400;&#12289;&#26222;&#36890;&#12398;one-to-many&#21452;&#26041;&#21521;&#38306;&#36899;)&#12289;&#21021;&#26399;&#21270;&#65288;&#12501;&#12455;&#12483;&#12481;&#65289;&#12398;
&#24517;&#35201;&#12394;&#12375;&#12395;bag&#12414;&#12383;&#12399;list&#12395;&#35201;&#32032;&#12434;&#36861;&#21152;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#65281;&#12371;&#12428;&#12399;<tt class="literal">Collection.add()</tt> &#12420; <tt class="literal">Collection.addAll()</tt>&#12364;<tt class="literal">Set</tt>&#12392;&#12399;&#36949;&#12387;&#12390;&#12289;bag&#12414;&#12383;&#12399;<tt class="literal">List</tt>&#12395;&#12399;&#24517;&#12378;true&#12434;&#36820;&#12373;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;
&#12363;&#12425;&#12391;&#12377;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12424;&#12367;&#12354;&#12427;&#12467;&#12540;&#12489;&#12364;&#38750;&#24120;&#12395;&#39640;&#36895;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
            </p><pre class="programlisting">Parent p = (Parent) sess.load(Parent.class, id);
    Child c = new Child();
    c.setParent(p);
    p.getChildren().add(c);  //&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#12501;&#12455;&#12483;&#12481;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#65281;
    sess.flush();</pre></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="performance-collections-oneshotdelete"></a>14.1.4. &#19968;&#25324;&#21066;&#38500;</h3></div></div><div></div></div><p>
                &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#35201;&#32032;&#12434;&#19968;&#12388;&#19968;&#12388;&#21066;&#38500;&#12377;&#12427;&#12398;&#12364;&#26997;&#12417;&#12390;&#38750;&#21177;&#29575;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;Hibernate&#12399;&#20840;&#12367;&#12398;&#24858;&#12363;&#32773;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12363;&#12425;&#12289;&#26032;&#12375;&#12356;&#31354;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12465;&#12540;&#12473;&#65288;&#20363;&#12360;&#12400;<tt class="literal">list.clear()</tt>&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#12465;&#12540;&#12473;&#65289;&#12391;&#12399;&#19968;&#12388;&#19968;&#12388;&#12398;&#35201;&#32032;&#12434;&#21066;&#38500;&#12377;&#12409;&#12365;&#12391;&#12394;&#12356;&#12392;&#12431;&#12363;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12398;&#12465;&#12540;&#12473;&#12391;&#12399;&#12289;Hibernate&#12399;<tt class="literal">DELETE</tt>&#12434;&#19968;&#24230;&#12384;&#12369;&#30330;&#34892;&#12375;&#12289;&#12381;&#12428;&#12391;&#12377;&#12409;&#12390;&#28168;&#12415;&#12414;&#12377;&#65281;
            </p><p>
                &#12469;&#12452;&#12474;&#12364;20&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;1&#12388;&#35201;&#32032;&#12434;&#36861;&#21152;&#12375;&#12289;&#12381;&#12375;&#12390;2&#12388;&#35201;&#32032;&#12434;&#21066;&#38500;&#12377;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;Hibernate&#12399;<tt class="literal">INSERT</tt>&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12434;1&#12388;&#12392;<tt class="literal">DELETE</tt>&#12473;&#12486;&#12540;&#12488;&#12513;&#12531;&#12488;&#12434;2&#12388;&#30330;&#34892;&#12375;&#12414;&#12377;&#65288;&#12418;&#12375;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12364;bag&#12391;&#12394;&#12369;&#12428;&#12400;&#65289;&#12290;&#12371;&#12428;&#12399;&#30906;&#12363;&#12395;&#26395;&#12414;&#12375;&#12356;&#21205;&#20316;&#12391;&#12377;&#12290;
            </p><p>
                &#12375;&#12363;&#12375;&#12289;2&#12388;&#12398;&#35201;&#32032;&#12434;&#27531;&#12375;&#12390;18&#20491;&#12434;&#21066;&#38500;&#12375;&#12289;&#12381;&#12428;&#12363;&#12425;&#26032;&#12375;&#12356;&#35201;&#32032;&#12434;3&#12388;&#36861;&#21152;&#12377;&#12427;&#12392;&#12375;&#12414;&#12377;&#12290;&#12371;&#12398;&#22580;&#21512;2&#12388;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12360;&#12414;&#12377;&#12290;
            </p><div class="itemizedlist"><ul type="disc"><li><p>1&#12378;&#12388;18&#20491;&#12398;&#34892;&#12434;&#21066;&#38500;&#12375;&#12289;&#12381;&#12375;&#12390;3&#12388;&#12398;&#34892;&#12434;&#25407;&#20837;&#12377;&#12427;&#12290;</p></li><li><p>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#20840;&#20307;&#12434;&#21066;&#38500;&#12375;&#65288;&#19968;&#12388;&#12398;SQL <tt class="literal">DELETE</tt>&#12391;&#65289;&#12289;&#12381;&#12375;&#12390;5&#12388;&#12398;&#35201;&#32032;&#12434;&#12377;&#12409;&#12390;&#65288;&#19968;&#12388;&#19968;&#12388;&#65289;&#25407;&#20837;&#12377;&#12427;&#12290;</p></li></ul></div><p>
                &#12371;&#12398;&#12465;&#12540;&#12473;&#12395;&#12362;&#12356;&#12390;&#12362;&#12381;&#12425;&#12367;2&#30058;&#30446;&#12398;&#26041;&#27861;&#12398;&#26041;&#12364;&#39640;&#36895;&#12384;&#12429;&#12358;&#12392;&#12431;&#12363;&#12427;&#12411;&#12393;&#12289;Hibernate&#12399;&#36066;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;(&#12381;&#12375;&#12390;&#24656;&#12425;&#12367;&#12289;Hibernate&#12364;&#12381;&#12398;&#12424;&#12358;&#12395;&#36066;&#12356;&#12398;&#12399;&#26395;&#12414;&#12375;&#12356;&#12371;&#12392;&#12391;&#12399;&#12394;&#12356;&#12391;&#12375;&#12423;&#12358;&#12290;&#20363;&#12360;&#12400;&#12289;&#12381;&#12398;&#12424;&#12358;&#12394;&#25391;&#12427;&#33310;&#12356;&#12391;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12488;&#12522;&#12460;&#12364;&#28151;&#20081;&#12375;&#12390;&#12375;&#12414;&#12358;&#12394;&#12393;&#12392;&#12356;&#12358;&#12371;&#12392;&#12364;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;)&#12290;
            </p><p>
                &#24184;&#12356;&#20803;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#25448;&#12390;&#65288;&#12388;&#12414;&#12426;&#21442;&#29031;&#12434;&#12420;&#12417;&#12427;&#65289;&#12289;&#29694;&#22312;&#12398;&#35201;&#32032;&#12377;&#12409;&#12390;&#25345;&#12388;&#12424;&#12358;&#12394;&#26032;&#12375;&#12367;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12375;&#12383;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#36820;&#12377;&#12371;&#12392;&#12391;&#12289;&#12356;&#12388;&#12391;&#12418;&#12371;&#12398;&#25391;&#12427;&#33310;&#12356;(&#12388;&#12414;&#12426;2&#30058;&#30446;&#12398;&#25126;&#30053;)&#12434;&#24375;&#21046;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#26178;&#12395;&#12371;&#12428;&#12399;&#38750;&#24120;&#12395;&#26377;&#29992;&#12391;&#24375;&#21147;&#12394;&#26041;&#27861;&#12392;&#12394;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
            </p></div></div><p>
        &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12395;&#12388;&#12356;&#12390;&#12398;&#31456;&#12391;&#12289;&#27704;&#32154;&#24615;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12393;&#12398;&#12424;&#12358;&#12395;lazy&#21021;&#26399;&#21270;&#12434;&#20351;&#29992;&#12391;&#12365;&#12427;&#12363;&#35500;&#26126;&#12375;&#12414;&#12375;&#12383;&#12290;CGLIB&#12434;&#20351;&#29992;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#36890;&#24120;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#21442;&#29031;&#12395;&#23550;&#12375;&#12390;&#12418;&#21516;&#27096;&#12398;&#21177;&#26524;&#12434;&#24471;&#12427;&#12371;&#12392;&#12364;&#20986;&#26469;&#12414;&#12377;&#12290;&#12414;&#12383;&#12289;<tt class="literal">Session</tt>&#12524;&#12505;&#12523;&#12391;Hibernate&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12377;&#12427;&#12363;&#12395;&#12388;&#12356;&#12390;&#12418;&#35328;&#21450;&#12375;&#12414;&#12375;&#12383;&#12290;&#12424;&#12426;&#31309;&#26997;&#30340;&#12394;&#12461;&#12515;&#12483;&#12471;&#12517;&#25126;&#30053;&#12399;class-by-class&#25126;&#30053;&#12395;&#22522;&#12389;&#12356;&#12383;&#35373;&#23450;&#12364;&#21487;&#33021;&#12391;&#12377;
    </p><p>
        &#27425;&#12398;&#31680;&#12391;&#12289;&#24517;&#35201;&#12395;&#24540;&#12376;&#12390;&#12424;&#12426;&#39640;&#12356;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12434;&#36948;&#25104;&#12377;&#12427;&#12383;&#12417;&#12398;&#27231;&#33021;&#12398;&#20351;&#12356;&#26041;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
    </p><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="performance-proxies"></a>14.2. lazy&#21021;&#26399;&#21270;&#12398;&#12383;&#12417;&#12398;&#12503;&#12525;&#12461;&#12471;</h2></div></div><div></div></div><p>
            Hibernate&#12399;&#23455;&#34892;&#26178;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#12456;&#12531;&#12495;&#12531;&#12473;&#12513;&#12531;&#12488;&#12434;&#20351;&#12356;&#12289;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;lazy&#21021;&#26399;&#21270;&#12503;&#12525;&#12461;&#12471;&#12434;&#23455;&#35013;&#12375;&#12390;&#12356;&#12414;&#12377;(CGLIB&#12392;&#12356;&#12358;&#32032;&#26228;&#12425;&#12375;&#12356;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#20351;&#29992;&#12375;&#12390;&#12356;&#12414;&#12377;)&#12290;
        </p><p>
            &#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12501;&#12449;&#12452;&#12523;&#12391;&#12289;&#12381;&#12398;&#12463;&#12521;&#12473;&#12398;&#12503;&#12525;&#12461;&#12471;&#65381;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12392;&#12375;&#12390;&#12463;&#12521;&#12473;&#12420;&#12452;&#12531;&#12479;&#12501;&#12455;&#12540;&#12473;&#12434;&#23450;&#32681;&#12375;&#12414;&#12377;&#12290;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12289;&#12463;&#12521;&#12473;&#33258;&#36523;&#12434;&#25351;&#23450;&#12377;&#12427;&#12398;&#12364;&#12362;&#21223;&#12417;&#12398;&#26041;&#27861;&#12391;&#12377;&#65306;
        </p><pre class="programlisting">&lt;class name="eg.Order" proxy="eg.Order"&gt;</pre><p>
            &#12503;&#12525;&#12461;&#12471;&#12398;&#23455;&#34892;&#26178;&#12398;&#22411;&#12399;<tt class="literal">Order</tt>&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12503;&#12525;&#12461;&#12471;&#12392;&#12375;&#12390;&#25351;&#23450;&#12377;&#12427;&#12463;&#12521;&#12473;&#12399;&#12289;&#23569;&#12394;&#12367;&#12392;&#12418;&#12497;&#12483;&#12465;&#12540;&#12472;&#12524;&#12505;&#12523;&#12398;&#21487;&#35222;&#24615;&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#65381;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12434;&#23455;&#35013;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><p>
            &#12371;&#12398;&#12450;&#12503;&#12525;&#12540;&#12481;&#12434;&#12509;&#12522;&#12514;&#12540;&#12501;&#12451;&#12483;&#12463;&#12394;&#12463;&#12521;&#12473;&#12395;&#25313;&#24373;&#12377;&#12427;&#12392;&#12365;&#27671;&#12434;&#12388;&#12369;&#12427;&#12409;&#12365;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">&lt;class name="eg.Cat" proxy="eg.Cat"&gt;
    ......
    &lt;subclass name="eg.DomesticCat" proxy="eg.DomesticCat"&gt;
        .....
    &lt;/subclass&gt;
&lt;/class&gt;</pre><p>
            &#12414;&#12378;&#21021;&#12417;&#12395;&#12289;<tt class="literal">Cat</tt>&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;<tt class="literal">DomesticCat</tt>&#12395;&#12461;&#12515;&#12473;&#12488;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;&#12383;&#12392;&#12360;&#22522;&#12392;&#12394;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;<tt class="literal">DomesticCat</tt>&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12384;&#12392;&#12375;&#12390;&#12418;&#12391;&#12377;&#12290;
        </p><pre class="programlisting">Cat cat = (Cat) session.load(Cat.class, id);  // instantiate a proxy (does not hit the db)
if ( cat.isDomesticCat() ) {                  // &#12503;&#12525;&#12461;&#12471;&#12434;&#21021;&#26399;&#21270;&#12377;&#12427;&#12383;&#12417;&#12395;db&#12434;&#12498;&#12483;&#12488;&#12375;&#12414;&#12377;
    DomesticCat dc = (DomesticCat) cat;       // &#12456;&#12521;&#12540;&#65281;
    ....
}</pre><p>
            &#65298;&#30058;&#30446;&#12395;&#12289; <tt class="literal">==</tt> &#12364;&#25104;&#31435;&#12375;&#12394;&#12356;&#21487;&#33021;&#24615;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">
Cat cat = (Cat) session.load(Cat.class, id);            // Cat&#12503;&#12525;&#12461;&#12471;&#12398;&#21021;&#26399;&#21270;
DomesticCat dc = 
    (DomesticCat) session.load(DomesticCat.class, id);  // &#26032;&#12375;&#12356;DomesticCat&#12434;&#35201;&#27714;!
System.out.println(cat==dc);                            // false</pre><p>
            &#12375;&#12363;&#12375;&#12289;&#12371;&#12428;&#12399;&#35211;&#12363;&#12369;&#12411;&#12393;&#24746;&#12356;&#29366;&#27841;&#12392;&#12356;&#12358;&#12431;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12289;&#12383;&#12392;&#12360;&#30064;&#12394;&#12387;&#12383;&#12503;&#12525;&#12461;&#12471;&#65381;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#20108;&#12388;&#12398;&#21442;&#29031;&#12364;&#12354;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#12289;&#22522;&#12392;&#12394;&#12427;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#21516;&#12376;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#65306;
        </p><pre class="programlisting">cat.setWeight(11.0);  // &#12503;&#12525;&#12461;&#12471;&#12434;&#21021;&#26399;&#21270;&#12377;&#12427;&#12383;&#12417;&#12395;db&#12434;&#12498;&#12483;&#12488;&#12375;&#12414;&#12377;
System.out.println( dc.getWeight() );  // 11.0</pre><p>
            3&#30058;&#30446;&#12395;&#12289;<tt class="literal">final</tt>&#12463;&#12521;&#12473;&#12420;<tt class="literal">final</tt>&#12513;&#12477;&#12483;&#12489;&#12434;&#25345;&#12388;&#12463;&#12521;&#12473;&#12395;CGLIB&#12503;&#12525;&#12461;&#12471;&#12434;&#20351;&#12360;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            &#26368;&#24460;&#12395;&#12289;&#12418;&#12375;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#26178;&#12395;&#12522;&#12477;&#12540;&#12473;&#12364;&#24517;&#35201;&#12392;&#12394;&#12427;&#12394;&#12425;(&#20363;&#12360;&#12400;&#12289;&#12452;&#12491;&#12471;&#12515;&#12521;&#12452;&#12470;&#12420;&#12487;&#12501;&#12457;&#12523;&#65381;&#12488;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#20869;&#12391;)&#12289;&#12381;&#12398;&#12522;&#12477;&#12540;&#12473;&#12418;&#12414;&#12383;&#12503;&#12525;&#12461;&#12471;&#12434;&#36890;&#12375;&#12390;&#21462;&#24471;&#12373;&#12428;&#12414;&#12377;&#12290;&#23455;&#38555;&#12399;&#12289;&#12381;&#12398;&#12503;&#12525;&#12461;&#12471;&#12463;&#12521;&#12473;&#12399;&#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12469;&#12502;&#12463;&#12521;&#12473;&#12391;&#12377;&#12290;
        </p><p>
            &#12371;&#12428;&#12425;&#12398;&#21839;&#38988;&#12399;Java&#12398;&#21336;&#19968;&#32153;&#25215;&#12514;&#12487;&#12523;&#12398;&#21407;&#29702;&#19978;&#12398;&#21046;&#38480;&#12398;&#12383;&#12417;&#12391;&#12377;&#12290;&#12418;&#12375;&#12371;&#12428;&#12425;&#12398;&#21839;&#38988;&#12434;&#36991;&#12369;&#12383;&#12356;&#12398;&#12394;&#12425;&#12289;&#27704;&#32154;&#12463;&#12521;&#12473;&#12402;&#12392;&#12388;&#12402;&#12392;&#12388;&#12395;&#12289;&#12499;&#12472;&#12493;&#12473;&#65381;&#12513;&#12477;&#12483;&#12489;&#12434;&#23450;&#32681;&#12375;&#12383;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12373;&#12379;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12381;&#12375;&#12390;&#12371;&#12428;&#12425;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12501;&#12449;&#12452;&#12523;&#12391;&#12503;&#12525;&#12461;&#12471;&#12392;&#12375;&#12390;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#65306;
        </p><pre class="programlisting">&lt;class name="eg.Cat" proxy="eg.ICat"&gt;
    ......
    &lt;subclass name="eg.DomesticCat" proxy="eg.IDomesticCat"&gt;
        .....
    &lt;/subclass&gt;
&lt;/class&gt;</pre><p>
            <tt class="literal">Cat</tt>&#12399;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;<tt class="literal">ICat</tt>&#12434;&#12289;<tt class="literal">DomesticCat</tt>&#12399;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;<tt class="literal">IDomesticCat</tt>&#12434;&#23455;&#35013;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#38555;&#12289;<tt class="literal">Cat</tt>&#12392;<tt class="literal">DomesticCat</tt>&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;<tt class="literal">load()</tt> &#12420; <tt class="literal">iterate()</tt>&#12395;&#12424;&#12387;&#12390;&#36820;&#12373;&#12428;&#12414;&#12377;(<tt class="literal">find()</tt>&#12399;&#12503;&#12525;&#12461;&#12471;&#12434;&#36820;&#12373;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;)&#12290;
        </p><pre class="programlisting">ICat cat = (ICat) session.load(Cat.class, catid);
Iterator iter = session.iterate("from cat in class eg.Cat where cat.name='fritz'");
ICat fritz = (ICat) iter.next();</pre><p>
           &#38306;&#20418;&#12418;&#12414;&#12383;lazy&#12395;&#21021;&#26399;&#21270;&#12373;&#12428;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;<tt class="literal">Cat</tt>&#12391;&#12399;&#12394;&#12367; <tt class="literal">ICat</tt>&#22411;&#12391;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
        </p><p>
            &#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#12503;&#12525;&#12461;&#12471;&#12398;&#21021;&#26399;&#21270;&#12434;<span class="emphasis"><em>&#24517;&#35201;&#12392;&#12375;&#12394;&#12356;</em></span>&#25805;&#20316;&#12418;&#23384;&#22312;&#12375;&#12414;&#12377;&#12290;
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    &#27704;&#32154;&#12463;&#12521;&#12473;&#12364;<tt class="literal">equals()</tt>&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12394;&#12356;&#12392;&#12365;&#12398;<tt class="literal">equals()</tt>&#12290;                </p></li><li><p>
                    &#27704;&#32154;&#12463;&#12521;&#12473;&#12364;<tt class="literal">hashCode()</tt>&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12394;&#12356;&#12392;&#12365;&#12398;<tt class="literal">hashCode()</tt>
                </p></li><li><p>
                    &#35672;&#21029;&#23376;&#12398;getter&#12513;&#12477;&#12483;&#12489;
                </p></li></ul></div><p>
            Hibernate&#12399;<tt class="literal">equals()</tt> &#12420;
            <tt class="literal">hashCode()</tt>&#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12377;&#12427;&#27704;&#32154;&#12463;&#12521;&#12473;&#12434;&#26908;&#30693;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            &#12503;&#12525;&#12461;&#12471;&#12434;&#21021;&#26399;&#21270;&#12377;&#12427;&#12392;&#12365;&#12395;&#30330;&#29983;&#12377;&#12427;&#20363;&#22806;&#12399;<tt class="literal">LazyInitializationException</tt>&#12391;&#12521;&#12483;&#12503;&#12373;&#12428;&#12414;&#12377;
        </p><p>
            <tt class="literal">Session</tt>&#12434;&#12463;&#12525;&#12540;&#12474;&#12377;&#12427;&#21069;&#12395;&#12289;&#30906;&#23455;&#12395;&#12503;&#12525;&#12461;&#12471;&#12420;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21021;&#26399;&#21270;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12394;&#12356;&#12392;&#12365;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12418;&#12385;&#12429;&#12435;&#12289;&#20363;&#12360;&#12400;<tt class="literal">cat.getSex()</tt> &#12420; <tt class="literal">cat.getKittens().size()</tt>&#12434;&#12467;&#12540;&#12523;&#12375;&#12390;&#12289;&#24375;&#21046;&#30340;&#12395;&#21021;&#26399;&#21270;&#12377;&#12427;&#12371;&#12392;&#12399;&#24120;&#12395;&#21487;&#33021;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12371;&#12428;&#12399;&#12477;&#12540;&#12473;&#12434;&#35501;&#12416;&#20154;&#12434;&#28151;&#20081;&#12373;&#12379;&#12414;&#12377;&#12375;&#12289;&#27726;&#29992;&#30340;&#12394;&#12467;&#12540;&#12489;&#12398;&#35251;&#28857;&#12363;&#12425;&#12418;&#19981;&#20415;&#12391;&#12377;&#12290;static&#12513;&#12477;&#12483;&#12489;&#12391;&#12354;&#12427;<tt class="literal">Hibernate.initialize()</tt> &#12392; <tt class="literal">Hibernate.isInitialized()</tt>&#12434;&#20351;&#12358;&#12392;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;lazy&#12395;&#21021;&#26399;&#21270;&#12373;&#12428;&#12383;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#12503;&#12525;&#12461;&#12471;&#12434;&#20415;&#21033;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;<tt class="literal">Hibernate.initialize(cat)</tt>&#12399;<tt class="literal">Session</tt>&#12364;&#12458;&#12540;&#12503;&#12531;&#12391;&#12354;&#12427;&#38480;&#12426;&#12289;<tt class="literal">cat</tt>&#12503;&#12525;&#12461;&#12471;&#12434;&#24375;&#21046;&#30340;&#12395;&#21021;&#26399;&#21270;&#12375;&#12414;&#12377;&#12290;<tt class="literal">Hibernate.initialize( cat.getKittens() )</tt>&#12399;kitten&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#21516;&#27096;&#12398;&#21177;&#26524;&#12434;&#25345;&#12385;&#12414;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="performance-batchfetching"></a>14.3. &#12496;&#12483;&#12481;&#65381;&#12501;&#12455;&#12483;&#12481;&#12531;&#12464;&#12398;&#20351;&#29992;</h2></div></div><div></div></div><p>
            Hibernate&#12391;&#12399;&#12496;&#12483;&#12481;&#65381;&#12501;&#12455;&#12483;&#12481;&#12531;&#12464;&#12434;&#21177;&#29575;&#30340;&#12395;&#20351;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;&#12377;&#12394;&#12431;&#12385;&#12289;1&#12388;&#12398;&#12503;&#12525;&#12461;&#12471;&#12364;&#12450;&#12463;&#12475;&#12473;&#12373;&#12428;&#12427;&#22580;&#21512;&#12289;Hibernate&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#21021;&#26399;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12461;&#12471;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12496;&#12483;&#12481;&#65381;&#12501;&#12455;&#12483;&#12481;&#12531;&#12464;&#12399;&#12524;&#12452;&#12472;&#12540;&#65381;&#12525;&#12540;&#12487;&#12451;&#12531;&#12464;&#25126;&#30053;&#12395;&#23550;&#12377;&#12427;&#26368;&#36969;&#21270;&#12391;&#12377;&#12290;&#12496;&#12483;&#12481;&#65381;&#12501;&#12455;&#12483;&#12481;&#12531;&#12464;&#12398;&#35519;&#25972;&#12395;&#12399;&#12463;&#12521;&#12473;&#65381;&#12524;&#12505;&#12523;&#12392;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65381;&#12524;&#12505;&#12523;&#12398;2&#12388;&#12398;&#26041;&#27861;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
            
        </p><p>
            &#12463;&#12521;&#12473;/&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12395;&#23550;&#12377;&#12427;&#12496;&#12483;&#12481;&#65381;&#12501;&#12455;&#12483;&#12481;&#12531;&#12464;&#12399;&#29702;&#35299;&#12375;&#12420;&#12377;&#12356;&#12391;&#12377;&#12290;&#23455;&#34892;&#26178;&#12395;&#20197;&#19979;&#12398;&#29366;&#27841;&#12395;&#12354;&#12427;&#12392;&#21109;&#36896;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#65306;<tt class="literal">Session</tt>&#12395;25&#12398;<tt class="literal">Cat</tt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12390;&#12289;&#12381;&#12428;&#12382;&#12428;&#12398;<tt class="literal">Cat</tt>&#12399;<tt class="literal">Person</tt>&#22411;&#12391;&#12354;&#12427;<tt class="literal">owner</tt>&#12408;&#12398;&#21442;&#29031;&#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;<tt class="literal">Person</tt>&#12463;&#12521;&#12473;&#12399;&#12503;&#12525;&#12461;&#12471;&#12395;&#12424;&#12426;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12390;&#12362;&#12426;&#12289;<tt class="literal">lazy="true"</tt>&#12391;&#12377;&#12290;&#12418;&#12375;&#12377;&#12409;&#12390;&#12398;cats&#12434;&#12452;&#12486;&#12524;&#12540;&#12488;&#12375;&#12381;&#12428;&#12382;&#12428;<tt class="literal">getOwner()</tt>&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#12394;&#12425;&#12400;&#12289;Hibernate&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12503;&#12525;&#12461;&#12471;&#12398;owners&#12434;&#35501;&#12415;&#20986;&#12377;&#12383;&#12417;&#12395;&#12289;25&#12398;<tt class="literal">SELECT</tt>&#25991;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;<tt class="literal">Person</tt>&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12398;<tt class="literal">batch-size</tt>&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12371;&#12398;&#25391;&#12427;&#33310;&#12356;&#12434;&#35519;&#25972;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;:
        </p><pre class="programlisting">&lt;class name="Person" lazy="true" batch-size="10"&gt;...&lt;/class&gt;</pre><p>
            Hibernate&#12399;&#12497;&#12479;&#12540;&#12531;&#12364;10&#12388;&#65292;10&#12388;&#65292;5&#12388;&#12391;&#12354;&#12427;&#12463;&#12456;&#12522;&#12434;3&#12388;&#12384;&#12369;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#26368;&#36969;&#21270;&#12395;&#38306;&#12377;&#12427;&#38480;&#12426;&#12289;&#12496;&#12483;&#12481;&#65381;&#12501;&#12455;&#12483;&#12481;&#12531;&#12464;&#12399;&#24403;&#12390;&#25512;&#37327;&#12391;&#12354;&#12426;&#12289;&#12381;&#12428;&#12399;&#29305;&#23450;&#12398;<tt class="literal">Session</tt>&#20013;&#12391;&#12398;&#21021;&#26399;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12503;&#12525;&#12461;&#12471;&#12398;&#25968;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12496;&#12483;&#12481;&#65381;&#12501;&#12455;&#12483;&#12481;&#12531;&#12464;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;&#20363;&#12360;&#12400;&#21508;<tt class="literal">Person</tt>&#12364;<tt class="literal">Cat</tt>&#12398;lazy&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#25345;&#12385;&#12289;&#29694;&#22312;10&#12398;<tt class="literal">Person</tt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;<tt class="literal">Session</tt>&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;&#12377;&#12409;&#12390;&#12398;<tt class="literal">Person</tt>&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12452;&#12486;&#12524;&#12540;&#12488;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;&#12377;&#12409;&#12390;&#12398;<tt class="literal">getCats()</tt>&#12467;&#12540;&#12523;&#12395;&#12388;&#12365;1&#12388;&#12289;&#35336;10&#12398;<tt class="literal">SELECT</tt>&#12364;&#30330;&#29983;&#12375;&#12414;&#12377;&#12290;&#12418;&#12375;<tt class="literal">Person</tt>&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12391;<tt class="literal">cats</tt>&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12496;&#12483;&#12481;&#65381;&#12501;&#12455;&#12483;&#12481;&#12531;&#12464;&#12398;&#25351;&#23450;&#12364;&#21487;&#33021;&#12394;&#12425;&#12400;&#12289;Hibernate&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12503;&#12522;&#65381;&#12501;&#12455;&#12483;&#12481;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;
            
        </p><pre class="programlisting">&lt;class name="Person"&gt;
    &lt;set name="cats" lazy="true" batch-size="3"&gt;
        ...
    &lt;/set&gt;
&lt;/class&gt;</pre><p>
            <tt class="literal">batch-size</tt>&#12364;3&#12394;&#12398;&#12391;&#12289;Hibernate&#12399;4&#22238;&#12398;<tt class="literal">SELECT</tt>&#25991;&#12391;3&#12388;&#65292;3&#12388;&#65292;3&#12388;&#65292;1&#12388;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#12381;&#12428;&#12382;&#12428;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;&#23646;&#24615;&#12398;&#20516;&#12399;&#29305;&#23450;&#12398;<tt class="literal">Session</tt>&#20013;&#12391;&#26399;&#24453;&#12373;&#12428;&#12427;&#21021;&#26399;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#25968;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            &#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12496;&#12483;&#12481;&#65381;&#12501;&#12455;&#12483;&#12481;&#12531;&#12464;&#12399;&#12289;&#12450;&#12452;&#12486;&#12512;&#12398;&#12493;&#12473;&#12488;&#12484;&#12522;&#12540;&#12398;&#22580;&#21512;&#12289;&#12388;&#12414;&#12426;&#20856;&#22411;&#30340;&#12394;bill-of-materials&#12497;&#12479;&#12540;&#12531;&#12398;&#22580;&#21512;&#12395;&#26377;&#29992;&#12391;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="performance-cache"></a>14.4. &#31532;2&#12524;&#12505;&#12523;&#65381;&#12461;&#12515;&#12483;&#12471;&#12517;</h2></div></div><div></div></div><p>
            Hibernate&#12398;<tt class="literal">Session</tt>&#12399;&#27704;&#32154;&#12487;&#12540;&#12479;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12524;&#12505;&#12523;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12391;&#12377;&#12290;class-by-class&#12392;collection-by-collection&#12372;&#12392;&#12398;&#12289;&#12463;&#12521;&#12473;&#12479;&#12524;&#12505;&#12523;&#12420;JVM&#12524;&#12505;&#12523;&#65288;<tt class="literal">SessionFactory</tt>&#12524;&#12505;&#12523;&#65289;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#21270;&#12373;&#12428;&#12383;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#12388;&#12394;&#12368;&#12371;&#12392;&#12373;&#12360;&#21487;&#33021;&#12391;&#12377;&#12290;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399;&#20182;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12424;&#12387;&#12390;&#27704;&#32154;&#12473;&#12488;&#12450;&#12395;&#21152;&#12360;&#12425;&#12428;&#12383;&#22793;&#26356;&#12399;&#32771;&#24942;&#12375;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;(&#12461;&#12515;&#12483;&#12471;&#12517;&#12487;&#12540;&#12479;&#12434;&#23450;&#26399;&#30340;&#12395;&#26399;&#38480;&#20999;&#12428;&#12395;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12377;)&#12290;
        </p><p>
            &#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12289;Hibernate&#12399;JVM&#12524;&#12505;&#12523;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;EHCache&#12434;&#20351;&#12356;&#12414;&#12377;(JCS&#12469;&#12509;&#12540;&#12488;&#12399;&#29694;&#22312;&#25512;&#22888;&#12373;&#12428;&#12390;&#12362;&#12425;&#12378;&#12289;Hibernate&#12398;&#23558;&#26469;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#21066;&#38500;&#12373;&#12428;&#12414;&#12377;)&#12290;<tt class="literal">hibernate.cache.provider_class</tt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#12356;&#12289;<tt class="literal">net.sf.hibernate.cache.CacheProvider</tt>&#12434;&#23455;&#35013;&#12375;&#12383;&#12463;&#12521;&#12473;&#12398;&#21517;&#21069;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#20182;&#12398;&#23455;&#35013;&#12434;&#36984;&#12406;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><div class="table"><a name="cacheproviders"></a><p class="title"><b>&#34920; 14.1. &#12461;&#12515;&#12483;&#12471;&#12517;&#65381;&#12503;&#12525;&#12496;&#12452;&#12480;</b></p><table summary="&#12461;&#12515;&#12483;&#12471;&#12517;&#65381;&#12503;&#12525;&#12496;&#12452;&#12480;" border="1"><colgroup><col align="left"><col align="left"><col align="left"><col align="left"><col align="left"></colgroup><thead><tr><th align="left">&#12461;&#12515;&#12483;&#12471;&#12517;</th><th align="left">&#12503;&#12525;&#12496;&#12452;&#12480;&#12463;&#12521;&#12473;</th><th align="left">&#12479;&#12452;&#12503;</th><th align="left">&#12463;&#12521;&#12473;&#12479;&#12475;&#12540;&#12501;</th><th align="left">&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#12469;&#12509;&#12540;&#12488;</th></tr></thead><tbody><tr><td align="left">Hashtable&#65288;&#35069;&#21697;&#29992;&#12392;&#12375;&#12390;&#24847;&#22259;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;&#65289;</td><td align="left"><tt class="literal">net.sf.hibernate.cache.HashtableCacheProvider</tt></td><td align="left">&#12513;&#12514;&#12522;</td><td align="left">&nbsp;</td><td align="left">yes</td></tr><tr><td align="left">EHCache</td><td align="left"><tt class="literal">net.sf.hibernate.cache.EhCacheProvider</tt></td><td align="left">&#12513;&#12514;&#12522;&#12289;&#12487;&#12451;&#12473;&#12463;</td><td align="left">&nbsp;</td><td align="left">yes</td></tr><tr><td align="left">OSCache</td><td align="left"><tt class="literal">net.sf.hibernate.cache.OSCacheProvider</tt></td><td align="left">&#12513;&#12514;&#12522;&#12289;&#12487;&#12451;&#12473;&#12463;</td><td align="left">&nbsp;</td><td align="left">yes</td></tr><tr><td align="left">SwarmCache</td><td align="left"><tt class="literal">net.sf.hibernate.cache.SwarmCacheProvider</tt></td><td align="left">&#12463;&#12521;&#12473;&#12479;(IP&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;)</td><td align="left">yes (clustered invalidation)</td><td align="left">&nbsp;</td></tr><tr><td align="left">JBoss TreeCache</td><td align="left"><tt class="literal">net.sf.hibernate.cache.TreeCacheProvider</tt></td><td align="left">&#12463;&#12521;&#12473;&#12479;(IP&#12510;&#12523;&#12481;&#12461;&#12515;&#12473;&#12488;), &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;</td><td align="left">yes (&#35079;&#35069;)</td><td align="left">yes (clock sync req.)</td></tr></tbody></table></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="performance-cache-mapping"></a>14.4.1. &#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</h3></div></div><div></div></div><p>
                &#12463;&#12521;&#12473;&#12414;&#12383;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;<tt class="literal">&lt;cache&gt;</tt>&#35201;&#32032;&#12399;&#20197;&#19979;&#12398;&#24418;&#24335;&#12391;&#12377;&#65306;
            </p><div class="programlistingco"><pre class="programlisting">&lt;cache 
    usage="transactional|read-write|nonstrict-read-write|read-only"  <span class="co">(1)</span>
/&gt;</pre><div class="calloutlist"><table border="0" summary="Callout list"><tr><td width="5%" valign="top" align="left">(1)</td><td valign="top" align="left"><p>
                            <tt class="literal">usage</tt> &#12399;&#12461;&#12515;&#12483;&#12471;&#12517;&#25126;&#30053;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#65306;
                            <tt class="literal">transactional</tt>,
                            <tt class="literal">read-write</tt>,
                            <tt class="literal">nonstrict-read-write</tt> &#12414;&#12383;&#12399;
                            <tt class="literal">read-only</tt>&#12391;&#12377;
                        </p></td></tr></table></div></div><p>
                &#12414;&#12383;&#12399;(&#12424;&#12426;&#33391;&#12356;&#26041;&#27861;&#12392;&#12375;&#12390;?)&#12289;<tt class="literal">&lt;class-cache&gt;</tt>&#12392;<tt class="literal">&lt;collection-cache&gt;</tt>&#35201;&#32032;&#12434;<tt class="literal">hibernate.cfg.xml</tt>&#12398;&#20013;&#12391;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
            </p><p>
                <tt class="literal">usage</tt>&#23646;&#24615;&#12399;<span class="emphasis"><em>cache concurrency strategy</em></span>&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="performance-cache-readonly"></a>14.4.2. &#25126;&#30053;: read only</h3></div></div><div></div></div><p>
                &#12418;&#12375;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12289;&#35501;&#12415;&#36796;&#12415;&#12399;&#12377;&#12427;&#12364;&#27770;&#12375;&#12390;&#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20462;&#27491;&#12375;&#12394;&#12356;&#12394;&#12425;&#12400;&#12289;<tt class="literal">read-only</tt>&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#26368;&#12418;&#21336;&#32020;&#12391;&#26368;&#12418;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12398;&#33391;&#12356;&#25126;&#30053;&#12391;&#12377;&#12290;&#12463;&#12521;&#12473;&#12479;&#12391;&#12398;&#20351;&#29992;&#12418;&#23436;&#20840;&#12395;&#23433;&#20840;&#12391;&#12377;&#12290;
            </p><pre class="programlisting">&lt;class name="eg.Immutable" mutable="false"&gt;
    &lt;cache usage="read-only"/&gt;
    ....
&lt;/class&gt;</pre></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="performance-cache-readwrite"></a>14.4.3. &#25126;&#30053;: read/write</h3></div></div><div></div></div><p>
                &#12418;&#12375;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12487;&#12540;&#12479;&#12434;&#26356;&#26032;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12427;&#12394;&#12425;&#12289;<tt class="literal">read-write</tt>&#12461;&#12515;&#12483;&#12471;&#12517;&#12364;&#36969;&#20999;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12371;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#25126;&#30053;&#12399;&#12289;&#12418;&#12375;serializable transaction isolation&#12524;&#12505;&#12523;&#12364;&#35201;&#27714;&#12373;&#12428;&#12427;&#12394;&#12425;&#12289;&#27770;&#12375;&#12390;&#20351;&#12358;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
&#12418;&#12375;JTA&#29872;&#22659;&#12391;&#12461;&#12515;&#12483;&#12471;&#12517;&#12364;&#20351;&#12431;&#12428;&#12427;&#12394;&#12425;&#12289;JTA&#12398;<tt class="literal">TransactionManager</tt>&#12434;&#21462;&#24471;&#12377;&#12427;&#25126;&#30053;&#12434;&#31034;&#12377;<tt class="literal">hibernate.transaction.manager_lookup_class</tt>&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#20182;&#12398;&#29872;&#22659;&#12391;&#12399;<tt class="literal">Session.close()</tt> &#12420; <tt class="literal">Session.disconnect()</tt>&#12364;&#12467;&#12540;&#12523;&#12373;&#12428;&#12383;&#12392;&#12365;&#12289;&#30906;&#23455;&#12395;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#23436;&#20102;&#12375;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12418;&#12375;&#12463;&#12521;&#12473;&#12479;&#12391;&#12371;&#12398;&#25126;&#30053;&#12434;&#20351;&#12356;&#12383;&#12356;&#12398;&#12394;&#12425;&#12289;&#22522;&#12392;&#12394;&#12427;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#23455;&#35013;&#12364;&#30906;&#23455;&#12395;&#12525;&#12483;&#12463;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#32068;&#12415;&#36796;&#12415;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#65381;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12371;&#12428;&#12434;<span class="emphasis"><em>&#12469;&#12509;&#12540;&#12488;&#12375;&#12414;&#12379;&#12435;</em></span>&#12290;
            </p><pre class="programlisting">&lt;class name="eg.Cat" .... &gt;
    &lt;cache usage="read-write"/&gt;
    ....
    &lt;set name="kittens" ... &gt;
        &lt;cache usage="read-write"/&gt;
        ....
    &lt;/set&gt;
&lt;/class&gt;</pre></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="performance-cache-nonstrict"></a>14.4.4. &#25126;&#30053;: 
nonstrict read/write</h3></div></div><div></div></div><p>
                &#12418;&#12375;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12383;&#12414;&#12395;&#12375;&#12363;&#12487;&#12540;&#12479;&#12398;&#26356;&#26032;&#12434;&#24517;&#35201;&#12392;&#12379;&#12378;(&#12388;&#12414;&#12426;&#12289;2&#12388;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#21516;&#26178;&#12395;&#21516;&#12376;item&#12434;&#26356;&#26032;&#12377;&#12427;&#12424;&#12358;&#12394;&#12371;&#12392;&#12364;&#12411;&#12392;&#12435;&#12393;&#36215;&#12365;&#12394;&#12356;)&#12289;&#21427;&#23494;&#12394;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#38548;&#38626;&#12364;&#35201;&#27714;&#12373;&#12428;&#12394;&#12356;&#12394;&#12425;&#12400;&#12289;<tt class="literal">nonstrict-read-write</tt>&#12461;&#12515;&#12483;&#12471;&#12517;&#12364;&#36969;&#24403;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;&#12418;&#12375;&#12461;&#12515;&#12483;&#12471;&#12517;&#12364;JTA&#29872;&#22659;&#12391;&#20351;&#12431;&#12428;&#12427;&#12394;&#12425;&#12289;<tt class="literal">hibernate.transaction.manager_lookup_class</tt>&#12434;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#20182;&#12398;&#29872;&#22659;&#12391;&#12399;<tt class="literal">Session.close()</tt> &#12420; <tt class="literal">Session.disconnect()</tt>&#12364;&#12467;&#12540;&#12523;&#12373;&#12428;&#12383;&#12392;&#12365;&#12289;&#30906;&#23455;&#12395;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;&#23436;&#20102;&#12375;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="performance-cache-transactional"></a>14.4.5. &#25126;&#30053;: transactional</h3></div></div><div></div></div><p>
                <tt class="literal">transactional</tt>&#12461;&#12515;&#12483;&#12471;&#12517;&#25126;&#30053;&#12399;JBoss&#12398;TreeCache&#12398;&#12424;&#12358;&#12394;&#12289;&#23436;&#20840;&#12395;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12490;&#12523;&#12394;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#12469;&#12509;&#12540;&#12488;&#12434;
&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#12424;&#12358;&#12394;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399;JTA&#29872;&#22659;&#12384;&#12369;&#12391;&#20351;&#29992;&#12373;&#12428;&#12289;<tt class="literal">hibernate.transaction.manager_lookup_class</tt>&#12434;&#25351;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
            </p></div><p>
            &#12377;&#12409;&#12390;&#12398;&#21516;&#26178;&#20006;&#34892;&#24615;&#12461;&#12515;&#12483;&#12471;&#12517;&#25126;&#30053;&#12434;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12427;&#12461;&#12515;&#12483;&#12471;&#12517;&#65381;&#12503;&#12525;&#12496;&#12452;&#12480;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;&#20197;&#19979;&#12398;&#12486;&#12540;&#12502;&#12523;&#12399;&#12393;&#12398;&#12503;&#12525;&#12496;&#12452;&#12480;&#12364;&#12393;&#12398;&#21516;&#26178;&#20006;&#34892;&#24615;&#25126;&#30053;&#12392;&#23550;&#24540;&#12377;&#12427;&#12363;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
        </p><div class="table"><a name="d0e9126"></a><p class="title"><b>&#34920; 14.2. &#21516;&#26178;&#20006;&#34892;&#24615;&#12461;&#12515;&#12483;&#12471;&#12517;&#25126;&#30053;&#12398;&#12469;&#12509;&#12540;&#12488;</b></p><table summary="&#21516;&#26178;&#20006;&#34892;&#24615;&#12461;&#12515;&#12483;&#12471;&#12517;&#25126;&#30053;&#12398;&#12469;&#12509;&#12540;&#12488;" border="1"><colgroup><col align="left"><col align="left"><col align="left"><col align="left"><col align="left"></colgroup><thead><tr><th align="left">Cache</th><th align="left">read-only</th><th align="left">nonstrict-read-write</th><th align="left">read-write</th><th align="left">transactional</th></tr></thead><tbody><tr><td align="left">Hashtable (&#35069;&#21697;&#29992;&#12392;&#12375;&#12390;&#24847;&#22259;&#12373;&#12428;&#12390;&#12356;&#12414;&#12379;&#12435;)</td><td align="left">yes</td><td align="left">yes</td><td align="left">yes</td><td align="left">&nbsp;</td></tr><tr><td align="left">EHCache</td><td align="left">yes</td><td align="left">yes</td><td align="left">yes</td><td align="left">&nbsp;</td></tr><tr><td align="left">OSCache</td><td align="left">yes</td><td align="left">yes</td><td align="left">yes</td><td align="left">&nbsp;</td></tr><tr><td align="left">SwarmCache</td><td align="left">yes</td><td align="left">yes</td><td align="left">&nbsp;</td><td align="left">&nbsp;</td></tr><tr><td align="left">JBoss TreeCache</td><td align="left">yes</td><td align="left">&nbsp;</td><td align="left">&nbsp;</td><td align="left">yes</td></tr></tbody></table></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="performance-sessioncache"></a>14.5. <tt class="literal">Session</tt>&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#21462;&#12426;&#25201;&#12356;</h2></div></div><div></div></div><p>
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;<tt class="literal">save()</tt>, <tt class="literal">update()</tt>
            &#12420; <tt class="literal">saveOrUpdate()</tt>&#12395;&#28193;&#12377;&#12392;&#12365;&#12289;&#12381;&#12375;&#12390;<tt class="literal">load()</tt>, <tt class="literal">find()</tt>, <tt class="literal">iterate()</tt>,
            &#12420; <tt class="literal">filter()</tt>&#12434;&#20351;&#12387;&#12390;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21462;&#12426;&#20986;&#12377;&#12392;&#12365;&#12399;&#12356;&#12388;&#12391;&#12418;&#12289;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;<tt class="literal">Session</tt>&#12398;&#20869;&#37096;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#36861;&#21152;&#12373;&#12428;&#12414;&#12377;&#12290;&#32154;&#12356;&#12390;<tt class="literal">flush()</tt>&#12364;&#12467;&#12540;&#12523;&#12373;&#12428;&#12427;&#12392;&#12365;&#12289;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#21516;&#26399;&#12373;&#12428;&#12414;&#12377;&#12290;
&#12418;&#12375;&#12371;&#12398;&#21516;&#26399;&#12434;&#26395;&#12414;&#12394;&#12363;&#12387;&#12383;&#12426;&#12289;&#33192;&#22823;&#12394;&#25968;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#20966;&#29702;&#12375;&#21177;&#29575;&#30340;&#12395;&#12513;&#12514;&#12522;&#12434;&#25201;&#12358;&#24517;&#35201;&#12364;&#12354;&#12427;&#12394;&#12425;&#12289;<tt class="literal">evict()</tt>&#12513;&#12477;&#12483;&#12489;&#12434;&#20351;&#12387;&#12390;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12420;&#12381;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#21066;&#38500;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">Iterator cats = sess.iterate("from eg.Cat as cat"); //&#24040;&#22823;&#12394;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;
while ( cats.hasNext() ) {
    Cat cat = (Cat) iter.next();
    doSomethingWithACat(cat);
    sess.evict(cat);
}</pre><p>
			&#12418;&#12375;&#38306;&#36899;&#12364;<tt class="literal">cascade="all"</tt> &#12420; <tt class="literal">cascade="all-delete-orphan"</tt>&#12391;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12390;&#12356;&#12427;&#12394;&#12425;&#12400;&#12289;Hibernate&#12399;&#38306;&#36899;&#12377;&#12427;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#33258;&#21205;&#30340;&#12395;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425;&#21066;&#38500;&#12375;&#12414;&#12377;&#12290;
		</p><p>
            <tt class="literal">Session</tt>&#12395;&#12399;&#12289;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12475;&#12483;&#12471;&#12519;&#12531;&#65381;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#21547;&#12414;&#12428;&#12427;&#12363;&#12393;&#12358;&#12363;&#12434;&#21028;&#26029;&#12377;&#12427;&#12383;&#12417;&#12398;<tt class="literal">contains()</tt>&#12513;&#12477;&#12483;&#12489;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
        </p><p>
            &#12475;&#12483;&#12471;&#12519;&#12531;&#65381;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425;&#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#23436;&#20840;&#12395;&#21462;&#12426;&#38500;&#12367;&#12383;&#12417;&#12395;&#12399;&#12289;<tt class="literal">Session.clear()</tt>&#12434;&#12467;&#12540;&#12523;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><p>
            &#31532;2&#12524;&#12505;&#12523;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#12383;&#12417;&#12395;&#12289;<tt class="literal">SessionFactory</tt>&#12395;&#12399;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12289;&#12463;&#12521;&#12473;&#20840;&#20307;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65381;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12414;&#12383;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#65381;&#12525;&#12540;&#12523;&#20840;&#20307;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425;&#21066;&#38500;&#12377;&#12427;&#12513;&#12477;&#12483;&#12489;&#12364;&#23450;&#32681;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="performance-querycache"></a>14.6. &#12463;&#12456;&#12522;&#65381;&#12461;&#12515;&#12483;&#12471;&#12517;</h2></div></div><div></div></div><p>
            &#12463;&#12456;&#12522;&#65381;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12418;&#12461;&#12515;&#12483;&#12471;&#12517;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#21516;&#12376;&#12497;&#12521;&#12513;&#12540;&#12479;&#12391;&#24230;&#12293;&#23455;&#34892;&#12373;&#12428;&#12427;&#12463;&#12456;&#12522;&#12395;&#12388;&#12356;&#12390;&#12398;&#12415;&#24441;&#31435;&#12385;&#12414;&#12377;&#12290;
&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20351;&#12358;&#12383;&#12417;&#12395;&#12399;&#12289;&#12414;&#12378;&#12503;&#12525;&#12497;&#12486;&#12451;<tt class="literal">hibernate.cache.use_query_cache=true</tt>&#12434;&#35373;&#23450;&#12375;&#12390;&#20351;&#29992;&#21487;&#33021;&#12395;&#12375;&#12390;&#12362;&#12363;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;&#12371;&#12428;&#12395;&#12424;&#12426;2&#12388;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#38936;&#22495;&#12364;&#20316;&#25104;&#12373;&#12428;&#12414;&#12377;&#12290;1&#12388;&#12399;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12383;&#12463;&#12456;&#12522;&#65381;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12434;&#20445;&#25345;&#12375;&#65288;<tt class="literal">net.sf.hibernate.cache.QueryCache</tt>&#65289;&#12289;&#12418;&#12358;1&#12388;&#12399;&#26368;&#26032;&#12398;&#12463;&#12456;&#12522;&#65381;&#12486;&#12540;&#12502;&#12523;&#12408;&#12398;&#26356;&#26032;&#12398;&#12479;&#12452;&#12512;&#12473;&#12479;&#12531;&#12503;&#12434;&#20445;&#25345;&#12377;&#12427;&#12418;&#12398;&#65288;<tt class="literal">net.sf.hibernate.cache.UpdateTimestampsCache</tt>&#65289;&#12391;&#12377;&#12290;&#12463;&#12456;&#12522;&#65381;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399;&#12522;&#12470;&#12523;&#12488;&#12475;&#12483;&#12488;&#12398;&#20013;&#12398;&#12393;&#12435;&#12394;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#29366;&#24907;&#12418;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12381;&#12428;&#12399;&#35672;&#21029;&#23376;
&#12398;&#20516;&#12392;&#12289;&#12496;&#12522;&#12517;&#12540;&#65381;&#12479;&#12452;&#12503;&#12398;&#32080;&#26524;&#12398;&#12415;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#12383;&#12417;&#12463;&#12456;&#12522;&#65381;&#12461;&#12515;&#12483;&#12471;&#12517;&#12399;&#36890;&#24120;&#12289;&#31532;2&#12524;&#12505;&#12523;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12392;&#19968;&#32210;&#12395;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;
        </p><p>
            &#12411;&#12392;&#12435;&#12393;&#12398;&#12463;&#12456;&#12522;&#12399;&#12461;&#12515;&#12483;&#12471;&#12517;&#12375;&#12390;&#12418;&#24847;&#21619;&#12364;&#12394;&#12356;&#12398;&#12391;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12399;&#12463;&#12456;&#12522;&#12399;&#12461;&#12515;&#12483;&#12471;&#12517;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#26377;&#21177;&#12395;&#12377;&#12427;&#12395;&#12399;&#12289;<tt class="literal">Query.setCacheable(true)</tt>&#12434;&#12467;&#12540;&#12523;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#12381;&#12358;&#12377;&#12428;&#12400;&#12463;&#12456;&#12522;&#12364;&#26082;&#23384;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#32080;&#26524;&#12434;&#35211;&#12388;&#12369;&#12289;&#23455;&#34892;&#26178;&#12395;&#12381;&#12398;&#32080;&#26524;&#12434;&#12461;&#12515;&#12483;&#12471;&#12517;&#12395;&#36861;&#21152;&#12377;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
        </p><p>
            &#12418;&#12375;&#12463;&#12456;&#12522;&#65381;&#12461;&#12515;&#12483;&#12471;&#12517;&#32066;&#20102;&#26041;&#37341;&#12398;&#31890;&#24230;&#12398;&#33391;&#12356;&#21046;&#24481;&#12434;&#24517;&#35201;&#12392;&#12377;&#12427;&#12394;&#12425;&#12289;<tt class="literal">Query.setCacheRegion()</tt>&#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12391;
&#29305;&#23450;&#12398;&#12463;&#12456;&#12522;&#12395;&#23550;&#12377;&#12427;&#12461;&#12515;&#12483;&#12471;&#12517;&#38936;&#22495;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">List blogs = sess.createQuery("from Blog blog where blog.blogger = :blogger")
    .setEntity("blogger", blogger)
    .setMaxResults(15)
    .setCacheable(true)
    .setCacheRegion("frontpages")
    .list();</pre><p>
            &#12418;&#12375;&#12463;&#12456;&#12522;&#12364;&#12381;&#12398;&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#31684;&#22258;&#12434;&#12522;&#12501;&#12524;&#12483;&#12471;&#12517;&#12373;&#12379;&#12427;&#12409;&#12365;&#12394;&#12425;&#12289;<tt class="literal">Query.setForceCacheRefresh()</tt>&#12434;&#12467;&#12540;&#12523;&#12375;&#12390;<tt class="literal">true</tt>&#12395;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#12371;&#12398;&#25805;&#20316;&#12399;&#29305;&#12395;&#12505;&#12540;&#12473;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#12487;&#12540;&#12479;&#12364;&#21029;&#12398;&#12503;&#12525;&#12475;&#12473;&#12395;&#12424;&#12387;&#12390;&#26356;&#26032;&#12373;&#12428;&#12427;&#12465;&#12540;&#12473;(&#12388;&#12414;&#12426;Hibernate&#12434;&#36890;&#12375;&#12383;&#20462;&#27491;&#12391;&#12399;&#28961;&#12356;&#12465;&#12540;&#12473;)&#12398;&#12392;&#12365;&#12395;&#26377;&#29992;&#12391;&#12354;&#12426;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12371;&#12428;&#12425;&#12398;&#12452;&#12505;&#12531;&#12488;&#12398;&#30693;&#35672;&#12434;&#12505;&#12540;&#12473;&#12395;&#12375;&#12390;&#36984;&#25246;&#30340;&#12395;&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#31684;&#22258;&#12434;&#12522;&#12501;&#12524;&#12483;&#12471;&#12517;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12463;&#12456;&#12522;&#12461;&#12515;&#12483;&#12471;&#12517;&#38936;&#22495;&#12398;evict&#12398;&#20195;&#26367;&#26041;&#27861;&#12391;&#12377;&#12290;&#12418;&#12375;&#12463;&#12456;&#12522;&#12395;&#23550;&#12375;&#12390;&#12365;&#12417;&#12398;&#32048;&#12363;&#12356;&#12522;&#12501;&#12524;&#12483;&#12471;&#12517;&#21046;&#24481;&#12364;&#24517;&#35201;&#12394;&#12425;&#12400;&#12289;&#20491;&#12293;&#12398;&#12463;&#12456;&#12522;&#12395;&#26032;&#12375;&#12356;&#38936;&#22495;&#21106;&#12426;&#24403;&#12390;&#12523;&#20195;&#12431;&#12426;&#12395;&#12371;&#12398;&#27231;&#33021;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="querysql.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="toolsetguide.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;13&#31456; &#12493;&#12452;&#12486;&#12451;&#12502;SQL&#12463;&#12456;&#12522;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;15&#31456; &#12484;&#12540;&#12523;&#12475;&#12483;&#12488;&#65381;&#12460;&#12452;&#12489;</td></tr></table></div></body></html>