<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;4&#31456; &#27704;&#32154;&#12463;&#12521;&#12473;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="session-configuration.html" title="&#31532;3&#31456; SessionFactory&#12398;&#35373;&#23450;"><link rel="next" href="mapping.html" title="&#31532;5&#31456; O/R&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#22522;&#26412;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;4&#31456; &#27704;&#32154;&#12463;&#12521;&#12473;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="session-configuration.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="mapping.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="persistent-classes"></a>&#31532;4&#31456; &#27704;&#32154;&#12463;&#12521;&#12473;</h2></div></div><div></div></div><p>
        &#27704;&#32154;&#12463;&#12521;&#12473;&#12399;&#12289;&#12499;&#12472;&#12493;&#12473;&#12398;&#21839;&#38988;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#23455;&#35013;&#12377;&#12427;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12463;&#12521;&#12473;&#12391;&#12377;
        &#65288;&#20363; E&#12467;&#12510;&#12540;&#12473;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#39015;&#23458;&#12420;&#27880;&#25991;&#65289;&#12290;
        &#21517;&#21069;&#12363;&#12425;&#12431;&#12363;&#12427;&#36890;&#12426;&#12289;&#27704;&#32154;&#12463;&#12521;&#12473;&#12399;&#19968;&#26178;&#30340;&#12394;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12289;
        &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#26684;&#32013;&#12373;&#12428;&#12427;&#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
    </p><p>
        &#12371;&#12398;&#12463;&#12521;&#12473;&#12364;&#12356;&#12367;&#12388;&#12363;&#12398;&#31777;&#21336;&#12394;&#12523;&#12540;&#12523;&#12434;&#23432;&#12428;&#12400;&#12289;Hibernate&#12399;&#26368;&#12418;&#33391;&#12367;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;
        &#12371;&#12428;&#12399;&#12503;&#12524;&#12540;&#12531;&#12398;&#21476;&#12356;Java&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65288;POJO&#65289;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12539;&#12514;&#12487;&#12523;&#12392;&#12375;&#12390;&#12418;&#30693;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
    </p><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-pojo"></a>4.1. &#31777;&#21336;&#12394;POJO&#12398;&#20363;</h2></div></div><div></div></div><p>
            &#12411;&#12392;&#12435;&#12393;&#12398;Java&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12399;&#12289;&#12493;&#12467;&#31185;&#12434;&#34920;&#12377;&#27704;&#32154;&#12463;&#12521;&#12473;&#12364;&#24517;&#35201;&#12391;&#12377;&#12290;
        </p><pre class="programlisting">package eg;
import java.util.Set;
import java.util.Date;

public class Cat {
    private Long id; // &#35672;&#21029;&#23376;
    private String name;
    private Date birthdate;
    private Cat mate;
    private Set kittens
    private Color color;
    private char sex;
    private float weight;

    private void setId(Long id) {
        this.id=id;
    }
    public Long getId() {
        return id;
    }

    void setName(String name) {
        this.name = name;
    }
    public String getName() {
        return name;
    }

    void setMate(Cat mate) {
        this.mate = mate;
    }
    public Cat getMate() {
        return mate;
    }

    void setBirthdate(Date date) {
        birthdate = date;
    }
    public Date getBirthdate() {
        return birthdate;
    }
    void setWeight(float weight) {
        this.weight = weight;
    }
    public float getWeight() {
        return weight;
    }

    public Color getColor() {
        return color;
    }
    void setColor(Color color) {
        this.color = color;
    }
    void setKittens(Set kittens) {
        this.kittens = kittens;
    }
    public Set getKittens() {
        return kittens;
    }
    // addKitten&#12399;&#12289;Hibernate&#12395;&#12392;&#12387;&#12390;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;
    public void addKitten(Cat kitten) {
        kittens.add(kitten);
    }
    void setSex(char sex) {
        this.sex=sex;
    }
    public char getSex() {
        return sex;
    }
}</pre><p>
            &#20197;&#19979;&#12395;&#23432;&#12427;&#12409;&#12365;4&#12388;&#12398;&#12523;&#12540;&#12523;&#12364;&#12354;&#12426;&#12414;&#12377;&#65306;
        </p><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="persistent-classes-pojo-accessors"></a>4.1.1. &#27704;&#32154;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#23550;&#12377;&#12427;&#12450;&#12463;&#12475;&#12469;&#12392;&#12511;&#12517;&#12540;&#12486;&#12540;&#12479;&#12434;&#23450;&#32681;&#12377;&#12427;</h3></div></div><div></div></div><p>
                <tt class="literal">Cat</tt> &#12399;&#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#23550;&#12377;&#12427;
                &#12450;&#12463;&#12475;&#12469;&#12539;&#12513;&#12477;&#12483;&#12489;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
                &#20182;&#12398;&#22810;&#12367;&#12398;ORM&#12484;&#12540;&#12523;&#12399;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#12434;&#30452;&#25509;&#27704;&#32154;&#21270;&#12375;&#12414;&#12377;&#12290;
                &#31169;&#12383;&#12385;&#12399;&#27704;&#32154;&#21270;&#27231;&#27083;&#12363;&#12425;&#23455;&#35013;&#12398;&#35443;&#32048;&#12434;&#20998;&#38626;&#12377;&#12427;&#26041;&#12364;&#12378;&#12387;&#12392;&#33391;&#12356;&#12371;&#12392;&#12384;&#12392;&#20449;&#12376;&#12390;&#12356;&#12414;&#12377;&#12290;
                Hibernate&#12399;JavaBeans&#12473;&#12479;&#12452;&#12523;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27704;&#32154;&#21270;&#12375;&#12289;
                <tt class="literal">getFoo</tt>, <tt class="literal">isFoo</tt>, 
                <tt class="literal">setFoo</tt> &#12398;&#12424;&#12358;&#12394;&#24418;&#24335;&#12398;&#12513;&#12477;&#12483;&#12489;&#21517;&#12434;&#35469;&#35672;&#12375;&#12414;&#12377;&#12290;
            </p><p>
                &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#12497;&#12502;&#12522;&#12483;&#12463;&#12391;&#23450;&#32681;&#12377;&#12427;&#24517;&#35201;&#12399; <span class="emphasis"><em>&#12354;&#12426;&#12414;&#12379;&#12435;</em></span>&#12290;
                Hibernate&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;, <tt class="literal">protected</tt>, <tt class="literal">private</tt> 
                &#12398;get / set&#12398;&#12506;&#12450;&#12434;&#25345;&#12388;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#27704;&#32154;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="persistent-classes-pojo-constructor"></a>4.1.2. &#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12434;&#23455;&#35013;&#12377;&#12427;</h3></div></div><div></div></div><p>
                <tt class="literal">Cat</tt> &#12395;&#12399;&#26263;&#40665;&#30340;&#12394;&#12487;&#12501;&#12457;&#12523;&#12488;&#65288;&#24341;&#25968;&#12394;&#12375;&#65289;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                &#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;&#12399;&#12487;&#12501;&#12457;&#12523;&#12488;&#12539;&#12467;&#12531;&#12473;&#12488;&#12521;&#12463;&#12479;&#65288;&#12497;&#12502;&#12522;&#12483;&#12463;&#12391;&#12394;&#12367;&#12390;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#65289;
                &#12434;&#25345;&#12383;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
                &#12381;&#12398;&#12383;&#12417;Hibernate&#12399; <tt class="literal">Constructor.newInstance()</tt> &#12434;&#20351;&#12387;&#12390;&#12289;
                &#12381;&#12428;&#12425;&#12434;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="persistent-classes-pojo-identifier"></a>4.1.3. &#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#29992;&#24847;&#12377;&#12427;(&#12458;&#12503;&#12471;&#12519;&#12531;&#65289;</h3></div></div><div></div></div><p>
                <tt class="literal">Cat</tt> &#12395;&#12399; <tt class="literal">id</tt> &#12392;&#12356;&#12358;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                &#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12393;&#12398;&#12424;&#12358;&#12394;&#21517;&#21069;&#12391;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12375;&#12289;
                &#22411;&#12418;&#12393;&#12435;&#12394;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#22411;&#12391;&#12418;&#12289;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#12398;&#12300;&#12521;&#12483;&#12497;&#12540;&#12301;&#22411;&#12391;&#12418;&#12289;
                <tt class="literal">java.lang.String</tt> &#12420; <tt class="literal">java.util.Date</tt> &#22411;&#12391;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12290;
                &#65288;&#12524;&#12460;&#12471;&#12540;&#12539;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12486;&#12540;&#12502;&#12523;&#12395;&#35079;&#21512;&#12461;&#12540;&#12364;&#12354;&#12428;&#12400;&#12289;
                &#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#25345;&#12388;&#12518;&#12540;&#12470;&#23450;&#32681;&#12463;&#12521;&#12473;&#12434;&#20351;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
                &#20197;&#19979;&#12398;&#35079;&#21512;&#35672;&#21029;&#23376;&#12398;&#31680;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#65289;
            </p><p>
                &#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12458;&#12503;&#12471;&#12519;&#12531;&#12391;&#12377;&#12290;
                &#12371;&#12428;&#12434;&#20351;&#12431;&#12378;&#12395;&#12289;Hibernate&#12364;&#20869;&#37096;&#30340;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12434;&#36861;&#12356;&#12363;&#12369;&#12427;&#12424;&#12358;&#12395;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
                &#12375;&#12363;&#12375;&#35672;&#21029;&#23376;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12289;&#22810;&#12367;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12392;&#12387;&#12390;&#33391;&#12356;&#65288;&#12381;&#12375;&#12390;&#12392;&#12390;&#12418;&#19968;&#33324;&#30340;&#12394;&#65289;
                &#35373;&#35336;&#12398;&#27770;&#23450;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
            </p><p>
                &#12373;&#12425;&#12395;&#12356;&#12367;&#12388;&#12363;&#12398;&#27231;&#33021;&#12399;&#12289;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12377;&#12427;&#12463;&#12521;&#12473;&#12384;&#12369;&#12391;&#21033;&#29992;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#65306;
            </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                        &#12459;&#12473;&#12465;&#12540;&#12489;&#26356;&#26032;&#65288;&#12300;&#12521;&#12452;&#12501;&#12469;&#12452;&#12463;&#12523;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12301;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#65289;
                    </p></li><li><p>
                        <tt class="literal">Session.saveOrUpdate()</tt>
                    </p></li></ul></div><p>
                &#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;&#12391;&#19968;&#36011;&#12375;&#12383;&#21517;&#21069;&#12398;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290;
                &#12373;&#12425;&#12395;null&#12391;&#12394;&#12356;&#65288;&#12388;&#12414;&#12426;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;&#22411;&#12391;&#12394;&#12356;&#65289;&#22411;&#12434;&#20351;&#12358;&#12371;&#12392;&#12434;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="persistent-classes-pojo-final"></a>4.1.4. final&#12463;&#12521;&#12473;&#12395;&#12375;&#12394;&#12356;&#65288;&#12458;&#12503;&#12471;&#12519;&#12531;&#65289;</h3></div></div><div></div></div><p>
                Hibernate&#12398;&#26680;&#12392;&#12394;&#12427;&#27231;&#33021;&#12398; <span class="emphasis"><em>&#12503;&#12525;&#12461;&#12471;</em></span> &#12399;
                final&#12391;&#12399;&#12394;&#12356;&#27704;&#32154;&#12463;&#12521;&#12473;&#12395;&#20381;&#23384;&#12377;&#12427;&#12363;&#12289;
                &#12414;&#12383;&#12399;&#12377;&#12409;&#12390;&#12398;&#12497;&#12502;&#12522;&#12483;&#12463;&#12539;&#12513;&#12477;&#12483;&#12489;&#12434;&#23450;&#32681;&#12377;&#12427;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12395;&#20381;&#23384;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
            </p><p>
                Hibernate&#12399;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12375;&#12394;&#12356; <tt class="literal">final</tt> &#12463;&#12521;&#12473;&#12434;&#27704;&#32154;&#21270;&#12391;&#12365;&#12414;&#12377;&#12364;&#12289;
                &#12503;&#12525;&#12461;&#12471;&#12434;&#20351;&#12358;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
                &#12381;&#12428;&#12399;&#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12539;&#12481;&#12517;&#12540;&#12491;&#12531;&#12464;&#12398;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#12356;&#12367;&#12425;&#12363;&#21046;&#38480;&#12375;&#12414;&#12377;&#12290;
            </p></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-inheritance"></a>4.2. &#32153;&#25215;&#12398;&#23455;&#35013;</h2></div></div><div></div></div><p>
            &#12469;&#12502;&#12463;&#12521;&#12473;&#12399;1&#30058;&#30446;&#12392;2&#30058;&#30446;&#12398;&#12523;&#12540;&#12523;&#12395;&#24467;&#12431;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
            &#12381;&#12428;&#12399;&#35672;&#21029;&#23376;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434; <tt class="literal">Cat</tt> &#12363;&#12425;&#32153;&#25215;&#12375;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">package eg;

public class DomesticCat extends Cat {
        private String name;

        public String getName() {
                return name;
        }
        protected void setName(String name) {
                this.name=name;
        }
}</pre></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-equalshashcode"></a>4.3. <tt class="literal">equals()</tt> &#12392; <tt class="literal">hashCode()</tt> &#12398;&#23455;&#35013;</h2></div></div><div></div></div><p>
            &#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#28151;&#21512;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65288;&#20363;&#12360;&#12400; <tt class="literal">Set</tt> &#12391;&#65289;&#12434;&#20351;&#12358;&#12388;&#12418;&#12426;&#12394;&#12425;&#12289;
            <tt class="literal">equals()</tt> &#12392; <tt class="literal">hashCode()</tt> &#12434;&#12458;&#12540;&#12496;&#12540;&#12521;&#12452;&#12489;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            <span class="emphasis"><em>&#12371;&#12428;&#12399;2&#12388;&#12398;&#30064;&#12394;&#12427; <tt class="literal">Session</tt> &#12391;&#12289;
            &#12371;&#12428;&#12425;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12427;&#12392;&#12365;&#12384;&#12369;&#12395;&#12354;&#12390;&#12399;&#12414;&#12426;&#12414;&#12377;&#12290;
            &#12392;&#12356;&#12358;&#12398;&#12399;Hibernate&#12399;1&#12388;&#12398; <tt class="literal">Session</tt> &#12391;JVM&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;
            &#65288;<tt class="literal"> a == b </tt>, <tt class="literal">equals()</tt> &#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#23455;&#35013;&#65289;
            &#12384;&#12369;&#12434;&#20445;&#35388;&#12377;&#12427;&#12363;&#12425;&#12391;&#12377;&#12290;</em></span>
        </p><p>
            <tt class="literal">a</tt> &#12392; <tt class="literal">b</tt> &#12398;&#20001;&#26041;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12289;
            &#21516;&#12376;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#34892;&#12384;&#12387;&#12383;&#12392;&#12375;&#12390;&#12418;&#65288;&#35672;&#21029;&#23376;&#12392;&#12375;&#12390;&#21516;&#12376;&#20027;&#12461;&#12540;&#12434;&#25345;&#12388;&#65289;&#12289;
            &#12354;&#12427;&#29305;&#23450;&#12398; <tt class="literal">Session</tt> &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12398;&#22806;&#12391;
            &#12381;&#12428;&#12425;&#12364;&#21516;&#12376;Java&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#20445;&#35388;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            &#26368;&#12418;&#26126;&#24555;&#12394;&#26041;&#27861;&#12399;&#12289;&#20001;&#26041;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#35672;&#21029;&#23376;&#12398;&#20516;&#12398;&#27604;&#36611;&#12395;&#12289;
            <tt class="literal">equals()</tt> / <tt class="literal">hashCode()</tt> &#12434;&#23455;&#35013;&#12377;&#12427;&#26041;&#27861;&#12391;&#12377;&#12290;
            &#12381;&#12398;&#20516;&#12364;&#21516;&#12376;&#12394;&#12425;&#20001;&#32773;&#12399;&#21516;&#12376;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#34892;&#12391;&#12394;&#12369;&#12428;&#12400;&#12394;&#12425;&#12378;&#12289;
            &#12381;&#12398;&#12383;&#12417;&#12381;&#12428;&#12425;&#12399;&#31561;&#12375;&#12367;&#12394;&#12426;&#12414;&#12377;
            &#65288;&#12418;&#12375;&#20001;&#32773;&#12364; <tt class="literal">Set</tt> &#12395;&#21152;&#12360;&#12425;&#12428;&#12428;&#12400;&#12289;
            <tt class="literal">Set</tt> &#12395;1&#12388;&#12398;&#35201;&#32032;&#12384;&#12369;&#12434;&#25345;&#12388;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#65289;&#12290;
            &#12354;&#12356;&#12395;&#12367;&#31169;&#12383;&#12385;&#12399;&#12371;&#12398;&#26041;&#27861;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
            Hibernate&#12399;&#27704;&#32154;&#12391;&#12354;&#12427;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12384;&#12369;&#12395;&#35672;&#21029;&#23376;&#12398;&#20516;&#12434;&#21106;&#12426;&#24403;&#12390;&#12289;
            &#26032;&#12375;&#12367;&#20316;&#25104;&#12373;&#12428;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#35672;&#21029;&#23376;&#12398;&#20516;&#12434;&#25345;&#12385;&#12414;&#12379;&#12435;&#12290;
            &#31169;&#12383;&#12385;&#12399; <span class="emphasis"><em>&#12499;&#12472;&#12493;&#12473;&#12539;&#12461;&#12540;&#31561;&#20385;&#24615;</em></span> &#12434;&#20351;&#12356;&#12289;
            <tt class="literal">equals()</tt> &#12392; <tt class="literal">hashCode()</tt> &#12434;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12434;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            &#12499;&#12472;&#12493;&#12473;&#12539;&#12461;&#12540;&#31561;&#20385;&#24615;&#12392;&#12399;&#12289;
            <tt class="literal">equals()</tt> &#12513;&#12477;&#12483;&#12489;&#12364;&#12499;&#12472;&#12493;&#12473;&#12539;&#12461;&#12540;&#12434;&#24418;&#20316;&#12427;&#12503;&#12525;&#12497;&#12486;&#12451;&#12384;&#12369;&#12434;&#27604;&#36611;&#12377;&#12427;&#12371;&#12392;&#12434;&#24847;&#21619;&#12375;&#12414;&#12377;&#12290;
            &#12461;&#12540;&#12399;&#29694;&#23455;&#19990;&#30028;&#12398;&#31169;&#12383;&#12385;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#35672;&#21029;&#12375;&#12414;&#12377;
            &#65288;<span class="emphasis"><em>&#33258;&#28982;&#12394;</em></span> &#20505;&#35036;&#12461;&#12540;&#12391;&#12377;&#65289;&#65306;
        </p><pre class="programlisting">public class Cat {

    ...
    public boolean equals(Object other) {
        if (this == other) return true;
        if (!(other instanceof Cat)) return false;

        final Cat cat = (Cat) other;

        if (!getName().equals(cat.getName())) return false;
        if (!getBirthday().equals(cat.getBirthday())) return false;

        return true;
    }

    public int hashCode() {
        int result;
        result = getName().hashCode();
        result = 29 * result + getBirthday().hashCode();
        return result;
    }

}</pre><p>
            &#20505;&#35036;&#12461;&#12540;&#65288;&#12371;&#12398;&#20363;&#12391;&#12399;&#21517;&#21069;&#12392;&#35477;&#29983;&#26085;&#12398;&#35079;&#21512;&#29289;&#65289;&#12399;
            &#12354;&#12427;&#29305;&#23450;&#12398;&#27604;&#36611;&#25805;&#20316;&#12384;&#12369;&#12395;&#22949;&#24403;&#12391;&#12354;&#12427;&#12371;&#12392;&#12434;&#24515;&#12395;&#30041;&#12417;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;
            &#65288;&#12362;&#12381;&#12425;&#12367;1&#12388;&#12398;&#12518;&#12540;&#12473;&#12465;&#12540;&#12473;&#12384;&#12369;&#12391;&#12377;&#65289;&#12290;
            &#26222;&#36890;&#12399;&#29694;&#23455;&#12398;&#20027;&#12461;&#12540;&#12395;&#24403;&#12390;&#12399;&#12414;&#12427;&#12289;&#23433;&#23450;criteria&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-lifecycle"></a>4.4. Lifecycle&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;</h2></div></div><div></div></div><p>
            &#12458;&#12503;&#12471;&#12519;&#12531;&#12392;&#12375;&#12390;&#27704;&#32154;&#12463;&#12521;&#12473;&#12399; <tt class="literal">Lifecycle</tt> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
            &#12381;&#12428;&#12399;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12475;&#12540;&#12502;&#12420;&#12525;&#12540;&#12489;&#12398;&#24460;&#12289;&#12381;&#12375;&#12390;&#21066;&#38500;&#12420;&#26356;&#26032;&#12398;&#21069;&#12395;&#12289;
            &#24517;&#35201;&#12394;&#21021;&#26399;&#21270;/&#12463;&#12522;&#12540;&#12531;&#12450;&#12483;&#12503;&#12434;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12434;&#21487;&#33021;&#12395;&#12377;&#12427;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            
            &#12375;&#12363;&#12375;Hibernate&#12399;&#12391;&#12375;&#12419;&#12400;&#12426;&#12377;&#12366;&#12394;&#12356;&#12418;&#12358;&#19968;&#12388;&#12398; <tt class="literal">Interceptor</tt> &#12418;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
        </p><div class="programlistingco"><pre class="programlisting">public interface Lifecycle {
        public boolean onSave(Session s) throws CallbackException;   <span class="co">(1)</span>
        public boolean onUpdate(Session s) throws CallbackException; <span class="co">(2)</span>
        public boolean onDelete(Session s) throws CallbackException; <span class="co">(3)</span>
        public void onLoad(Session s, Serializable id);              <span class="co">(4)</span>
}</pre><div class="calloutlist"><table border="0" summary="Callout list"><tr><td width="5%" valign="top" align="left">(1)</td><td valign="top" align="left"><p>
                        <tt class="literal">onSave</tt> - &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12475;&#12540;&#12502;&#12414;&#12383;&#12399;&#25407;&#20837;&#12373;&#12428;&#12427;&#30452;&#21069;&#12395;
                        &#12467;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(2)</td><td valign="top" align="left"><p>
                        <tt class="literal">onUpdate</tt> - &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#26356;&#26032;&#12373;&#12428;&#12427;&#30452;&#21069;
                        &#65288;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; <tt class="literal">Session.update()</tt> &#12395;&#28193;&#12373;&#12428;&#12427;&#12392;&#12365;&#65289;
                        &#12395;&#12467;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(3)</td><td valign="top" align="left"><p>
                        <tt class="literal">onDelete</tt> - &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#21066;&#38500;&#12373;&#12428;&#12427;&#30452;&#21069;&#12395;&#12467;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(4)</td><td valign="top" align="left"><p>
                        <tt class="literal">onLoad</tt> - &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#30452;&#24460;&#12395;&#12467;&#12540;&#12523;&#12373;&#12428;&#12414;&#12377;
                    </p></td></tr></table></div></div><p>
            <tt class="literal">onSave()</tt>, <tt class="literal">onDelete()</tt>,
            <tt class="literal">onUpdate()</tt> &#12399;&#20381;&#23384;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12459;&#12473;&#12465;&#12540;&#12489;&#12539;&#12475;&#12540;&#12502;&#12392;
            &#12459;&#12473;&#12465;&#12540;&#12489;&#21066;&#38500;&#12398;&#12383;&#12417;&#12395;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12399;&#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12391;&#12459;&#12473;&#12465;&#12540;&#12489;&#25805;&#20316;&#12434;&#23450;&#32681;&#12377;&#12427;&#20195;&#12431;&#12426;&#12398;&#26041;&#27861;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
            <tt class="literal">onLoad()</tt> &#12399;&#27704;&#32154;&#29366;&#24907;&#12363;&#12425;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#19968;&#26178;&#30340;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#21021;&#26399;&#21270;&#12377;&#12427;&#12371;&#12392;&#12395;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
            &#12375;&#12363;&#12375; <tt class="literal">Session</tt> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12399;
            &#12371;&#12398;&#12513;&#12477;&#12483;&#12489;&#12398;&#20869;&#37096;&#12363;&#12425;&#36215;&#21205;&#12373;&#12428;&#12394;&#12356;&#12363;&#12418;&#12375;&#12428;&#12394;&#12356;&#12398;&#12391;&#12289;
            &#12381;&#12428;&#12434;&#20381;&#23384;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12525;&#12540;&#12489;&#12398;&#12383;&#12417;&#12395;&#20351;&#12358;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
            &#20182;&#12395;&#32771;&#12360;&#12425;&#12428;&#12427; <tt class="literal">onLoad()</tt>, 
            <tt class="literal">onSave()</tt>, <tt class="literal">onUpdate()</tt> &#12398;&#20351;&#12356;&#26041;&#12399;&#12289;
            &#24460;&#12391;&#20351;&#12358;&#12383;&#12417;&#12395;&#29694;&#22312;&#12398; <tt class="literal">Session</tt> &#12408;&#12398;&#21442;&#29031;&#12434;&#20445;&#23384;&#12375;&#12390;&#12362;&#12367;&#12371;&#12392;&#12391;&#12377;&#12290;
        </p><p>
            <tt class="literal">onUpdate()</tt> &#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#27704;&#32154;&#29366;&#24907;&#12364;&#26356;&#26032;&#12373;&#12428;&#12427;&#12383;&#12403;&#12395;
            &#24517;&#12378;&#12467;&#12540;&#12523;&#12373;&#12428;&#12427;&#12431;&#12369;&#12391;&#12399;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            &#12381;&#12428;&#12364;&#12467;&#12540;&#12523;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;&#19968;&#26178;&#30340;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364; <tt class="literal">Session.update()</tt> &#12395;&#28193;&#12373;&#12428;&#12427;&#12392;&#12365;&#12384;&#12369;&#12391;&#12377;&#12290;
        </p><p>
            &#12418;&#12375; <tt class="literal">onSave()</tt>, <tt class="literal">onUpdate()</tt>, 
            <tt class="literal">onDelete()</tt> &#12364; <tt class="literal">true</tt> &#12434;&#36820;&#12377;&#12394;&#12425;&#12289;
            &#12381;&#12398;&#25805;&#20316;&#12399;&#20013;&#27490;&#12373;&#12428;&#12414;&#12377;&#12290;
            <tt class="literal">CallbackException</tt> &#12364;&#12473;&#12525;&#12540;&#12373;&#12428;&#12428;&#12400;&#12289;
            &#12381;&#12398;&#25805;&#20316;&#12399;&#20013;&#27490;&#12373;&#12428;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#20363;&#22806;&#12364;&#36820;&#12373;&#12428;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">onSave()</tt> &#12399;native&#12461;&#12540;&#29983;&#25104;&#12364;&#20351;&#12431;&#12428;&#12427;&#12392;&#12365;&#12434;&#38500;&#12356;&#12390;&#12289;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#35672;&#21029;&#23376;&#12364;&#21106;&#12426;&#24403;&#12390;&#12425;&#12428;&#12383;&#24460;&#12395;&#12467;&#12540;&#12523;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-validatable"></a>4.5. Validatable&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;</h2></div></div><div></div></div><p>
            &#27704;&#32154;&#12463;&#12521;&#12473;&#12364;&#29366;&#24907;&#12434;&#27704;&#32154;&#21270;&#12377;&#12427;&#21069;&#12395;&#19981;&#22793;&#24335;&#12434;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12428;&#12400;&#12289;
            &#20197;&#19979;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#65306;
        </p><pre class="programlisting">public interface Validatable {
        public void validate() throws ValidationFailure;
}</pre><p>
            &#19981;&#22793;&#24335;&#12364;&#28288;&#12383;&#12373;&#12428;&#12394;&#12369;&#12428;&#12400;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399; <tt class="literal">ValidationFailure</tt> &#12434;&#12473;&#12525;&#12540;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
            <tt class="literal">Validatable</tt> &#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;
            <tt class="literal">validate()</tt> &#12398;&#20869;&#37096;&#12391;&#29366;&#24907;&#12434;&#26356;&#26032;&#12377;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            <tt class="literal">Lifecycle</tt> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12398;&#12467;&#12540;&#12523;&#12496;&#12483;&#12463;&#12539;&#12513;&#12477;&#12483;&#12489;&#12392;&#12399;&#36949;&#12356;&#12289;
            <tt class="literal">validate()</tt> &#12399;&#20309;&#22238;&#12467;&#12540;&#12523;&#12373;&#12428;&#12427;&#12363;&#12431;&#12363;&#12426;&#12414;&#12379;&#12435;&#12290;
            &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12499;&#12472;&#12493;&#12473;&#12398;&#27231;&#33021;&#12434; 
            <tt class="literal">validate()</tt> &#12395;&#20381;&#23384;&#12373;&#12379;&#12427;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-xdoclet"></a>4.6. XDoclet&#12510;&#12540;&#12463;&#12450;&#12483;&#12503;&#12398;&#20351;&#29992;</h2></div></div><div></div></div><p>
            &#27425;&#12398;&#31456;&#12391;&#12399;&#31777;&#21336;&#12391;&#35501;&#12415;&#12420;&#12377;&#12356;XML&#12501;&#12457;&#12540;&#12510;&#12483;&#12488;&#12434;&#20351;&#12356;&#12289;
            Hibernate&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#34920;&#29694;&#12373;&#12428;&#12427;&#12363;&#12434;&#12362;&#35211;&#12379;&#12375;&#12414;&#12377;&#12290;
            Hibernate&#12518;&#12540;&#12470;&#12398;&#22810;&#12367;&#12399;XDoclet&#12398; <tt class="literal">@hibernate.tags</tt> &#12434;&#20351;&#12356;&#12289;
            &#12510;&#12483;&#12500;&#12531;&#12464;&#24773;&#22577;&#12434;&#30452;&#25509;&#12477;&#12540;&#12473;&#12467;&#12540;&#12489;&#12395;&#22475;&#12417;&#36796;&#12416;&#26041;&#27861;&#12434;&#22909;&#12415;&#12414;&#12377;&#12290;
            &#21427;&#23494;&#12395;&#12399;&#12371;&#12428;&#12399;XDoclet&#12398;&#38936;&#20998;&#12384;&#12392;&#32771;&#12360;&#12425;&#12428;&#12427;&#12398;&#12391;&#12289;
            &#12371;&#12398;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#12399;&#12371;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12391;&#12399;&#36848;&#12409;&#12414;&#12379;&#12435;&#12290;
            &#12375;&#12363;&#12375;XDoclet&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#20351;&#12387;&#12383; <tt class="literal">Cat</tt> &#12398;&#20363;&#12434;&#20197;&#19979;&#12395;&#12362;&#35211;&#12379;&#12375;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">package eg;
import java.util.Set;
import java.util.Date;

/**
 * @hibernate.class
 *  table="CATS"
 */
public class Cat {
    private Long id; // &#35672;&#21029;&#23376;
    private Date birthdate;
    private Cat mate;
    private Set kittens
    private Color color;
    private char sex;
    private float weight;

    /**
     * @hibernate.id
     *  generator-class="native"
     *  column="CAT_ID"
     */
    public Long getId() {
        return id;
    }
    private void setId(Long id) {
        this.id=id;
    }

    /**
     * @hibernate.many-to-one
     *  column="MATE_ID"
     */
    public Cat getMate() {
        return mate;
    }
    void setMate(Cat mate) {
        this.mate = mate;
    }

    /**
     * @hibernate.property
     *  column="BIRTH_DATE"
     */
    public Date getBirthdate() {
        return birthdate;
    }
    void setBirthdate(Date date) {
        birthdate = date;
    }
    /**
     * @hibernate.property
     *  column="WEIGHT"
     */
    public float getWeight() {
        return weight;
    }
    void setWeight(float weight) {
        this.weight = weight;
    }

    /**
     * @hibernate.property
     *  column="COLOR"
     *  not-null="true"
     */
    public Color getColor() {
        return color;
    }
    void setColor(Color color) {
        this.color = color;
    }
    /**
     * @hibernate.set
     *  lazy="true"
     *  order-by="BIRTH_DATE"
     * @hibernate.collection-key
     *  column="PARENT_ID"
     * @hibernate.collection-one-to-many
     */
    public Set getKittens() {
        return kittens;
    }
    void setKittens(Set kittens) {
        this.kittens = kittens;
    }
    // addKitten&#12399;&#12289;Hibernate&#12395;&#12392;&#12387;&#12390;&#12399;&#24517;&#35201;&#12354;&#12426;&#12414;&#12379;&#12435;
    public void addKitten(Cat kitten) {
        kittens.add(kitten);
    }

    /**
     * @hibernate.property
     *  column="SEX"
     *  not-null="true"
     *  update="false"
     */
    public char getSex() {
        return sex;
    }
    void setSex(char sex) {
        this.sex=sex;
    }
}</pre></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="session-configuration.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="mapping.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;3&#31456; SessionFactory&#12398;&#35373;&#23450;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;5&#31456; O/R&#12510;&#12483;&#12500;&#12531;&#12464;&#12398;&#22522;&#26412;</td></tr></table></div></body></html>