<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#21069;&#26360;&#12365;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="next" href="quickstart.html" title="&#31532;1&#31456; Tomcat&#12391;&#12463;&#12452;&#12483;&#12463;&#12539;&#12473;&#12479;&#12540;&#12488;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#21069;&#26360;&#12365;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="quickstart.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="preface" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="preface"></a>&#21069;&#26360;&#12365;</h2></div></div><div></div></div><p>
            WARNING! This is a translated version of the English Hibernate reference
            documentation. The translated version might not be up to date! However, the
            differences should only be very minor. Consult the English reference
            documentation if you are missing information or encounter a translation
            error. If you like to contribute to a particular translation, contact us
            on the Hibernate developer mailing list.
        </p><p>
            Translator(s): Chikara Honma &lt;chikara-honma@exa-corp.co.jp&gt;,
                            Yusuke Hiroto &lt;yusuke-hiroto@exa-corp.co.jp&gt;
        </p><p>
            &#20170;&#26085;&#12398;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#29872;&#22659;&#12391;&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;/&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#20181;&#20107;&#12399;&#12289;
            &#21380;&#20171;&#12391;&#26178;&#38291;&#12398;&#12363;&#12363;&#12427;&#12418;&#12398;&#12391;&#12354;&#12427;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;Hibernate&#12399;&#12289;
            Java&#29872;&#22659;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;/&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12510;&#12483;&#12500;&#12531;&#12464;&#12484;&#12540;&#12523;&#12391;&#12377;&#12290;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;/&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12510;&#12483;&#12500;&#12531;&#12464;&#65288;ORM)&#12392;&#12356;&#12358;&#35328;&#33865;&#12399;&#12289;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12514;&#12487;&#12523;&#12391;&#34920;&#29694;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12289;
            &#12388;&#12414;&#12426;SQL&#12505;&#12540;&#12473;&#12398;&#27083;&#36896;&#12398;&#12487;&#12540;&#12479;&#12395;&#23550;&#24540;&#20184;&#12369;&#12427;&#25216;&#34899;&#12398;&#12371;&#12392;&#12434;&#35328;&#12356;&#12414;&#12377;&#12290;
        </p><p>
            Hibernate&#12399;Java&#12463;&#12521;&#12473;&#12363;&#12425;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12486;&#12540;&#12502;&#12523;&#12408;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#34892;&#12358;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;
            &#12487;&#12540;&#12479;&#12398;&#12463;&#12456;&#12522;&#12392;&#24489;&#20803;&#27231;&#33021;&#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;&#12381;&#12398;&#12362;&#12363;&#12370;&#12391;&#12289;
            SQL&#12392;JDBC&#12395;&#12424;&#12427;&#25163;&#20316;&#26989;&#12391;&#12487;&#12540;&#12479;&#12434;&#25805;&#20316;&#12377;&#12427;&#26041;&#27861;&#12395;&#27604;&#12409;&#12390;&#12289;&#38283;&#30330;&#26178;&#38291;&#12434;&#26684;&#27573;&#12395;&#28187;&#12425;&#12377;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><p>
            Hibernate&#12398;&#30446;&#27161;&#12399;&#12289;&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#20316;&#26989;&#12395;&#38306;&#12431;&#12427;&#12289;&#20849;&#36890;&#12398;&#12487;&#12540;&#12479;&#27704;&#32154;&#21270;&#20316;&#26989;&#12398;95&#65285;&#12363;&#12425;&#12289;
            &#38283;&#30330;&#32773;&#12434;&#35299;&#25918;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
            Hibernate&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#19978;&#12391;&#12499;&#12472;&#12493;&#12473;&#12539;&#12525;&#12472;&#12483;&#12463;&#12434;&#23455;&#35013;&#12377;&#12427;&#12473;&#12488;&#12450;&#12489;&#12539;&#12503;&#12525;&#12471;&#12540;&#12472;&#12515;&#12434;&#20351;&#12358;&#12384;&#12369;&#12398;&#12289;
            &#12487;&#12540;&#12479;&#20013;&#24515;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#23550;&#12377;&#12427;&#12505;&#12473;&#12488;&#12539;&#12477;&#12522;&#12517;&#12540;&#12471;&#12519;&#12531;&#12391;&#12354;&#12427;&#12384;&#12369;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12489;&#12513;&#12452;&#12531;&#12514;&#12487;&#12523;&#12392;&#12289;Java&#12505;&#12540;&#12473;&#12398;&#20013;&#38291;&#23652;&#12395;&#12362;&#12369;&#12427;&#12499;&#12472;&#12493;&#12473;&#12539;&#12525;&#12472;&#12483;&#12463;&#12395;&#23550;&#12375;&#12390;&#26368;&#12418;&#26377;&#29992;&#12391;&#12377;&#12290;
            &#12375;&#12363;&#12375;&#12289;Hibernate&#12399;&#12505;&#12531;&#12480;&#22266;&#26377;&#12398;SQL&#12467;&#12540;&#12489;&#12434;&#21462;&#12426;&#38500;&#12356;&#12383;&#12426;&#12289;&#12459;&#12503;&#12475;&#12523;&#21270;&#12391;&#12365;&#12414;&#12377;&#12290;
            &#12414;&#12383;&#34920;&#24418;&#24335;&#12398;&#34920;&#29694;&#12363;&#12425;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#12464;&#12521;&#12501;&#12408;&#12392;&#12289;&#12522;&#12470;&#12523;&#12488;&#12539;&#12475;&#12483;&#12488;&#12434;&#32763;&#35379;&#12377;&#12427;&#20849;&#36890;&#20316;&#26989;&#12398;&#25163;&#21161;&#12369;&#12418;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            &#12418;&#12375;Hibernate&#12392;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;/&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12510;&#12483;&#12500;&#12531;&#12464;&#12289;&#12373;&#12425;&#12395;&#12399;Java&#12364;&#21021;&#12417;&#12390;&#12394;&#12425;&#12289;
            &#20197;&#19979;&#12398;&#12473;&#12486;&#12483;&#12503;&#12391;&#36914;&#12435;&#12391;&#12367;&#12384;&#12373;&#12356;&#65306;
        </p><div class="orderedlist"><ol type="1"><li><p>
                    Tomcat&#12434;&#20351;&#12387;&#12383;30&#20998;&#38291;&#12398;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523; <a href="quickstart.html" title="&#31532;1&#31456; Tomcat&#12391;&#12463;&#12452;&#12483;&#12463;&#12539;&#12473;&#12479;&#12540;&#12488;">&#31456;&nbsp;1. <i>Tomcat&#12391;&#12463;&#12452;&#12483;&#12463;&#12539;&#12473;&#12479;&#12540;&#12488;</i></a> &#12434;&#35501;&#12435;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></li><li><p>
                    Hibernate&#12434;&#20351;&#12358;&#29872;&#22659;&#12434;&#29702;&#35299;&#12377;&#12427;&#12383;&#12417;&#12395; <a href="architecture.html" title="&#31532;2&#31456; &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;">&#31456;&nbsp;2. <i>&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;</i></a> &#12434;&#35501;&#12435;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></li><li><p>
                    Hibernate&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398; <tt class="literal">eg/</tt> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12381;&#12371;&#12395;&#31777;&#21336;&#12394;&#12473;&#12479;&#12531;&#12489;&#12539;&#12450;&#12525;&#12540;&#12531;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
                    JDBC&#12489;&#12521;&#12452;&#12496;&#12434; <tt class="literal">lib/</tt> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12467;&#12500;&#12540;&#12375;&#12289;
                    &#12362;&#20351;&#12356;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23550;&#12377;&#12427;&#36969;&#20999;&#12394;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#12424;&#12358;&#12395; 
                    <tt class="literal">etc/hibernate.properties</tt> &#12434;&#32232;&#38598;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12391;&#12467;&#12510;&#12531;&#12489;&#12503;&#12525;&#12531;&#12503;&#12488;&#12363;&#12425; 
                    <tt class="literal">ant eg</tt> &#12392;&#12479;&#12452;&#12503;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#65288;Ant&#12434;&#20351;&#29992;&#65289;&#12290;
                    Windows&#29872;&#22659;&#12394;&#12425;&#12400; <tt class="literal">build eg</tt> &#12392;&#12479;&#12452;&#12503;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></li><li><p>
                    &#12371;&#12398;&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12539;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#31532;1&#12398;&#24773;&#22577;&#28304;&#12392;&#12375;&#12390;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12418;&#12375;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#35373;&#35336;&#12398;&#12373;&#12425;&#12394;&#12427;&#24773;&#22577;&#12364;&#24517;&#35201;&#12384;&#12387;&#12383;&#12426;&#12289;
                    &#12473;&#12486;&#12483;&#12503;&#12539;&#12496;&#12452;&#12539;&#12473;&#12486;&#12483;&#12503;&#12398;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12398;&#26041;&#12364;&#12362;&#22909;&#12415;&#12394;&#12425;&#12289;
                    <span class="emphasis"><em>Hibernate in Action</em></span> (http://www.manning.com/bauer) 
                    &#12434;&#35501;&#12416;&#12371;&#12392;&#12434;&#32771;&#12360;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12414;&#12383;http://caveatemptor.hibernate.org&#12395;&#26469;&#12390;Hibernate in Action&#12398;
                    &#20363;&#38988;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#12480;&#12454;&#12531;&#12525;&#12540;&#12489;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    </p></li><li><p>
					Hibernate&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12395;FAQ&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
				</p></li><li><p>
					&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12398;&#12487;&#12514;&#12289;&#20363;&#12289;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12364;Hibernate&#12398;&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12363;&#12425;&#12522;&#12531;&#12463;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
				</p></li><li><p>
                    Hibernate&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12398;&#12467;&#12511;&#12517;&#12491;&#12486;&#12451;&#12539;&#12456;&#12522;&#12450;&#12399;&#12289;
                    &#12487;&#12470;&#12452;&#12531;&#12497;&#12479;&#12540;&#12531;&#12420;&#12356;&#12429;&#12356;&#12429;&#12394;&#32113;&#21512;&#12477;&#12522;&#12517;&#12540;&#12471;&#12519;&#12531;
                    &#65288;Tomcat, JBoss, Spring, Struts, EJB&#12394;&#12393;&#65289;&#12398;&#12424;&#12356;&#24773;&#22577;&#28304;&#12391;&#12377;&#12290;
                </p></li></ol></div><p>
             &#36074;&#21839;&#12364;&#12354;&#12428;&#12400;&#12289;Hibernate&#12454;&#12455;&#12502;&#12469;&#12452;&#12488;&#12363;&#12425;&#12522;&#12531;&#12463;&#12373;&#12428;&#12390;&#12356;&#12427;&#12289;&#12518;&#12540;&#12470;&#12539;&#12501;&#12457;&#12540;&#12521;&#12512;&#12434;&#20351;&#12387;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
             &#12414;&#12383;&#12496;&#12464;&#12524;&#12509;&#12540;&#12488;&#12392;&#27231;&#33021;&#35201;&#27714;&#12398;&#12383;&#12417;&#12395;&#12289;JIRA&#35696;&#38988;&#12488;&#12521;&#12483;&#12461;&#12531;&#12464;&#12539;&#12471;&#12473;&#12486;&#12512;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
             &#12418;&#12375;Hibernate&#12398;&#38283;&#30330;&#12395;&#33288;&#21619;&#12364;&#12354;&#12428;&#12400;&#12289;&#38283;&#30330;&#32773;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12395;&#21442;&#21152;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
             &#12418;&#12375;&#12371;&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12398;&#12354;&#12394;&#12383;&#12398;&#35328;&#35486;&#12408;&#12398;&#32763;&#35379;&#12395;&#33288;&#21619;&#12364;&#12354;&#12428;&#12400;&#12289;
             &#38283;&#30330;&#32773;&#12513;&#12540;&#12522;&#12531;&#12464;&#12522;&#12473;&#12488;&#12391;&#31169;&#12383;&#12385;&#12395;&#12467;&#12531;&#12479;&#12463;&#12488;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
         </p><p>
             Hibernate&#12398;&#21830;&#26989;&#30340;&#12394;&#38283;&#30330;&#12398;&#12469;&#12509;&#12540;&#12488;&#12289;&#35069;&#21697;&#12469;&#12509;&#12540;&#12488;&#12289;&#12488;&#12524;&#12540;&#12491;&#12531;&#12464;&#12399;JBoss Inc.&#12434;&#36890;&#12375;&#12390;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
             (http://www.hibernate.org/SupportTraining/&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#65289;
             Hibernate&#12399;JBoss Professional Open Source&#12503;&#12525;&#12480;&#12463;&#12488;&#12539;&#12473;&#12452;&#12540;&#12488;&#12398;&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;
         </p><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="preface-s1"></a>1. &#26085;&#26412;&#35486;&#35379;&#12395;&#12388;&#12356;&#12390;</h2></div></div><div></div></div><p><a name="preface-s1-p1"></a>
           &#12371;&#12398;&#26085;&#26412;&#35486;&#29256;Hibernate&#12522;&#12501;&#12449;&#12524;&#12531;&#12473;&#12539;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#65288;&#20197;&#19979; &#26085;&#26412;&#35486;&#29256;&#65289;&#12399;&#12289;Hibernate&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#32763;&#35379;&#12503;&#12525;&#12475;&#12473;&#12395;&#22522;&#12389;&#12356;&#12390;&#12356;&#12414;&#12377;&#12290;&#26085;&#26412;&#35486;&#29256;&#12394;&#12425;&#12403;&#12395;&#21407;&#25991;&#12399;LGPL&#12521;&#12452;&#12475;&#12531;&#12473;&#12395;&#28310;&#12376;&#12414;&#12377;&#12290;&#26085;&#26412;&#35486;&#29256;&#12398;&#32763;&#35379;&#32773;&#12399;&#12289;&#26085;&#26412;&#35486;&#29256;&#12395;&#23550;&#12375;&#12390;&#32626;&#21517;&#20197;&#22806;&#12398;&#12381;&#12398;&#20182;&#12398;&#19968;&#20999;&#12398;&#27177;&#21033;&#12434;&#25918;&#26820;&#12356;&#12383;&#12375;&#12414;&#12377;&#12290;
         </p><p><a name="preface-s1-p2"></a>
           &#26085;&#26412;&#35486;&#29256;&#12398;&#21033;&#29992;&#12395;&#12424;&#12387;&#12390;&#31532;&#19977;&#32773;&#12364;&#12371;&#12358;&#12416;&#12427;&#12354;&#12425;&#12422;&#12427;&#19981;&#21033;&#30410;&#12395;&#23550;&#12375;&#12390;&#12289;&#21407;&#33879;&#32773;&#12289;&#32763;&#35379;&#32773;&#12394;&#12425;&#12403;&#12395;&#12381;&#12398;&#32068;&#32340;&#12399;&#19968;&#20999;&#12398;&#20445;&#35388;&#12434;&#12356;&#12383;&#12375;&#12363;&#12397;&#12414;&#12377;&#12290;&#26085;&#26412;&#35486;&#29256;&#12399;&#35492;&#12426;&#12434;&#21547;&#12416;&#21487;&#33021;&#24615;&#12364;&#12354;&#12427;&#12371;&#12392;&#12434;&#35469;&#35672;&#12375;&#12383;&#19978;&#12391;&#12289;&#12372;&#21033;&#29992;&#12367;&#12384;&#12373;&#12356;&#12290;&#20869;&#23481;&#12398;&#27491;&#30906;&#12394;&#24847;&#21619;&#12434;&#25226;&#25569;&#12377;&#12427;&#12383;&#12417;&#12395;&#12399;&#12289;&#21407;&#25991;&#12434;&#12362;&#35501;&#12415;&#12395;&#12394;&#12427;&#12371;&#12392;&#12434;&#12362;&#21223;&#12417;&#12375;&#12414;&#12377;&#12290;&#12414;&#12383;&#12418;&#12375;&#26085;&#26412;&#35486;&#29256;&#12395;&#35492;&#12426;&#12434;&#35211;&#12388;&#12369;&#12425;&#12428;&#12383;&#22580;&#21512;&#12399;&#12289;&#32763;&#35379;&#32773;&#12395;&#12372;&#36899;&#32097;&#12356;&#12383;&#12384;&#12369;&#12428;&#12400;&#24184;&#12356;&#12391;&#12377;&#12290;&#12383;&#12384;&#12375;&#20869;&#23481;&#12395;&#38306;&#12375;&#12390;&#12398;&#12362;&#21839;&#12356;&#21512;&#12431;&#12379;&#12395;&#12399;&#12289;&#24540;&#12376;&#12363;&#12397;&#12414;&#12377;&#12398;&#12391;&#12372;&#20102;&#25215;&#12367;&#12384;&#12373;&#12356;&#12290;
         </p><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="preface-s1-1"></a>1.1. &#26085;&#26412;&#35486;&#29256;&#32763;&#35379;&#32773;&#12395;&#12388;&#12356;&#12390;</h3></div></div><div></div></div><p><a name="preface-s1-1-p4"></a>
           &#26085;&#26412;&#35486;&#29256;&#12496;&#12540;&#12472;&#12519;&#12531;2.1.7&#12398;6-8,11-17&#31456;&#12399;&#26412;&#38291;&#21147;(chikara_honma_exa_corp@yahoo.co.jp)&#12364;&#12289;&#21069;&#26360;&#12365;,1-5,9,10,18,19&#31456;&#12399;&#24195;&#25144;&#35029;&#20171;(yusuke_hiroto_exa_corp@yahoo.co.jp)&#12364;&#32763;&#35379;&#12375;&#12414;&#12375;&#12383;&#12290;&#12394;&#12362;&#12289;&#32763;&#35379;&#12395;&#38555;&#12375;&#21161;&#35328;&#12392;&#21332;&#21147;&#12434;&#12356;&#12383;&#12384;&#12356;&#12383;&#12289;(&#26666;)&#12456;&#12463;&#12469;&#12398;&#20117;&#38306;&#30693;&#25991;&#12373;&#12435;&#12392;&#24179;&#38291;&#20581;&#19968;&#12373;&#12435;&#12395;&#24863;&#35613;&#12356;&#12383;&#12375;&#12414;&#12377;&#12290;
         </p></div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="quickstart.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">HIBERNATE - Relational Persistence for Idiomatic Java&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;1&#31456; Tomcat&#12391;&#12463;&#12452;&#12483;&#12463;&#12539;&#12473;&#12479;&#12540;&#12488;</td></tr></table></div></body></html>