<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;1&#31456; Tomcat&#12391;&#12463;&#12452;&#12483;&#12463;&#12539;&#12473;&#12479;&#12540;&#12488;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="preface.html" title="&#21069;&#26360;&#12365;"><link rel="next" href="architecture.html" title="&#31532;2&#31456; &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;1&#31456; Tomcat&#12391;&#12463;&#12452;&#12483;&#12463;&#12539;&#12473;&#12479;&#12540;&#12488;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="preface.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="architecture.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="quickstart"></a>&#31532;1&#31456; Tomcat&#12391;&#12463;&#12452;&#12483;&#12463;&#12539;&#12473;&#12479;&#12540;&#12488;</h2></div></div><div></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="quickstart-intro"></a>1.1. Hibernate&#12434;&#22987;&#12417;&#12424;&#12358;</h2></div></div><div></div></div><p>
            &#12371;&#12398;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12391;&#12399;&#12289;Web&#12505;&#12540;&#12473;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#12383;&#12417;&#12398;&#12289;
            Apache Tomcat&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12539;&#12467;&#12531;&#12486;&#12490;&#12434;&#20351;&#12387;&#12383;&#12289;
            Hibernate2.1&#12398;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12395;&#12388;&#12356;&#12390;&#36848;&#12409;&#12414;&#12377;&#12290;
            &#20027;&#35201;&#12394;&#12377;&#12409;&#12390;&#12398;J2EE&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12420;&#12289;
            &#12473;&#12479;&#12531;&#12489;&#12450;&#12525;&#12540;&#12531;&#12539;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#31649;&#29702;&#12373;&#12428;&#12383;&#29872;&#22659;&#12391;&#12289;Hibernate&#12399;&#12424;&#12367;&#21205;&#20316;&#12375;&#12414;&#12377;&#12290;
            &#12371;&#12398;&#20363;&#12391;&#20351;&#12358;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12471;&#12473;&#12486;&#12512;&#12399;PostgreSQL7.3&#12391;&#12377;&#12364;&#12289;
            Hibernate&#12398;SQL&#26041;&#35328;&#12434;&#35373;&#23450;&#12375;&#12394;&#12362;&#12377;&#12384;&#12369;&#12391;&#12289;&#20182;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#22793;&#26356;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><p>
            &#26368;&#21021;&#12398;&#12473;&#12486;&#12483;&#12503;&#12399;&#12289;Tomcat&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12289;
            &#24517;&#35201;&#12394;&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#12377;&#12409;&#12390;&#12434;&#12467;&#12500;&#12540;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
            &#12371;&#12398;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12391;&#12399;&#12289;&#29420;&#31435;&#12375;&#12383;&#12454;&#12455;&#12502;&#12539;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;
            &#65288;<tt class="literal">webapps/quickstart</tt>&#65289;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
            &#12381;&#12398;&#12383;&#12417;&#12464;&#12525;&#12540;&#12496;&#12523;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12539;&#12469;&#12540;&#12481;&#12497;&#12473;&#65288;<tt class="literal">TOMCAT/common/lib</tt>&#65289;&#12392; 
            <tt class="literal">webapps/quickstart/WEB-INF/lib</tt> &#12395;&#12362;&#12369;&#12427;
            &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12524;&#12505;&#12523;&#12398;&#12463;&#12521;&#12473;&#12525;&#12540;&#12480;&#65288;JAR&#12501;&#12449;&#12452;&#12523;&#12398;&#12383;&#12417;&#65289;&#12392; 
            <tt class="literal">webapps/quickstart/WEB-INF/classes</tt> &#12434;&#32771;&#24942;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
            &#36861;&#12293;&#12464;&#12525;&#12540;&#12496;&#12523;&#12539;&#12463;&#12521;&#12473;&#12497;&#12473;&#12392;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12463;&#12521;&#12473;&#12497;&#12473;&#12398;&#12289;&#20001;&#26041;&#12398;&#12463;&#12521;&#12473;&#12525;&#12540;&#12480;&#12395;&#35328;&#21450;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            &#12414;&#12378;&#12289;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;2&#12388;&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;&#12395;&#12467;&#12500;&#12540;&#12375;&#12414;&#12375;&#12423;&#12358;&#65306;
        </p><div class="orderedlist"><ol type="1"><li><p>
                    &#21021;&#12417;&#12395;&#12289;&#12464;&#12525;&#12540;&#12496;&#12523;&#12539;&#12463;&#12521;&#12473;&#12497;&#12473;&#12395;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#12467;&#12500;&#12540;&#12375;&#12414;&#12377;&#12290;
                    &#12371;&#12428;&#12399;Tomcat&#12395;&#12496;&#12531;&#12489;&#12523;&#12373;&#12428;&#12427;&#12289;DBCP&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12503;&#12540;&#12523;&#12539;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12395;&#24517;&#35201;&#12391;&#12377;&#12290;
                    Hibernate&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;SQL&#12434;&#23455;&#34892;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
                    &#12381;&#12398;&#12383;&#12417;&#12289;&#12503;&#12540;&#12523;&#12373;&#12428;&#12383;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#29992;&#24847;&#12377;&#12427;&#12363;&#12289;
                    Hibernate&#12364;&#30452;&#25509;&#12469;&#12509;&#12540;&#12488;&#12375;&#12390;&#12356;&#12427;&#12503;&#12540;&#12523;&#65288;C3P0, Proxool&#65289;&#12398;1&#12388;&#12434;&#20351;&#12358;&#12424;&#12358;&#12395;&#12289;
                    &#35373;&#23450;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
                    &#12371;&#12398;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12391;&#12399;&#12289;&#12464;&#12525;&#12540;&#12496;&#12523;&#12539;&#12463;&#12521;&#12473;&#12525;&#12540;&#12480;&#12497;&#12473;&#12395;&#12289;
                    <tt class="literal">pg73jdbc3.jar</tt> &#12521;&#12452;&#12502;&#12521;&#12522;
                    &#65288;PostgreSQL7.3&#12392;JDK1.4&#29992;&#65289;&#12434;&#12467;&#12500;&#12540;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12418;&#12375;&#20182;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#20351;&#12356;&#12383;&#12369;&#12428;&#12400;&#12289;&#36969;&#20999;&#12394;JDBC&#12489;&#12521;&#12452;&#12496;&#12434;&#12467;&#12500;&#12540;&#12377;&#12427;&#12384;&#12369;&#12391;&#12377;&#12290;
                </p></li><li><p>
                    Tomcat&#12398;&#12464;&#12525;&#12540;&#12496;&#12523;&#12539;&#12463;&#12521;&#12473;&#12525;&#12540;&#12480;&#12497;&#12473;&#12395;&#12399;&#12289;&#20182;&#12395;&#12399;&#27770;&#12375;&#12390;&#20309;&#12418;&#12467;&#12500;&#12540;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12381;&#12358;&#12391;&#12394;&#12369;&#12428;&#12400;&#12289;&#20363;&#12360;&#12400;Log4j, commons-logging&#12394;&#12393;&#12398;&#12356;&#12429;&#12356;&#12429;&#12394;&#12484;&#12540;&#12523;&#12395;&#12289;
                    &#21839;&#38988;&#12364;&#20986;&#12390;&#12365;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
                    &#24517;&#12378;&#21508;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12372;&#12392;&#12395;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12497;&#12473;&#12434;&#20351;&#12358;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12388;&#12414;&#12426; <tt class="literal">WEB-INF/lib</tt> &#12395;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#12467;&#12500;&#12540;&#12375;&#12390;&#12289;
                    <tt class="literal">WEB-INF/classes</tt> &#12395;&#12289;
                    &#12463;&#12521;&#12473;&#12392;&#35373;&#23450;/&#12503;&#12525;&#12497;&#12486;&#12451;&#12539;&#12501;&#12449;&#12452;&#12523;&#12434; &#12467;&#12500;&#12540;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#20001;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12392;&#12418;&#12395;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12524;&#12505;&#12523;&#12398;&#12463;&#12521;&#12473;&#12497;&#12473;&#12391;&#12377;&#12290;
				</p></li><li><p>
                    Hibernate&#12399;JAR&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#12497;&#12483;&#12465;&#12540;&#12472;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
                    <tt class="literal">hibernate2.jar</tt> &#12501;&#12449;&#12452;&#12523;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12398;&#20182;&#12398;&#12463;&#12521;&#12473;&#12392;&#19968;&#32210;&#12395;&#12289;
                    &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12463;&#12521;&#12473;&#12497;&#12473;&#12395;&#37197;&#32622;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
                    Hibernate&#12399;&#12356;&#12367;&#12388;&#12363;&#12398;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#12289;&#23455;&#34892;&#26178;&#12395;&#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#12290;
                    &#12371;&#12428;&#12425;&#12399;Hibernate&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398; 
                    <tt class="literal">lib/</tt> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;&#12414;&#12392;&#12417;&#12425;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
                    <a href="quickstart.html#3rdpartylibs" title="&#34920; 1.1. &#xA;                Hibernate&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#xA;            ">&#34920;&nbsp;1.1. &#12300;
                Hibernate&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;
            &#12301;</a> &#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                    &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12463;&#12521;&#12473;&#12497;&#12473;&#12395;&#12289;&#24517;&#35201;&#12394;&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#12467;&#12500;&#12540;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                </p></li></ol></div><div class="table"><a name="3rdpartylibs"></a><p class="title"><b>&#34920; 1.1. 
                Hibernate&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;
            </b></p><table summary="&#xA;                Hibernate&#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#xA;            " border="1"><colgroup><col><col></colgroup><thead><tr><th align="center">
                            &#12521;&#12452;&#12502;&#12521;&#12522;
                        </th><th align="center">
                            &#35500;&#26126;
                        </th></tr></thead><tbody><tr><td>
                            dom4j&#65288;&#24517;&#38920;&#65289;
                        </td><td>
                            Hibernate&#12399;&#12289;XML&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12392;XML&#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12513;&#12479;&#12487;&#12540;&#12479;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#27083;&#25991;&#35299;&#26512;&#12395;&#12289;
                            dom4j&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
                        </td></tr><tr><td>
                            CGLIB&#65288;&#24517;&#38920;&#65289;
                        </td><td>
                            Hibernate&#12399;&#23455;&#34892;&#26178;&#12395;&#12463;&#12521;&#12473;&#12434;&#12456;&#12531;&#12495;&#12531;&#12473;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;&#12467;&#12540;&#12489;&#29983;&#25104;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#20351;&#12356;&#12414;&#12377;
                            &#65288;Java&#12398;&#12522;&#12501;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;&#32068;&#12415;&#21512;&#12431;&#12379;&#12390;&#34892;&#12356;&#12414;&#12377;&#65289;&#12290;
                        </td></tr><tr><td>
                            Commons Collections, Commons Logging&#65288;&#24517;&#38920;&#65289;
                        </td><td>
                            Hibernate&#12399;Apache Jakarta Commons&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12289;
                            &#12356;&#12429;&#12356;&#12429;&#12394;&#12518;&#12540;&#12486;&#12451;&#12522;&#12486;&#12451;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
                        </td></tr><tr><td>
                            ODMG4&#65288;&#24517;&#38920;&#65289;
                        </td><td>
                            Hibernate&#12399;&#12289;
                            &#12458;&#12503;&#12471;&#12519;&#12531;&#12398;ODMG&#28310;&#25312;&#12398;&#27704;&#32154;&#12510;&#12493;&#12540;&#12472;&#12515;&#12539;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
                            ODMG API&#12434;&#20351;&#12358;&#12388;&#12418;&#12426;&#12364;&#12394;&#12367;&#12390;&#12418;&#12289;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12377;&#12427;&#12394;&#12425;
                            &#12371;&#12428;&#12399;&#24517;&#35201;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;
                            &#12371;&#12398;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12391;&#12399;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12399;&#34892;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;
                            &#12356;&#12378;&#12428;&#12395;&#12379;&#12424;&#12371;&#12398;JAR&#12434;&#12467;&#12500;&#12540;&#12375;&#12390;&#12362;&#12367;&#12398;&#12399;&#33391;&#12356;&#32771;&#12360;&#12391;&#12377;&#12290;
                        </td></tr><tr><td>
                            EHCache&#65288;&#24517;&#38920;&#65289;
                        </td><td>
                            Hibernate&#12399;&#31532;2&#12524;&#12505;&#12523;&#12461;&#12515;&#12483;&#12471;&#12517;&#12398;&#12383;&#12417;&#12395;&#12289;
                            &#12356;&#12429;&#12356;&#12429;&#12394;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
                            &#35373;&#23450;&#12434;&#22793;&#26356;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;EHCache&#12364;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12539;&#12503;&#12525;&#12496;&#12452;&#12480;&#12391;&#12377;&#12290;
                        </td></tr><tr><td>
                            Log4j&#65288;&#12458;&#12503;&#12471;&#12519;&#12531;&#65289;
                        </td><td>
                            Hibernate&#12399;Commons Logging API&#12434;&#20351;&#12356;&#12414;&#12377;&#12364;&#12289;&#20195;&#12431;&#12426;&#12398;&#12525;&#12462;&#12531;&#12464;&#27231;&#27083;&#12392;&#12375;&#12390;&#12289;
                            Log4j&#12434;&#20351;&#12358;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
                            &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12521;&#12452;&#12502;&#12521;&#12522;&#12539;&#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12395;Log4j&#12521;&#12452;&#12502;&#12521;&#12522;&#12364;&#37197;&#32622;&#12373;&#12428;&#12427;&#12392;&#12289;
                            Commons Logging&#12399;Log4j&#12392;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12463;&#12521;&#12473;&#12497;&#12473;&#20013;&#12398; 
                            <tt class="literal">log4j.properties</tt> &#12434;&#20351;&#12358;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
                            Log4j&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#12469;&#12531;&#12503;&#12523;&#12364;&#12289;
                            Hibernate&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12395;&#12354;&#12426;&#12414;&#12377;&#12290;
                            &#12381;&#12398;&#12383;&#12417;&#12289;&#12418;&#12375;&#32972;&#24460;&#12391;&#20309;&#12364;&#34892;&#12431;&#12428;&#12390;&#12356;&#12427;&#12398;&#12363;&#30693;&#12426;&#12383;&#12369;&#12428;&#12400;&#12289;
                            &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12463;&#12521;&#12473;&#12497;&#12473;&#12395;log4j.jar&#12392;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;
                            &#65288;<tt class="literal">src/</tt> &#12363;&#12425;&#65289;&#12434;&#12467;&#12500;&#12540;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                        </td></tr><tr><td>
                            &#12381;&#12398;&#20182;
                        </td><td>
                            Hibernate&#12487;&#12451;&#12473;&#12488;&#12522;&#12499;&#12517;&#12540;&#12471;&#12519;&#12531;&#12398; 
                            <tt class="literal">lib/README.txt</tt> &#12501;&#12449;&#12452;&#12523;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
                            &#12371;&#12428;&#12399;Hibernate&#12392;&#19968;&#32210;&#12395;&#37197;&#24067;&#12373;&#12428;&#12390;&#12356;&#12427;&#12289;
                            &#12469;&#12540;&#12489;&#12497;&#12540;&#12486;&#12451;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#26368;&#26032;&#12398;&#12522;&#12473;&#12488;&#12391;&#12377;&#12290;
                            &#24517;&#38920;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#12392;&#12458;&#12503;&#12471;&#12519;&#12531;&#12398;&#12521;&#12452;&#12502;&#12521;&#12522;&#12398;&#12377;&#12409;&#12390;&#12434;&#12289;
                            &#12371;&#12371;&#12391;&#35211;&#12388;&#12369;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
                        </td></tr></tbody></table></div><p>
            &#20197;&#19978;&#12391;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12539;&#12503;&#12540;&#12522;&#12531;&#12464;&#12398;&#12475;&#12483;&#12488;&#12450;&#12483;&#12503;&#12364;&#32066;&#20102;&#12375;&#12289;
            Tomcat&#12392;Hibernate&#12398;&#20001;&#26041;&#12363;&#12425;&#20849;&#26377;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12375;&#12383;&#12290;
            &#12371;&#12428;&#12399;&#65288;&#32068;&#12415;&#36796;&#12415;&#12398;DBCP&#12503;&#12540;&#12522;&#12531;&#12464;&#27231;&#33021;&#12434;&#20351;&#12356;&#65289;
            Tomcat&#12364;&#12503;&#12540;&#12523;&#12373;&#12428;&#12383;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#25552;&#20379;&#12377;&#12427;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
            Hibernate&#12399;&#12289;JNDI&#12434;&#36890;&#12375;&#12390;&#12371;&#12398;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#35201;&#27714;&#12375;&#12414;&#12377;&#12290;
            Tomcat&#12399;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12539;&#12503;&#12540;&#12523;&#12434;JNDI&#12395;&#12496;&#12452;&#12531;&#12489;&#12375;&#12289;
            &#31169;&#12383;&#12385;&#12399;Tomcat&#12398;&#12513;&#12452;&#12531;&#12398;&#35373;&#23450;&#12501;&#12449;&#12452;&#12523; <tt class="literal">TOMCAT/conf/server.xml</tt> &#12395;&#12289;
            &#12522;&#12477;&#12540;&#12473;&#23450;&#32681;&#12434;&#36861;&#21152;&#12375;&#12414;&#12377;&#65306;
        </p><pre class="programlisting">&lt;Context path="/quickstart" docBase="quickstart"&gt;
    &lt;Resource name="jdbc/quickstart" scope="Shareable" type="javax.sql.DataSource"/&gt;
    &lt;ResourceParams name="jdbc/quickstart"&gt;
        &lt;parameter&gt;
            &lt;name&gt;factory&lt;/name&gt;
            &lt;value&gt;org.apache.commons.dbcp.BasicDataSourceFactory&lt;/value&gt;
        &lt;/parameter&gt;

        &lt;!-- DBCP&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12398;&#35373;&#23450; --&gt;
        &lt;parameter&gt;
            &lt;name&gt;url&lt;/name&gt;
            &lt;value&gt;jdbc:postgresql://localhost/quickstart&lt;/value&gt;
        &lt;/parameter&gt;
        &lt;parameter&gt;
            &lt;name&gt;driverClassName&lt;/name&gt;&lt;value&gt;org.postgresql.Driver&lt;/value&gt;
        &lt;/parameter&gt;
        &lt;parameter&gt;
            &lt;name&gt;username&lt;/name&gt;
            &lt;value&gt;quickstart&lt;/value&gt;
        &lt;/parameter&gt;
        &lt;parameter&gt;
            &lt;name&gt;password&lt;/name&gt;
            &lt;value&gt;secret&lt;/value&gt;
        &lt;/parameter&gt;

        &lt;!-- DBCP&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12539;&#12503;&#12540;&#12522;&#12531;&#12464;&#12539;&#12458;&#12503;&#12471;&#12519;&#12531; --&gt;
        &lt;parameter&gt;
            &lt;name&gt;maxWait&lt;/name&gt;
            &lt;value&gt;3000&lt;/value&gt;
        &lt;/parameter&gt;
        &lt;parameter&gt;
            &lt;name&gt;maxIdle&lt;/name&gt;
            &lt;value&gt;100&lt;/value&gt;
        &lt;/parameter&gt;
        &lt;parameter&gt;
            &lt;name&gt;maxActive&lt;/name&gt;
            &lt;value&gt;10&lt;/value&gt;
        &lt;/parameter&gt;
    &lt;/ResourceParams&gt;
&lt;/Context&gt;</pre><p>
			&#12371;&#12398;&#20363;&#12391;&#12399;&#12289;&#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#21517;&#12434; <tt class="literal">quickstart</tt> &#12395;&#12375;&#12414;&#12375;&#12383;&#12290;
			&#12381;&#12398;&#12505;&#12540;&#12473;&#12399; <tt class="literal">TOMCAT/webapp/quickstart</tt> &#12487;&#12451;&#12524;&#12463;&#12488;&#12522;&#12391;&#12377;&#12290;
			&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12395;&#12399;&#12289;
			&#12502;&#12521;&#12454;&#12470;&#12391; <tt class="literal">http://localhost:8080/quickstart</tt> &#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
			&#65288;&#12418;&#12385;&#12429;&#12435; <tt class="literal">web.xml</tt> &#12395;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12398;&#21517;&#21069;&#12434;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;&#65289;
			&#12414;&#12383;&#20197;&#19978;&#12391;&#12289;&#31354;&#12398; <tt class="literal">process()</tt> &#12434;&#25345;&#12388;&#21336;&#32020;&#12394;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12434;&#20316;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;
		</p><p>
            Tomcat&#12399;&#12371;&#12398;&#35373;&#23450;&#12395;&#22522;&#12389;&#12356;&#12390;&#12289;DBCP&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12539;&#12503;&#12540;&#12523;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
            &#12381;&#12375;&#12390; <tt class="literal">java:comp/env/jdbc/quickstart</tt> &#12395;&#12362;&#12356;&#12390;JNDI&#12434;&#36890;&#12375;&#12390;&#12289;
            &#12503;&#12540;&#12523;&#12373;&#12428;&#12383;JDBC <tt class="literal">Connection</tt> &#12434;&#25552;&#20379;&#12375;&#12414;&#12377;&#12290;
            &#12418;&#12375;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12539;&#12503;&#12540;&#12523;&#12434;&#20351;&#12387;&#12390;&#12356;&#12427;&#12392;&#12365;&#12395;&#12488;&#12521;&#12502;&#12523;&#12364;&#30330;&#29983;&#12377;&#12427;&#12424;&#12358;&#12394;&#12425;&#12289;
            Tomcat&#12398;&#12489;&#12461;&#12517;&#12513;&#12531;&#12488;&#12434;&#35211;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            &#12418;&#12375;JDBC&#12489;&#12521;&#12452;&#12496;&#12398;&#20363;&#22806;&#12513;&#12483;&#12475;&#12540;&#12472;&#12434;&#21463;&#12369;&#21462;&#12427;&#12424;&#12358;&#12394;&#12425;&#12289;
            &#12414;&#12378;Hibernate&#12394;&#12375;&#12391;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12539;&#12503;&#12540;&#12523;&#12434;&#36215;&#21205;&#12375;&#12390;&#12415;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            Tomcat&#12392;JDBC&#12398;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12399;&#12454;&#12455;&#12502;&#12363;&#12425;&#21033;&#29992;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><p>
            &#27425;&#12398;&#12473;&#12486;&#12483;&#12503;&#12399;&#12289;JNDI&#12496;&#12452;&#12531;&#12489;&#12398;&#12503;&#12540;&#12523;&#12363;&#12425;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#20351;&#12356;&#12289;Hibernate&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12391;&#12377;&#12290;
            &#12371;&#12398;&#20363;&#38988;&#12391;&#12399;&#12289;XML&#12505;&#12540;&#12473;&#12391;Hibernate&#12434;&#35373;&#23450;&#12375;&#12414;&#12377;&#12290;
            &#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#20351;&#12358;&#22522;&#26412;&#30340;&#12394;&#26041;&#27861;&#12391;&#12399;&#12289;&#27231;&#33021;&#12399;&#21516;&#12376;&#12418;&#12398;&#12398;&#12289;&#21033;&#28857;&#12364;&#12356;&#12367;&#12388;&#12363;&#25613;&#12394;&#12431;&#12428;&#12390;&#12375;&#12414;&#12356;&#12414;&#12377;&#12290;
            &#26222;&#36890;&#12399;&#12289;&#12424;&#12426;&#20415;&#21033;&#12394;XML&#12505;&#12540;&#12473;&#12391;&#35373;&#23450;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;
            XML&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;
            &#12467;&#12531;&#12486;&#12461;&#12473;&#12488;&#12539;&#12463;&#12521;&#12473;&#12497;&#12473;&#65288;<tt class="literal">WEB-INF/classes</tt>&#65289;&#12395;&#37197;&#32622;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            <tt class="literal">hibernate.cfg.xml</tt> &#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12426;&#12414;&#12377;&#65306;
        </p><pre class="programlisting">&lt;?xml version='1.0' encoding='utf-8'?&gt;
&lt;!DOCTYPE hibernate-configuration
    PUBLIC "-//Hibernate/Hibernate Configuration DTD//EN"
    "http://hibernate.sourceforge.net/hibernate-configuration-2.0.dtd"&gt;

&lt;hibernate-configuration&gt;

    &lt;session-factory&gt;

        &lt;property name="connection.datasource"&gt;java:comp/env/jdbc/quickstart&lt;/property&gt;
        &lt;property name="show_sql"&gt;false&lt;/property&gt;
        &lt;property name="dialect"&gt;net.sf.hibernate.dialect.PostgreSQLDialect&lt;/property&gt;

        &lt;!-- &#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523; --&gt;
        &lt;mapping resource="Cat.hbm.xml"/&gt;

    &lt;/session-factory&gt;

&lt;/hibernate-configuration&gt;</pre><p>
            &#12371;&#12371;&#12391;&#12399;SQL&#12467;&#12510;&#12531;&#12489;&#12398;&#12525;&#12462;&#12531;&#12464;&#12434;&#12458;&#12501;&#12395;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12414;&#12383;&#12289;&#12393;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;SQL&#26041;&#35328;&#12364;&#20351;&#12431;&#12428;&#12390;&#12356;&#12390;&#12289;
            &#12393;&#12371;&#12363;&#12425;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#25163;&#12395;&#20837;&#12428;&#12428;&#12400;&#33391;&#12356;&#12363;&#12434;
            &#65288;&#12487;&#12540;&#12479;&#12477;&#12540;&#12473;&#12539;&#12503;&#12540;&#12523;&#12364;&#12496;&#12452;&#12531;&#12489;&#12373;&#12428;&#12390;&#12356;&#12427;JNDI&#12398;&#12450;&#12489;&#12524;&#12473;&#12434;&#23450;&#32681;&#12377;&#12427;&#12371;&#12392;&#12391;&#65289;
            Hibernate&#12395;&#20253;&#12360;&#12414;&#12377;&#12290;
            &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12399;&#12289;SQL&#12300;&#27161;&#28310;&#12301;&#12398;&#35299;&#37320;&#12364;&#12381;&#12428;&#12382;&#12428;&#30064;&#12394;&#12387;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
            &#26041;&#35328;&#12434;&#35373;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
            Hibernate&#12399;&#12289;&#20027;&#35201;&#12394;&#12377;&#12409;&#12390;&#12398;&#21830;&#29992;&#12392;&#12458;&#12540;&#12503;&#12531;&#12477;&#12540;&#12473;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390;&#36949;&#12356;&#12434;&#12465;&#12450;&#12375;&#12289;
            &#12381;&#12428;&#12382;&#12428;&#12398;&#26041;&#35328;&#12395;&#23550;&#24540;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">SessionFactory</tt> &#12399;&#12289;&#12487;&#12540;&#12479;&#12473;&#12488;&#12450;1&#12388;&#12395;&#23550;&#24540;&#12377;&#12427;Hibernate&#12398;&#27010;&#24565;&#12391;&#12377;&#12290;
            XML&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#12434;&#35079;&#25968;&#29992;&#24847;&#12375;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391; <tt class="literal">Configuration</tt> &#12392; 
            <tt class="literal">SessionFactory</tt> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#35079;&#25968;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
            &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12434;&#35079;&#25968;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">hibernate.cfg.xml</tt> &#12398;&#26368;&#24460;&#12398;&#35201;&#32032;&#12391;&#12289;
            &#27704;&#32154;&#12463;&#12521;&#12473; <tt class="literal">Cat</tt> &#12398;&#12383;&#12417;&#12398;Hibernate XML&#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12398;&#21517;&#21069;&#12392;&#12375;&#12390;&#12289;
             <tt class="literal">Cat.hbm.xml</tt> &#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;POJO&#12463;&#12521;&#12473;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12486;&#12540;&#12502;&#12523;&#65288;&#12420;&#35079;&#25968;&#12398;&#12486;&#12540;&#12502;&#12523;&#65289;&#12408;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12395;&#23550;&#12377;&#12427;
            &#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
            &#12414;&#12383;&#12377;&#12368;&#12395;&#12371;&#12398;&#12501;&#12449;&#12452;&#12523;&#12395;&#25147;&#12387;&#12390;&#12367;&#12427;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
            &#12381;&#12428;&#12391;&#12399;POJO&#12463;&#12521;&#12473;&#12434;&#26360;&#12356;&#12390;&#12289;&#12513;&#12479;&#12487;&#12540;&#12479;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#23450;&#32681;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="quickstart-persistentclass"></a>1.2. &#26368;&#21021;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;</h2></div></div><div></div></div><p>
            &#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12289;&#12503;&#12524;&#12540;&#12531;&#12398;&#21476;&#12356;Java&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65288;POJO)&#12503;&#12525;&#12464;&#12521;&#12511;&#12531;&#12464;&#12539;&#12514;&#12487;&#12523;&#12391;&#12289;
            Hibernate&#12399;&#26368;&#12418;&#33391;&#12367;&#21205;&#20316;&#12375;&#12414;&#12377;
            &#65288;POJO&#12399;&#12289;&#12503;&#12524;&#12540;&#12531;&#12398;&#26222;&#36890;&#12398;Java&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12392;&#21628;&#12400;&#12428;&#12427;&#12371;&#12392;&#12418;&#12354;&#12426;&#12414;&#12377;&#65289;&#12290;
            &#12463;&#12521;&#12473;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12364;getter, setter&#12513;&#12477;&#12483;&#12489;&#12434;&#36890;&#12375;&#12390;&#12450;&#12463;&#12475;&#12473;&#21487;&#33021;&#12391;&#12354;&#12427;&#28857;&#12391;&#12289;
            POJO&#12399;JavaBean&#12395;&#22823;&#22793;&#33391;&#12367;&#20284;&#12390;&#12362;&#12426;&#12289;
            &#12497;&#12502;&#12522;&#12483;&#12463;&#12391;&#21487;&#35222;&#12398;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12363;&#12425;&#20869;&#37096;&#34920;&#29694;&#12434;&#20445;&#35703;&#12375;&#12414;&#12377;&#65306;
        </p><pre class="programlisting">package net.sf.hibernate.examples.quickstart;

public class Cat {

    private String id;
    private String name;
    private char sex;
    private float weight;

    public Cat() {
    }

    public String getId() {
        return id;
    }

    private void setId(String id) {
        this.id = id;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public char getSex() {
        return sex;
    }

    public void setSex(char sex) {
        this.sex = sex;
    }

    public float getWeight() {
        return weight;
    }

    public void setWeight(float weight) {
        this.weight = weight;
    }

}</pre><p>
            Hibernate&#12399;&#12289;&#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#22411;&#12395;&#20309;&#12434;&#20351;&#12358;&#12363;&#12395;&#12388;&#12356;&#12390;&#21046;&#38480;&#12375;&#12414;&#12379;&#12435;&#12290;
            Java&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12539;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12398;&#12463;&#12521;&#12473;&#12434;&#21547;&#12416;&#12289;&#12377;&#12409;&#12390;&#12398;Java JDK&#22411;&#12392;&#12503;&#12522;&#12511;&#12486;&#12451;&#12502;
            &#65288;<tt class="literal">String</tt>, <tt class="literal">char</tt>, <tt class="literal">Date</tt> &#12394;&#12393;&#65289;&#12434;
            &#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12365;&#12414;&#12377;&#12290;
            &#12381;&#12428;&#12425;&#12434;&#12496;&#12522;&#12517;&#12540;&#12420;&#12289;&#12496;&#12522;&#12517;&#12540;&#12398;&#12467;&#12524;&#12463;&#12471;&#12519;&#12531;&#12420;&#12289;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#12398;&#38306;&#36899;&#12392;&#12375;&#12390;&#12289;
            &#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12365;&#12414;&#12377;&#12290;
            <tt class="literal">id</tt> &#12399;&#12289;&#12463;&#12521;&#12473;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#35672;&#21029;&#23376;&#65288;&#20027;&#12461;&#12540;&#65289;&#12434;&#34920;&#12377;&#29305;&#21029;&#12394;&#12503;&#12525;&#12497;&#12486;&#12451;&#12391;&#12289;
            <tt class="literal">Cat</tt> &#12398;&#12424;&#12358;&#12394;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12395;&#12399;&#38750;&#24120;&#12395;&#12362;&#12377;&#12377;&#12417;&#12391;&#12377;&#12290;
            &#35672;&#21029;&#23376;&#12399;&#12289;Hibernate&#12364;&#20869;&#37096;&#30340;&#12395;&#20351;&#12358;&#12384;&#12369;&#12391;&#12418;&#27083;&#12356;&#12414;&#12379;&#12435;&#12364;&#12289;
            &#12381;&#12428;&#12391;&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;&#12398;&#25345;&#12388;&#26580;&#36575;&#24615;&#12434;&#12356;&#12367;&#12425;&#12363;&#22833;&#12358;&#12371;&#12392;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
        </p><p>
            &#27704;&#32154;&#12463;&#12521;&#12473;&#12399;&#12289;&#29305;&#21029;&#12394;&#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#23455;&#35013;&#12377;&#12427;&#24517;&#35201;&#12418;&#12289;
            &#29305;&#21029;&#12394;&#12523;&#12540;&#12488;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;&#12363;&#12425;&#12469;&#12502;&#12463;&#12521;&#12473;&#21270;&#12377;&#12427;&#24517;&#35201;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
            &#12414;&#12383;&#12289;Hibernate&#12399;&#12496;&#12452;&#12488;&#12467;&#12540;&#12489;&#25805;&#20316;&#12398;&#12424;&#12358;&#12394;&#12289;&#12499;&#12523;&#12489;&#26178;&#12398;&#12503;&#12525;&#12475;&#12473;&#12434;&#20351;&#12356;&#12414;&#12379;&#12435;&#12290;
            &#21807;&#19968;Java&#12398;&#12522;&#12501;&#12524;&#12463;&#12471;&#12519;&#12531;&#12392;&#12289;
            &#65288;CGLIB&#12434;&#36890;&#12375;&#12383;&#65289;&#23455;&#34892;&#26178;&#12398;&#12463;&#12521;&#12473;&#12539;&#12456;&#12531;&#12495;&#12531;&#12473;&#12513;&#12531;&#12488;&#12384;&#12369;&#12395;&#20381;&#23384;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12381;&#12398;&#12383;&#12417;Hibernate&#12395;&#20840;&#12367;&#20381;&#23384;&#12373;&#12379;&#12378;&#12289;POJO&#12463;&#12521;&#12473;&#12434;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12486;&#12540;&#12502;&#12523;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="quickstart-mapping"></a>1.3. &#12493;&#12467;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;</h2></div></div><div></div></div><p>
            <tt class="literal">Cat.hbm.xml</tt> &#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12501;&#12449;&#12452;&#12523;&#12399;&#12289;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;/&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;&#12510;&#12483;&#12500;&#12531;&#12464;&#12395;&#24517;&#35201;&#12394;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
            &#12513;&#12479;&#12487;&#12540;&#12479;&#12399;&#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#23450;&#32681;&#12392;&#12289;&#65288;&#12459;&#12521;&#12512;&#12420;&#20182;&#12398;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12408;&#12398;&#22806;&#37096;&#12461;&#12540;&#38306;&#20418;&#12398;&#12383;&#12417;&#12398;&#65289;
            &#12503;&#12525;&#12497;&#12486;&#12451;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12486;&#12540;&#12502;&#12523;&#12408;&#12398;&#12510;&#12483;&#12500;&#12531;&#12464;&#12434;&#21547;&#12435;&#12391;&#12356;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">&lt;?xml version="1.0"?&gt;
&lt;!DOCTYPE hibernate-mapping
    PUBLIC "-//Hibernate/Hibernate Mapping DTD//EN"
    "http://hibernate.sourceforge.net/hibernate-mapping-2.0.dtd"&gt;

&lt;hibernate-mapping&gt;

    &lt;class name="net.sf.hibernate.examples.quickstart.Cat" table="CAT"&gt;

        &lt;!-- 32 hex&#25991;&#23383;&#12399;&#20195;&#29702;&#12461;&#12540;&#12391;&#12377;&#12290;
        	&#12371;&#12428;&#12399;UUID&#12497;&#12479;&#12540;&#12531;&#12434;&#20351;&#12356;&#12289;Hibernate&#12364;&#33258;&#21205;&#29983;&#25104;&#12375;&#12414;&#12377;&#12290; --&gt;
        &lt;id name="id" type="string" unsaved-value="null" &gt;
            &lt;column name="CAT_ID" sql-type="char(32)" not-null="true"/&gt;
            &lt;generator class="uuid.hex"/&gt;
        &lt;/id&gt;

        &lt;!-- cat&#12395;&#12399;&#21517;&#21069;&#12364;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#12364;&#12289;&#38263;&#12377;&#12366;&#12427;&#21517;&#21069;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290; --&gt;
        &lt;property name="name"&gt;
            &lt;column name="NAME" length="16" not-null="true"/&gt;
        &lt;/property&gt;

        &lt;property name="sex"/&gt;

        &lt;property name="weight"/&gt;

    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>     
            &#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12463;&#12521;&#12473;&#12364;&#12289;&#35672;&#21029;&#23376;&#23646;&#24615;&#12434;&#25345;&#12388;&#12409;&#12365;&#12391;&#12377;
            &#65288;&#23455;&#38555;&#12395;&#12399;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#12467;&#12531;&#12509;&#12540;&#12493;&#12531;&#12488;&#12392;&#12375;&#12390;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12427;&#12398;&#12399;&#12289;
            &#20381;&#23384;&#12377;&#12427;&#12496;&#12522;&#12517;&#12540;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12399;&#12394;&#12367;&#12289;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;&#12434;&#34920;&#12377;&#12463;&#12521;&#12473;&#12384;&#12369;&#12391;&#12377;&#12290;&#65289;&#12290;
            &#12371;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12289;&#27704;&#32154;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#35672;&#21029;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12431;&#12428;&#12414;&#12377;&#65306;
            <tt class="literal">catA.getId().equals(catB.getId())</tt> &#12364;true&#12394;&#12425;&#12289;
            2&#12388;&#12398;cat&#12434;&#21516;&#12376;&#12418;&#12398;&#12392;&#12415;&#12394;&#12377;&#12371;&#12398;&#27010;&#24565;&#12399;&#12289;
            <span class="emphasis"><em>&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;</em></span> &#12392;&#21628;&#12400;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
            Hibernate&#12395;&#12399;&#12289;&#22810;&#27096;&#12394;&#12471;&#12490;&#12522;&#12458;&#12395;&#23550;&#24540;&#12377;&#12427;&#12289;&#12356;&#12429;&#12356;&#12429;&#12394;&#35672;&#21029;&#23376;&#12472;&#12455;&#12493;&#12524;&#12540;&#12479;&#12364;&#12496;&#12531;&#12489;&#12523;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;
            &#65288;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12471;&#12540;&#12465;&#12531;&#12473;&#12434;&#20351;&#12358;native&#12472;&#12455;&#12493;&#12524;&#12540;&#12479;&#12420;&#12289;hi/lo&#35672;&#21029;&#23376;&#12486;&#12540;&#12502;&#12523;&#12420;&#12289;
            &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20195;&#20837;&#35672;&#21029;&#23376;&#12394;&#12393;&#12364;&#12354;&#12426;&#12414;&#12377;&#65289;&#12290;
            &#12371;&#12398;&#20363;&#12391;&#12399;&#12289;UUID&#12472;&#12455;&#12493;&#12524;&#12540;&#12479;&#65288;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#29983;&#25104;&#12377;&#12427;&#25972;&#25968;&#12398;&#20195;&#29702;&#12461;&#12540;&#12398;&#26041;&#12364;&#22909;&#12414;&#12375;&#12356;&#12398;&#12391;&#12289;
            &#12371;&#12428;&#12399;&#12486;&#12473;&#12488;&#29992;&#12392;&#12375;&#12390;&#12384;&#12369;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#65289;&#12434;&#20351;&#12356;&#12289;
            &#12414;&#12383;&#65288;&#12486;&#12540;&#12502;&#12523;&#12398;&#20027;&#12461;&#12540;&#12392;&#12375;&#12390;&#65289;Hibernate&#12364;&#29983;&#25104;&#12377;&#12427;&#35672;&#21029;&#23376;&#12398;&#20516;&#12398;&#12383;&#12417;&#12398;&#12289;
            <tt class="literal">CAT</tt> &#12486;&#12540;&#12502;&#12523;&#12398; <tt class="literal">CAT_ID</tt> &#12459;&#12521;&#12512;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">Cat</tt> &#12398;&#20182;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12377;&#12409;&#12390;&#12289;&#21516;&#12376;&#12486;&#12540;&#12502;&#12523;&#12395;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290;
            <tt class="literal">name</tt> &#12503;&#12525;&#12497;&#12486;&#12451;&#12395;&#12388;&#12356;&#12390;&#12399;&#12289;
            &#26126;&#31034;&#30340;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12459;&#12521;&#12512;&#12434;&#23450;&#32681;&#12375;&#12390;&#12289;&#12510;&#12483;&#12500;&#12531;&#12464;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            Hibernate&#12398; <span class="emphasis"><em>SchemaExport</em></span> &#12484;&#12540;&#12523;&#12434;&#20351;&#12356;&#12289;
            &#12510;&#12483;&#12500;&#12531;&#12464;&#23450;&#32681;&#12363;&#12425;&#65288;SQL&#12398;DDL&#25991;&#12392;&#12375;&#12390;&#65289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12473;&#12461;&#12540;&#12510;&#12434;&#33258;&#21205;&#29983;&#25104;&#12377;&#12427;&#22580;&#21512;&#12289;
            &#12371;&#12428;&#12399;&#29305;&#12395;&#26377;&#29992;&#12391;&#12377;&#12290;
            &#20182;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12399;&#12377;&#12409;&#12390;&#12289;Hibernate&#12398;&#12487;&#12501;&#12457;&#12523;&#12488;&#12398;&#35373;&#23450;&#12434;&#20351;&#12356;&#12289;&#12510;&#12483;&#12500;&#12531;&#12464;&#12373;&#12428;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12399;&#26222;&#36890;&#12394;&#12425;&#26368;&#12418;&#26178;&#38291;&#12364;&#24517;&#35201;&#12395;&#12394;&#12427;&#12392;&#12371;&#12429;&#12391;&#12377;&#12290;
            &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398; <tt class="literal">CAT</tt> &#12486;&#12540;&#12502;&#12523;&#12399;&#12289;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12356;&#12414;&#12377;&#65306;
        </p><pre class="programlisting"> &#12459;&#12521;&#12512; |         &#22411;          | &#20462;&#39166;&#23376;
--------+-----------------------+-----------
 cat_id | character(32)         | not null
 name   | character varying(16) | not null
 sex    | character(1)          |
 weight | real                  |
Indexes: cat_pkey primary key btree (cat_id)</pre><p>
			&#12381;&#12428;&#12391;&#12399;&#12289;&#12371;&#12398;&#12486;&#12540;&#12502;&#12523;&#12434;&#25163;&#20316;&#26989;&#12391;&#20316;&#25104;&#12375;&#12414;&#12375;&#12423;&#12358;&#12290;
			&#12371;&#12398;&#12473;&#12486;&#12483;&#12503;&#12434;SchemaExport&#12484;&#12540;&#12523;&#12391;&#33258;&#21205;&#21270;&#12375;&#12383;&#12369;&#12428;&#12400;&#12289;
			&#24460;&#12391; <a href="toolsetguide.html" title="&#31532;15&#31456; &#12484;&#12540;&#12523;&#12475;&#12483;&#12488;&#65381;&#12460;&#12452;&#12489;">&#31456;&nbsp;15. <i>&#12484;&#12540;&#12523;&#12475;&#12483;&#12488;&#65381;&#12460;&#12452;&#12489;</i></a> &#12434;&#35501;&#12435;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
			&#12371;&#12398;&#12484;&#12540;&#12523;&#12399;&#12289;&#12486;&#12540;&#12502;&#12523;&#23450;&#32681;&#12289;&#12459;&#12473;&#12479;&#12512;&#12459;&#12521;&#12512;&#22411;&#21046;&#32004;&#12289;&#12518;&#12491;&#12540;&#12463;&#21046;&#32004;&#12289;&#12452;&#12531;&#12487;&#12483;&#12463;&#12473;&#12434;&#21547;&#12416;&#12289;
			&#23436;&#20840;&#12394;SQL DDL&#12434;&#20316;&#25104;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
    	</p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="quickstart-playingwithcats"></a>1.4. &#12493;&#12467;&#12392;&#36938;&#12406;</h2></div></div><div></div></div><p>
            &#12388;&#12356;&#12395;&#12289;Hibernate&#12398; <tt class="literal">Session</tt> &#12434;&#22987;&#12417;&#12427;&#28310;&#20633;&#12364;&#12391;&#12365;&#12414;&#12375;&#12383;&#12290;
            &#31169;&#12383;&#12385;&#12399;&#12289;<tt class="literal">Cat</tt> &#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12408;&#12398;&#20445;&#23384;&#12392;&#24489;&#20803;&#12398;&#12383;&#12417;&#12395;&#12289;
            <span class="emphasis"><em>&#27704;&#32154;&#12510;&#12493;&#12540;&#12472;&#12515;</em></span> &#12452;&#12531;&#12479;&#12540;&#12501;&#12455;&#12452;&#12473;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
            &#12375;&#12363;&#12375;&#12414;&#12378;&#12399;&#12289;<tt class="literal">SessionFactory</tt> &#12363;&#12425; 
            <tt class="literal">Session</tt>&#65288;Hibernate&#12398;&#20316;&#26989;&#21336;&#20301;&#65289;&#12434;&#21462;&#24471;&#12375;&#12394;&#12369;&#12428;&#12400;&#12356;&#12369;&#12414;&#12379;&#12435;&#65306;
        </p><pre class="programlisting">SessionFactory sessionFactory =
            new Configuration().configure().buildSessionFactory();</pre><p>
			<tt class="literal">SessionFactory</tt> &#12399;&#12289;1&#12388;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12384;&#12369;&#12395;&#36012;&#20219;&#12434;&#25345;&#12385;&#12289;
			1&#12388;&#12398;XML&#35373;&#23450;&#12501;&#12449;&#12452;&#12523;&#65288;<tt class="literal">hibernate.cfg.xml</tt>&#65289;&#12384;&#12369;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
			<tt class="literal">SessionFactory</tt>&#65288;&#12371;&#12428;&#12399;&#26356;&#26032;&#19981;&#33021;&#12391;&#12377;&#65289;&#12434;&#12499;&#12523;&#12489;&#12377;&#12427; <span class="emphasis"><em>&#21069;&#12395;</em></span> 
			<tt class="literal">Configuration</tt> &#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#12371;&#12392;&#12391;&#12289;
			&#20182;&#12398;&#12503;&#12525;&#12497;&#12486;&#12451;&#12434;&#35373;&#23450;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;
			&#65288;&#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12513;&#12479;&#12487;&#12540;&#12479;&#12434;&#22793;&#26356;&#12377;&#12427;&#12371;&#12392;&#12373;&#12360;&#21487;&#33021;&#12391;&#12377;&#65289;&#12290;
			&#12381;&#12428;&#12391;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#20013;&#12398;&#12393;&#12371;&#12391; <tt class="literal">SessionFactory</tt> &#12434;&#20316;&#25104;&#12375;&#12289;
			&#12393;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390;&#12381;&#12428;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12428;&#12400;&#12424;&#12356;&#12398;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;
        </p><p>
            &#26222;&#36890;&#12289;<tt class="literal">SessionFactory</tt> &#12399;1&#24230;&#12384;&#12369;&#12499;&#12523;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;
            &#20363;&#12360;&#12400; <span class="emphasis"><em>load-on-startup</em></span> &#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12398;&#12473;&#12479;&#12540;&#12488;&#12539;&#12450;&#12483;&#12503;&#12391;&#34892;&#12356;&#12414;&#12377;&#12290;
            &#12388;&#12414;&#12426;&#12371;&#12428;&#12399;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#20013;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#22793;&#25968;&#12391;&#12399;&#12394;&#12367;&#12289;
            &#12393;&#12371;&#12363;&#20182;&#12398;&#22580;&#25152;&#12395;&#20445;&#25345;&#12377;&#12409;&#12365;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12418;&#12354;&#12426;&#12414;&#12377;&#12290;
            &#12373;&#12425;&#12395;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12540;&#12489;&#12398;&#20013;&#12391;&#31777;&#21336;&#12395; <tt class="literal">SessionFactory</tt> &#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12424;&#12358;&#12289;
            &#12354;&#12427;&#31278;&#12398; <span class="emphasis"><em>&#12471;&#12531;&#12464;&#12523;&#12488;&#12531;</em></span> &#12364;&#24517;&#35201;&#12384;&#12392;&#12356;&#12358;&#12371;&#12392;&#12391;&#12377;&#12290;
            &#35373;&#23450;&#12398;&#21839;&#38988;&#12392;&#12289;<tt class="literal">SessionFactory</tt> &#12408;&#12398;&#23481;&#26131;&#12394;&#12450;&#12463;&#12475;&#12473;&#12398;&#21839;&#38988;&#12398;&#20001;&#26041;&#12434;&#12289;
            &#27425;&#12395;&#12362;&#35211;&#12379;&#12377;&#12427;&#26041;&#27861;&#12391;&#35299;&#27770;&#12375;&#12414;&#12377;&#12290;
		</p><p>
		    <tt class="literal">HibernateUtil</tt> &#12504;&#12523;&#12497;&#12539;&#12463;&#12521;&#12473;&#12434;&#23455;&#35013;&#12375;&#12414;&#12375;&#12383;&#65306;
		</p><pre class="programlisting">import net.sf.hibernate.*;
import net.sf.hibernate.cfg.*;

public class HibernateUtil {

    private static Log log = LogFactory.getLog(HibernateUtil.class);

    private static final SessionFactory sessionFactory;

    static {
        try {
            // SessionFactory&#12434;&#20316;&#25104;&#12375;&#12414;&#12377;
            sessionFactory = new Configuration().configure().buildSessionFactory();
        } catch (Throwable ex) {
            log.error("Initial SessionFactory creation failed.", ex);
            throw new ExceptionInInitializerError(ex);
        }
    }

    public static final ThreadLocal session = new ThreadLocal();

    public static Session currentSession() throws HibernateException {
        Session s = (Session) session.get();
        // &#12414;&#12384;&#12371;&#12398;Thread&#12395;&#23384;&#22312;&#12375;&#12394;&#12369;&#12428;&#12400;&#12289;&#26032;&#12375;&#12367;Session&#12434;&#12458;&#12540;&#12503;&#12531;&#12375;&#12414;&#12377;
        if (s == null) {
            s = sessionFactory.openSession();
            session.set(s);
        }
        return s;
    }

    public static void closeSession() throws HibernateException {
        Session s = (Session) session.get();
        session.set(null);
        if (s != null)
            s.close();
    }
}</pre><p>
			&#12371;&#12398;&#12463;&#12521;&#12473;&#12399;&#12289;static&#23646;&#24615;&#12392;&#12375;&#12390; <tt class="literal">SessionFactory</tt> &#12434;&#31649;&#29702;&#12377;&#12427;&#12384;&#12369;&#12391;&#12399;&#12394;&#12367;&#12289;
			&#29694;&#22312;&#23455;&#34892;&#20013;&#12398;&#12473;&#12524;&#12483;&#12489;&#12395;&#23550;&#12377;&#12427; <tt class="literal">Session</tt> &#12434;&#20445;&#25345;&#12377;&#12427; 
			<tt class="literal">ThreadLocal</tt> &#12434;&#25345;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
			&#12371;&#12398;&#12504;&#12523;&#12497;&#12434;&#20351;&#12358;&#21069;&#12395;&#12289;&#12473;&#12524;&#12483;&#12489;&#12539;&#12525;&#12540;&#12459;&#12523;&#22793;&#25968;&#12392;&#12356;&#12358;Java&#12398;&#27010;&#24565;&#12434;&#30906;&#23455;&#12395;&#29702;&#35299;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
		</p><p>
            <tt class="literal">SessionFactory</tt> &#12399;&#12473;&#12524;&#12483;&#12489;&#12475;&#12540;&#12501;&#12391;&#12354;&#12426;&#12289;&#22810;&#12367;&#12398;&#12473;&#12524;&#12483;&#12489;&#12364;&#21516;&#26178;&#20006;&#34892;&#30340;&#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12289;
            <tt class="literal">Session</tt> &#12434;&#12522;&#12463;&#12456;&#12473;&#12488;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
            <tt class="literal">Session</tt> &#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23550;&#12377;&#12427;1&#12388;&#12398;&#20316;&#26989;&#12398;&#21336;&#20301;&#12434;&#34920;&#12377;&#12289;
            &#12473;&#12524;&#12483;&#12489;&#12475;&#12540;&#12501;&#12391;&#12399;&#12394;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;
            <tt class="literal">Session</tt> &#12399; <tt class="literal">SessionFactory</tt> &#12395;&#12424;&#12387;&#12390;&#12458;&#12540;&#12503;&#12531;&#12373;&#12428;&#12289;
            &#12377;&#12409;&#12390;&#12398;&#20316;&#26989;&#12364;&#23436;&#20102;&#12375;&#12383;&#12392;&#12365;&#12395;&#12463;&#12525;&#12540;&#12474;&#12373;&#12428;&#12414;&#12377;&#65306;
        </p><pre class="programlisting">Session session = HibernateUtil.currentSession();

Transaction tx= session.beginTransaction();

Cat princess = new Cat();
princess.setName("Princess");
princess.setSex('F');
princess.setWeight(7.4f);

session.save(princess);
tx.commit();

HibernateUtil.closeSession();</pre><p>
            &#12354;&#12427;1&#12388;&#12398; <tt class="literal">Session</tt> &#12395;&#12362;&#12356;&#12390;&#12289;
            &#12377;&#12409;&#12390;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#25805;&#20316;&#12364;1&#12388;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#20869;&#12391;&#36215;&#12371;&#12426;&#12414;&#12377;
            &#65288;read-only&#25805;&#20316;&#12391;&#12373;&#12360;&#12391;&#12377;&#65289;&#12290;
            &#12505;&#12540;&#12473;&#12392;&#12394;&#12427;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#25126;&#30053;&#65288;&#31169;&#12383;&#12385;&#12398;&#22580;&#21512;&#12399;&#12289;JDBC&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#65289;&#12363;&#12425;&#25277;&#35937;&#21270;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
            Hibernate <tt class="literal">Transaction</tt> API&#12434;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12371;&#12398;&#12362;&#12363;&#12370;&#12391;&#20309;&#12418;&#22793;&#26356;&#12379;&#12378;&#12395;&#12289;
            &#12467;&#12540;&#12489;&#12434;&#65288;JTA&#12434;&#20351;&#12358;&#65289;&#12467;&#12531;&#12486;&#12490;&#31649;&#29702;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#19968;&#32210;&#12395;&#37197;&#32622;&#12391;&#12365;&#12414;&#12377;&#12290;
            &#19978;&#12395;&#12354;&#12370;&#12383;&#20363;&#12391;&#12289;&#20840;&#12367;&#20363;&#22806;&#20966;&#29702;&#12434;&#12375;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12395;&#27880;&#30446;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><p>
			&#12414;&#12383;&#12289;&#22909;&#12365;&#12394;&#12384;&#12369; <tt class="literal">HibernateUtil.currentSession();</tt> &#12434;&#12467;&#12540;&#12523;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
			&#12377;&#12427;&#12392;&#12289;&#24120;&#12395;&#12371;&#12398;&#12473;&#12524;&#12483;&#12489;&#12398;&#29694;&#26178;&#28857;&#12398; <tt class="literal">Session</tt> &#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;
			&#20316;&#26989;&#21336;&#20301;&#12364;&#23436;&#20102;&#12375;&#12383;&#24460;&#12289;HTTP&#12524;&#12473;&#12509;&#12531;&#12473;&#12364;&#36865;&#12425;&#12428;&#12427;&#12414;&#12391;&#12395;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12398;&#12467;&#12540;&#12489;&#12363;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12539;&#12501;&#12451;&#12523;&#12479;&#12398;&#20013;&#12391;&#12289;
			&#30906;&#23455;&#12395; <tt class="literal">Session</tt> &#12434;&#12463;&#12525;&#12540;&#12474;&#12375;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
			&#24460;&#32773;&#12398;&#12377;&#12400;&#12425;&#12375;&#12356;&#21103;&#20316;&#29992;&#12399;&#12289;&#31777;&#21336;&#12394;lazy&#21021;&#26399;&#21270;&#12391;&#12377;&#65306;
			&#12499;&#12517;&#12540;&#12364;&#12524;&#12531;&#12480;&#12522;&#12531;&#12464;&#12373;&#12428;&#12427;&#12392;&#12365;&#12289;<tt class="literal">Session</tt> &#12399;&#12414;&#12384;&#12458;&#12540;&#12503;&#12531;&#12375;&#12390;&#12356;&#12427;&#12398;&#12391;&#12289;
			&#12464;&#12521;&#12501;&#12398;&#12490;&#12499;&#12466;&#12540;&#12488;&#12398;&#38291;&#12289;Hibernate&#12399;&#21021;&#26399;&#21270;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12540;&#12489;&#12377;&#12427;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><p>
            Hibernate&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#24489;&#20803;&#12377;&#12427;&#12383;&#12417;&#12398;&#26041;&#27861;&#12434;&#12356;&#12429;&#12356;&#12429;&#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#26368;&#12418;&#26580;&#36575;&#12394;&#26041;&#27861;&#12399;&#12289;Hibernate&#12463;&#12456;&#12522;&#35328;&#35486;&#65288;HQL)&#12434;&#20351;&#12358;&#26041;&#27861;&#12391;&#12377;&#12290;
            &#12371;&#12428;&#12399;&#31777;&#21336;&#12395;&#32722;&#24471;&#12377;&#12427;&#12371;&#12392;&#12398;&#12391;&#12365;&#12427;&#12289;SQL&#12398;&#24375;&#21147;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#25313;&#24373;&#12391;&#12377;&#65306;
        </p><pre class="programlisting">Transaction tx = session.beginTransaction();

Query query = session.createQuery("select c from Cat as c where c.sex = :sex");
query.setCharacter("sex", 'F');
for (Iterator it = query.iterate(); it.hasNext();) {
    Cat cat = (Cat) it.next();
    out.println("Female Cat: " + cat.getName() );
}

tx.commit();</pre><p>
            Hibernate&#12399;&#12289;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12398; <span class="emphasis"><em>criteria&#12395;&#12424;&#12427;&#12463;&#12456;&#12522;</em></span> API&#12418;
            &#29992;&#24847;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;&#12371;&#12428;&#12399;&#12479;&#12452;&#12503;&#12539;&#12475;&#12540;&#12501;&#12394;&#12463;&#12456;&#12522;&#12434;&#23450;&#24335;&#21270;&#12377;&#12427;&#12383;&#12417;&#12395;&#20351;&#12360;&#12414;&#12377;&#12290;
            &#24403;&#28982;Hibernate&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12398;SQL&#12398;&#12420;&#12426;&#12392;&#12426;&#12398;&#12377;&#12409;&#12390;&#12395;&#12362;&#12356;&#12390;&#12289;
            <tt class="literal">PreparedStatement</tt> &#12392;&#12497;&#12521;&#12513;&#12540;&#12479;&#12539;&#12496;&#12452;&#12531;&#12487;&#12451;&#12531;&#12464;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
            &#20313;&#12426;&#12394;&#12356;&#12371;&#12392;&#12391;&#12377;&#12364;&#12289;Hibernate&#12391;&#30452;&#25509;SQL&#12463;&#12456;&#12522;&#12398;&#27231;&#33021;&#12434;&#20351;&#12358;&#12371;&#12392;&#12420;&#12289;
            <tt class="literal">Session</tt> &#12363;&#12425;&#12503;&#12524;&#12540;&#12531;&#12398;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#21462;&#24471;&#12377;&#12427;&#12371;&#12392;&#12418;&#21487;&#33021;&#12391;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="quickstart-summary"></a>1.5. &#32066;&#12431;&#12426;&#12395;</h2></div></div><div></div></div><p>
            &#12371;&#12398;&#23567;&#12373;&#12394;&#12481;&#12517;&#12540;&#12488;&#12522;&#12450;&#12523;&#12391;&#12399;&#12289;&#31169;&#12383;&#12385;&#12399;Hibernate&#12398;&#34920;&#38754;&#12434;&#24341;&#12387;&#25531;&#12356;&#12383;&#12395;&#36942;&#12366;&#12414;&#12379;&#12435;&#12290;
            &#12414;&#12383;&#20170;&#22238;&#12398;&#20363;&#12395;&#12399;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12395;&#29305;&#26377;&#12398;&#12467;&#12540;&#12489;&#12434;&#21547;&#12417;&#12394;&#12363;&#12387;&#12383;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            &#23455;&#38555;&#12395;&#12399;&#33258;&#20998;&#12391;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12434;&#20316;&#25104;&#12375;&#12289;Hibernate&#12398;&#12467;&#12540;&#12489;&#12434;&#36969;&#20999;&#12395;&#32068;&#12415;&#12371;&#12414;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p><p>
			&#12487;&#12540;&#12479;&#12539;&#12450;&#12463;&#12475;&#12473;&#23652;&#12392;&#12375;&#12390;&#12289;Hibernate&#12399;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12395;&#12375;&#12387;&#12363;&#12426;&#12392;&#32113;&#21512;&#12373;&#12428;&#12390;&#12356;&#12427;&#12371;&#12392;&#12434;
			&#24515;&#12395;&#30041;&#12417;&#12390;&#12362;&#12356;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
			&#26222;&#36890;&#12399;&#12289;&#20182;&#12398;&#23652;&#12398;&#12377;&#12409;&#12390;&#12364;&#12289;&#27704;&#32154;&#27231;&#27083;&#12395;&#20381;&#23384;&#12375;&#12414;&#12377;&#12290;
			&#12371;&#12398;&#35373;&#35336;&#12398;&#24847;&#21619;&#12377;&#12427;&#12392;&#12371;&#12429;&#12434;&#12289;&#30906;&#23455;&#12395;&#29702;&#35299;&#12377;&#12427;&#12424;&#12358;&#12395;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="preface.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="architecture.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#21069;&#26360;&#12365;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;2&#31456; &#12450;&#12540;&#12461;&#12486;&#12463;&#12481;&#12515;</td></tr></table></div></body></html>