<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#31532;10&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#21516;&#26178;&#20006;&#34892;&#24615;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="manipulatingdata.html" title="&#31532;9&#31456; &#27704;&#32154;&#12487;&#12540;&#12479;&#12398;&#25805;&#20316;"><link rel="next" href="queryhql.html" title="&#31532;11&#31456; HQL: Hibernate&#12463;&#12456;&#12522;&#35328;&#35486;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#31532;10&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#21516;&#26178;&#20006;&#34892;&#24615;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="manipulatingdata.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="queryhql.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr></table><hr></div><div class="chapter" lang="ja"><div class="titlepage"><div><div><h2 class="title"><a name="transactions"></a>&#31532;10&#31456; &#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12392;&#21516;&#26178;&#20006;&#34892;&#24615;</h2></div></div><div></div></div><p>
        Hibernate&#33258;&#20307;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12391;&#12399;&#12394;&#12367;&#12289;&#12521;&#12452;&#12488;&#12454;&#12455;&#12452;&#12488;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;/&#12522;&#12524;&#12540;&#12471;&#12519;&#12490;&#12523;&#12539;
        &#12510;&#12483;&#12500;&#12531;&#12464;&#12539;&#12484;&#12540;&#12523;&#12391;&#12377;&#12290;
        &#12381;&#12398;&#12383;&#12417;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#31649;&#29702;&#12399;&#12289;&#12505;&#12540;&#12473;&#12392;&#12394;&#12387;&#12390;&#12356;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12408;&#20219;&#12373;&#12428;&#12414;&#12377;&#12290;
        &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12364;JTA&#12395;&#30331;&#37682;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;
        <tt class="literal">Session</tt> &#12364;&#23455;&#34892;&#12377;&#12427;&#25805;&#20316;&#12399;&#12289;&#12424;&#12426;&#22823;&#12365;&#12394;JTA&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#19968;&#37096;&#12391;&#12377;&#12290;
        &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#25351;&#21521;&#12398;&#24847;&#21619;&#12434;&#36861;&#21152;&#12375;&#12383;JDBC&#12398;&#12471;&#12531;&#12539;&#12450;&#12480;&#12503;&#12479;&#12392;&#12375;&#12390;&#12289;Hibernate&#12434;&#25417;&#12360;&#12427;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;
    </p><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-basics"></a>10.1. Configuration&#12289;Session&#12289;Factory</h2></div></div><div></div></div><p>
            <tt class="literal">SessionFactory</tt> &#12399;&#29983;&#25104;&#12377;&#12427;&#12371;&#12392;&#12364;&#39640;&#20385;&#12391;&#12289;
            &#12473;&#12524;&#12483;&#12489;&#12475;&#12540;&#12501;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12391;&#12377;&#12290;
            &#12371;&#12428;&#12399;&#12377;&#12409;&#12390;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12473;&#12524;&#12483;&#12489;&#12391;&#20849;&#26377;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
            &#12381;&#12428;&#12395;&#23550;&#12375;&#12390; <tt class="literal">Session</tt> &#12399;&#39640;&#20385;&#12391;&#12399;&#12394;&#12367;&#12289;&#12473;&#12524;&#12483;&#12489;&#12475;&#12540;&#12501;&#12391;&#12418;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
            &#12371;&#12428;&#12399;1&#12388;&#12398;&#12499;&#12472;&#12493;&#12473;&#12539;&#12503;&#12525;&#12475;&#12473;&#12395;&#23550;&#12375;&#12390;1&#24230;&#12384;&#12369;&#20351;&#12431;&#12428;&#12390;&#12289;&#25448;&#12390;&#12425;&#12428;&#12427;&#12409;&#12365;&#12391;&#12377;&#12290;
            &#20363;&#12360;&#12400;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12539;&#12505;&#12540;&#12473;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;Hibernate&#12434;&#20351;&#12358;&#12392;&#12365;&#12289;
            &#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12375;&#12390; <tt class="literal">SessionFactory</tt> &#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
        </p><pre class="programlisting">SessionFactory sf = (SessionFactory)getServletContext().getAttribute("my.session.factory");</pre><p>
            &#12469;&#12540;&#12499;&#12473;&#12539;&#12513;&#12477;&#12483;&#12489;&#12408;&#12398;&#12467;&#12540;&#12523;&#12398;&#12383;&#12403;&#12395;&#12289;&#26032;&#12375;&#12367; <tt class="literal">Session</tt> &#12364;&#20316;&#25104;&#12373;&#12428;&#12289;
            <tt class="literal">flush()</tt> &#12373;&#12428;&#12289;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434; <tt class="literal">commit()</tt> &#12375;&#12289;
            <tt class="literal">close()</tt> &#12375;&#12390;&#12289;&#26368;&#24460;&#12395;&#12399;&#25448;&#12390;&#12425;&#12428;&#12414;&#12377;&#12290;
            &#65288;<tt class="literal">SessionFactory</tt> &#12399;&#12289;JNDI&#12420;&#12289;
            static&#12394; <span class="emphasis"><em>Singleton</em></span> &#12398;&#12504;&#12523;&#12497;&#22793;&#25968;&#12395;&#21462;&#12387;&#12390;&#12362;&#12367;&#12371;&#12392;&#12418;&#12391;&#12365;&#12414;&#12377;&#12290;&#65289;
        </p><p>
            &#12473;&#12486;&#12540;&#12488;&#12524;&#12473;&#12539;&#12475;&#12483;&#12471;&#12519;&#12531;&#12539;&#12499;&#12540;&#12531;&#12391;&#12418;&#21516;&#12376;&#12424;&#12358;&#12394;&#12450;&#12503;&#12525;&#12540;&#12481;&#12434;&#20351;&#12360;&#12414;&#12377;&#12290;
            &#12499;&#12540;&#12531;&#12399; <tt class="literal">setSessionContext()</tt> &#12391; <tt class="literal">SessionFactory</tt> &#12434;&#21462;&#24471;&#12375;&#12414;&#12377;&#12290;
            &#21508;&#12499;&#12472;&#12493;&#12473;&#12539;&#12513;&#12477;&#12483;&#12489;&#12391; <tt class="literal">Session</tt> &#12364;&#20316;&#25104;&#12373;&#12428;&#12289;<tt class="literal">flush()</tt> &#12373;&#12428;&#12289;
            <tt class="literal">close()</tt> &#12373;&#12428;&#12414;&#12377;&#12290;
            &#24403;&#28982;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434; <tt class="literal">commit()</tt> &#12377;&#12409;&#12365;&#12391;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
            &#65288;JTA&#12395;&#20219;&#12379;&#12427;&#12392;&#12289;&#12467;&#12531;&#12486;&#12490;&#31649;&#29702;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#33258;&#21205;&#30340;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12414;&#12377;&#12290;&#65289;
        </p><p>
            &#20197;&#21069;&#36848;&#12409;&#12383;Hiberante <tt class="literal">Transaction</tt> API&#12434;&#20351;&#12358;&#12371;&#12392;&#12395;&#12375;&#12414;&#12377;&#12290;
            Hibernate <tt class="literal">Transaction</tt> &#12398;1&#12388;&#12398; <tt class="literal">commit()</tt> &#12399;&#12289;
            &#29366;&#24907;&#12434;&#12501;&#12521;&#12483;&#12471;&#12517;&#12375;&#12289;&#65288;JTA&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#29305;&#21029;&#12394;&#25201;&#12356;&#12391;&#65289;
            &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">flush()</tt> &#12398;&#24847;&#21619;&#12434;&#30906;&#23455;&#12395;&#29702;&#35299;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
            &#12501;&#12521;&#12483;&#12471;&#12517;&#12399;&#12513;&#12514;&#12522;&#20869;&#37096;&#12398;&#22793;&#26356;&#12434;&#27704;&#32154;&#12473;&#12488;&#12450;&#12395;&#21516;&#26399;&#12373;&#12379;&#12414;&#12377;&#12364;&#12289;&#36870;&#12399;&#25104;&#12426;&#31435;&#12385; <span class="emphasis"><em>&#12414;&#12379;&#12435;</em></span>&#12290;
            &#12377;&#12409;&#12390;&#12398;HibernateJDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;/&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12289;
            &#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#20998;&#38626;&#12524;&#12505;&#12523;&#12364;Hibernate&#12364;&#23455;&#34892;&#12377;&#12427;
            &#12377;&#12409;&#12390;&#12398;&#25805;&#20316;&#12395;&#36969;&#29992;&#12373;&#12428;&#12427;&#12371;&#12392;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><p>
            &#27425;&#31680;&#12391;&#12399;&#12289;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12539;&#12450;&#12488;&#12511;&#12471;&#12486;&#12451;&#12434;&#30906;&#23455;&#12395;&#12377;&#12427;&#12418;&#12358;&#19968;&#12388;&#12398;&#26041;&#27861;&#12434;&#35696;&#35542;&#12375;&#12414;&#12377;
            &#65288;&#12496;&#12540;&#12472;&#12519;&#12531;&#20184;&#12369;&#12434;&#20351;&#12356;&#12414;&#12377;&#65289;&#12290;
            &#12371;&#12428;&#12399;&#12300;&#39640;&#24230;&#12394;&#12301;&#26041;&#27861;&#12394;&#12398;&#12391;&#12289;&#27880;&#24847;&#12375;&#12390;&#20351;&#12431;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-threads"></a>10.2. &#12473;&#12524;&#12483;&#12489;&#12392;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;</h2></div></div><div></div></div><p>
            Hibernate Session&#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;&#20197;&#19979;&#12398;&#35215;&#21063;&#12434;&#23432;&#12427;&#12409;&#12365;&#12391;&#12377;:
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#12289;&#35079;&#25968;&#12398;&#21516;&#26178;&#20006;&#34892; <tt class="literal">Session</tt> &#12420; 
                    <tt class="literal">Transaction</tt> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#20316;&#25104;&#12375;&#12394;&#12356;&#12290;
                </p></li><li><p>
                    &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12375;&#12390;&#35079;&#25968;&#12398; <tt class="literal">Session</tt> &#12434;&#20316;&#25104;&#12377;&#12427;&#12392;&#12365;&#12399;&#12289;
                    &#26997;&#12417;&#12390;&#24910;&#37325;&#12395;&#34892;&#12358;&#12290;
                    <tt class="literal">Session</tt> &#33258;&#20307;&#12399;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#21152;&#12360;&#12425;&#12428;&#12383;&#26356;&#26032;&#12434;&#35226;&#12360;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;
                    &#20182;&#12398; <tt class="literal">Session</tt> &#12399;&#21476;&#12356;&#12487;&#12540;&#12479;&#12434;&#35211;&#12390;&#12375;&#12414;&#12358;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
                </p></li><li><p>
                   <tt class="literal">Session</tt> &#12399;&#12473;&#12524;&#12483;&#12489;&#12475;&#12540;&#12501;&#12391;&#12399; <span class="emphasis"><em>&#12354;&#12426;&#12414;&#12379;&#12435;</em></span> &#12290;
                   &#12381;&#12398;&#12383;&#12417;&#12289;2&#12388;&#12398;&#21516;&#26178;&#20006;&#34892;&#12473;&#12524;&#12483;&#12489;&#12391;&#12289;&#21516;&#12376; <tt class="literal">Session</tt> &#12395;&#12450;&#12463;&#12475;&#12473;&#12375;&#12390;&#12399;&#12356;&#12369;&#12414;&#12379;&#12435;&#12290;
                   &#26222;&#36890; <tt class="literal">Session</tt> &#12399;&#12289;&#20316;&#26989;&#21336;&#20301;&#65288;unit-of-work&#65289;1&#12388;&#12395;&#12377;&#12366;&#12414;&#12379;&#12435;&#12290;
                </p></li></ul></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-identity"></a>10.3. &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;&#12398;&#32771;&#24942;</h2></div></div><div></div></div><p>
            &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;2&#12388;&#12398;&#30064;&#12394;&#12427;&#20181;&#20107;&#21336;&#20301;&#12391;&#12289;&#21516;&#12376;&#27704;&#32154;&#29366;&#24907;&#12395;&#20006;&#34892;&#12395;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12414;&#12377;&#12290;
            &#12375;&#12363;&#12375;&#27704;&#32154;&#12463;&#12521;&#12473;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12289;2&#12388;&#12398; <tt class="literal">Session</tt> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12391;&#20849;&#26377;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
            &#12388;&#12414;&#12426;&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;&#12395;&#23550;&#12377;&#12427;&#12289;2&#12388;&#12398;&#30064;&#12394;&#12427;&#32771;&#12360;&#26041;&#12364;&#12354;&#12426;&#12414;&#12377;&#65306;
        </p><div class="variablelist"><dl><dt><span class="term">&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;</span></dt><dd><p>
                        <tt class="literal">foo.getId().equals( bar.getId() )</tt>
                    </p></dd><dt><span class="term">JVM&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;</span></dt><dd><p>
                        <tt class="literal">foo==bar</tt>
                    </p></dd></dl></div><p>
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;1&#12388;&#12398; <span class="emphasis"><em>&#29305;&#23450;&#12398;</em></span> <tt class="literal">Session</tt> &#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#22580;&#21512;&#12399;&#12289;
            2&#12388;&#12398;&#32771;&#12360;&#26041;&#12399;&#31561;&#20385;&#12391;&#12377;&#12290;
            &#12375;&#12363;&#12375;2&#12388;&#12398;&#30064;&#12394;&#12427;Session&#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12300;&#21516;&#12376;&#12301;&#65288;&#27704;&#32154;&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;&#65289;
            &#12499;&#12472;&#12493;&#12473;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#20006;&#34892;&#12395;&#12450;&#12463;&#12475;&#12473;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;
            2&#12388;&#12398;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#23455;&#38555;&#12395;&#12399;&#12300;&#36949;&#12358;&#12418;&#12398;&#12301;&#12391;&#12377;&#65288;JVM&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;&#65289;&#12290;
        </p><p>
            &#12371;&#12398;&#26041;&#27861;&#12399;Hibernate&#12392;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#12289;&#21516;&#26178;&#20006;&#34892;&#24615;&#12434;&#20219;&#12379;&#12414;&#12377;&#12290;
            <tt class="literal">Session</tt> &#12395;&#23550;&#12375;&#12390;1&#12388;&#12398;&#12473;&#12524;&#12483;&#12489;&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12390;&#12356;&#12427;&#12363;&#12289;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12539;&#12450;&#12452;&#12487;&#12531;&#12486;&#12451;&#12486;&#12451;&#12391;&#12354;&#12427;&#38480;&#12426;&#12399;&#12289;
            &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12499;&#12472;&#12493;&#12473;&#12539;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21516;&#26399;&#12373;&#12379;&#12427;&#24517;&#35201;&#12399;&#20840;&#12367;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
            &#65288;1&#12388;&#12398; <tt class="literal">Session</tt> &#12391;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#27604;&#36611;&#12398;&#12383;&#12417;&#12395; 
            <tt class="literal">==</tt> &#12434;&#23433;&#20840;&#12395;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;&#65289;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-optimistic"></a>10.4. optimistic&#21516;&#26178;&#20006;&#34892;&#24615;&#21046;&#24481;</h2></div></div><div></div></div><p>
            &#12499;&#12472;&#12493;&#12473;&#12539;&#12503;&#12525;&#12475;&#12473;&#12398;&#22810;&#12367;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12463;&#12475;&#12473;&#12392;&#12518;&#12540;&#12470;&#12539;&#12452;&#12531;&#12479;&#12522;&#12540;&#12502;&#12398;
            &#19968;&#36899;&#12398;&#30456;&#20114;&#20316;&#29992;&#20840;&#20307;&#12434;&#24517;&#35201;&#12392;&#12375;&#12414;&#12377;&#12290;
            &#12454;&#12455;&#12502;&#12420;&#12456;&#12531;&#12479;&#12540;&#12503;&#12521;&#12452;&#12474;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12391;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12364;
            &#12518;&#12540;&#12470;&#12392;&#12398;&#23550;&#35441;&#12395;&#21450;&#12406;&#12371;&#12392;&#12399;&#35377;&#12373;&#12428;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            &#12499;&#12472;&#12493;&#12473;&#12539;&#12503;&#12525;&#12475;&#12473;&#12398;&#20998;&#38626;&#12398;&#32173;&#25345;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#23652;&#12398;&#36012;&#21209;&#12398;&#19968;&#37096;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
            &#12381;&#12398;&#12383;&#12417;&#12371;&#12398;&#12503;&#12525;&#12475;&#12473;&#12434; &#38263;&#12356;&#38291;&#23455;&#34892;&#12373;&#12428;&#12427; <span class="emphasis"><em>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;</em></span> &#12392;&#21628;&#12403;&#12414;&#12377;&#12290;
            1&#12388;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#12289;
            &#26222;&#36890;&#12356;&#12367;&#12388;&#12363;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;&#21450;&#12403;&#12414;&#12377;&#12290;
            &#12418;&#12375;&#12371;&#12428;&#12425;&#12398;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#65288;&#12398;&#26368;&#24460;&#12398;1&#12388;&#65289;&#12364;&#26356;&#26032;&#12373;&#12428;&#12383;&#12487;&#12540;&#12479;&#12434;&#26684;&#32013;&#12377;&#12428;&#12400;&#12289;
            &#12424;&#12426;&#12450;&#12488;&#12511;&#12483;&#12463;&#12395;&#12394;&#12426;&#12289;&#20182;&#12398;&#12377;&#12409;&#12390;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12399;&#21336;&#12395;&#12487;&#12540;&#12479;&#12434;&#35501;&#12416;&#12384;&#12369;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
        </p><p>
            &#39640;&#12356;&#21516;&#26178;&#20006;&#34892;&#24615;&#12392;&#12473;&#12465;&#12540;&#12521;&#12499;&#12522;&#12486;&#12451;&#12434;&#25345;&#12388;&#21807;&#19968;&#12398;&#26041;&#27861;&#12399;&#12289;
            &#12496;&#12540;&#12472;&#12519;&#12531;&#20184;&#12369;&#12434;&#20351;&#12358;optimistic&#12394;&#21516;&#26178;&#20006;&#34892;&#24615;&#21046;&#24481;&#12391;&#12377;&#12290;
            Hibernate&#12391;&#12399;optimistic&#21516;&#26178;&#20006;&#34892;&#24615;&#12434;&#20351;&#12358;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12467;&#12540;&#12489;&#12434;&#26360;&#12367;&#12383;&#12417;&#12398;&#26041;&#27861;&#12364;
            3&#31278;&#39006;&#29992;&#24847;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
        </p><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="transactions-optimistic-longsession"></a>10.4.1. &#33258;&#21205;&#12496;&#12540;&#12472;&#12519;&#12531;&#20184;&#12369;&#12434;&#20351;&#12358;&#38263;&#12356;Session</h3></div></div><div></div></div><p>
                1&#12388;&#12398; <tt class="literal">Session</tt> &#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12392;&#12381;&#12398;&#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12399;&#12289;
                &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#20840;&#20307;&#12395;&#28193;&#12387;&#12390;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;
            </p><p>
                <tt class="literal">Session</tt> &#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#20184;&#12369;&#12434;&#20351;&#12387;&#12383;&#27005;&#35251;&#30340;&#12525;&#12483;&#12463;&#12434;&#20351;&#12356;&#12289;
                &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#22810;&#12367;&#12364;1&#12388;&#12398;&#35542;&#29702;&#30340;&#12394;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12395;
                &#29694;&#12428;&#12427;&#12371;&#12392;&#12434;&#30906;&#23455;&#12395;&#12375;&#12414;&#12377;&#12290;
                &#12518;&#12540;&#12470;&#12392;&#12398;&#23550;&#35441;&#12434;&#24453;&#12388;&#38291;&#12289;<tt class="literal">Session</tt> &#12399;&#12505;&#12540;&#12473;&#12392;&#12394;&#12427;
                JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12392;&#20999;&#26029;&#12373;&#12428;&#12390;&#12356;&#12414;&#12377;&#12290;
                &#12371;&#12398;&#26041;&#27861;&#12399;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12463;&#12475;&#12473;&#12392;&#12356;&#12358;&#28857;&#12391;&#12399;&#26368;&#12418;&#21177;&#29575;&#30340;&#12391;&#12377;&#12290;
                &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12399;&#33258;&#36523;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12434;&#12481;&#12455;&#12483;&#12463;&#12377;&#12427;&#12371;&#12392;&#12418;&#12289;
                &#20999;&#12426;&#38626;&#12375;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12398;&#20877;&#25509;&#32154;&#12418;&#32771;&#24942;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
            </p><pre class="programlisting">// foo&#12399;&#20197;&#21069;&#12398;Session&#12391;&#12525;&#12540;&#12489;&#12375;&#12390;&#12356;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;
session.reconnect();
foo.setProperty("bar");
session.flush();
session.connection().commit();
session.disconnect();</pre><p>
                <tt class="literal">foo</tt> &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12381;&#12428;&#12434;&#12525;&#12540;&#12489;&#12375;&#12383; <tt class="literal">Session</tt> &#12434;&#12414;&#12384;&#30693;&#12387;&#12390;&#12356;&#12414;&#12377;&#12290;
                <tt class="literal">Session</tt> &#12364;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#25345;&#12388;&#12392;&#12377;&#12368;&#12395;&#12289;
                &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12377;&#12427;&#22793;&#26356;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12414;&#12377;&#12290;
            </p><p>
                <tt class="literal">Session</tt> &#12364;&#12518;&#12540;&#12470;&#12364;&#32771;&#12360;&#12427;&#26178;&#38291;&#12391;&#26684;&#32013;&#12377;&#12427;&#12395;&#12399;&#22823;&#12365;&#12377;&#12366;&#12427;&#12394;&#12425;&#12289;
                &#12371;&#12398;&#12497;&#12479;&#12540;&#12531;&#12399;&#21839;&#38988;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
                &#20363;&#12360;&#12400; <tt class="literal">HttpSession</tt> &#12399;&#12391;&#12365;&#12427;&#12384;&#12369;&#23567;&#12373;&#12367;&#20445;&#12383;&#12394;&#12369;&#12428;&#12400;&#12394;&#12426;&#12414;&#12379;&#12435;&#12290;
                <tt class="literal">Session</tt> &#12418;&#65288;&#24375;&#21046;&#30340;&#12394;&#65289;&#12501;&#12449;&#12540;&#12473;&#12488;&#12524;&#12505;&#12523;&#12539;&#12461;&#12515;&#12483;&#12471;&#12517;&#12391;&#12289;
                &#12377;&#12409;&#12390;&#12398;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#21547;&#12435;&#12391;&#12356;&#12427;&#12424;&#12358;&#12395;&#12289;
                &#12371;&#12398;&#25126;&#30053;&#12399;&#12522;&#12463;&#12456;&#12473;&#12488;/&#12524;&#12473;&#12509;&#12531;&#12473;&#12539;&#12469;&#12452;&#12463;&#12523;&#12364;&#23569;&#12394;&#12356;&#12392;&#12365;&#12384;&#12369;&#12395;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
                <tt class="literal">Session</tt>&gt; &#12399;&#12377;&#12368;&#12395;&#21476;&#12356;&#12487;&#12540;&#12479;&#12434;&#25345;&#12388;&#12424;&#12358;&#12395;&#12394;&#12427;&#12398;&#12391;&#12289;
                &#12371;&#12428;&#12434;&#24375;&#12367;&#12362;&#12377;&#12377;&#12417;&#12375;&#12414;&#12377;&#12290;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="transactions-optimistic-detached"></a>10.4.2. &#33258;&#21205;&#12496;&#12540;&#12472;&#12519;&#12531;&#20184;&#12369;&#12434;&#20351;&#12358;&#22810;&#12367;&#12398;Session</h3></div></div><div></div></div><p>
                &#27704;&#32154;&#12473;&#12488;&#12450;&#12392;&#12398;&#23550;&#35441;&#12399;&#12381;&#12428;&#12382;&#12428;&#12289;&#26032;&#12375;&#12356; <tt class="literal">Session</tt> &#12391;&#36215;&#12371;&#12426;&#12414;&#12377;&#12290;
                &#12375;&#12363;&#12375;&#21516;&#12376;&#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12364;&#12289;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12398;&#21508;&#23550;&#35441;&#12391;&#20877;&#21033;&#29992;&#12373;&#12428;&#12414;&#12377;&#12290;
                &#20803;&#12399;&#20182;&#12398; <tt class="literal">Session</tt> &#12391;&#12525;&#12540;&#12489;&#12373;&#12428;&#12383;&#20999;&#12426;&#38626;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12398;&#29366;&#24907;&#12434;&#12289;
                &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#25805;&#20316;&#12375;&#12414;&#12377;&#12290;
                &#12381;&#12375;&#12390; <tt class="literal">Session.update()</tt> &#12420; <tt class="literal">Session.saveOrUpdate()</tt> &#12434;&#20351;&#12356;&#12289;
                &#12381;&#12428;&#12425;&#12434;&#12300;&#20877;&#25509;&#32154;&#12301;&#12375;&#12414;&#12377;&#12290;
            </p><pre class="programlisting">// foo&#12399;&#20197;&#21069;&#12398;Session&#12391;&#12525;&#12540;&#12489;&#12375;&#12390;&#12356;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;
foo.setProperty("bar");
session = factory.openSession();
session.saveOrUpdate(foo);
session.flush();
session.connection().commit();
session.close();</pre><p>
                &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#26356;&#26032;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12364;&#30906;&#23455;&#12394;&#12425;&#12289;
                <tt class="literal">update()</tt> &#12398;&#20195;&#12431;&#12426;&#12395; <tt class="literal">lock()</tt> &#12434;&#12289;
                &#12381;&#12375;&#12390; <tt class="literal">LockMode.READ</tt> &#12434;&#20351;&#12358;&#12371;&#12392;&#12364;&#12391;&#12365;&#12414;&#12377;&#12290;
                &#65288;&#12377;&#12409;&#12390;&#12398;&#12461;&#12515;&#12483;&#12471;&#12517;&#12434;&#20351;&#12431;&#12378;&#12395;&#12289;&#12496;&#12540;&#12472;&#12519;&#12531;&#12539;&#12481;&#12455;&#12483;&#12463;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#65289;
            </p></div><div class="sect2" lang="ja"><div class="titlepage"><div><div><h3 class="title"><a name="transactions-optimistic-manual"></a>10.4.3. &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12496;&#12540;&#12472;&#12519;&#12531;&#12539;&#12481;&#12455;&#12483;&#12463;</h3></div></div><div></div></div><p>
                &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12392;&#12398;&#23550;&#35441;&#12399;&#26032;&#12375;&#12356; <tt class="literal">Session</tt> &#12391;&#36215;&#12371;&#12426;&#12414;&#12377;&#12290;
                &#12381;&#12371;&#12391;&#12399;&#25805;&#20316;&#12377;&#12427;&#21069;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12363;&#12425;&#12377;&#12409;&#12390;&#12398;&#27704;&#32154;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;&#12434;&#12522;&#12525;&#12540;&#12489;&#12375;&#12414;&#12377;&#12290;
                &#12371;&#12398;&#26041;&#27861;&#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#20998;&#38626;&#12434;&#30906;&#23455;&#12395;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
                &#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#33258;&#20998;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12481;&#12455;&#12483;&#12463;&#12434;&#23455;&#34892;&#12377;&#12427;&#12371;&#12392;&#12434;&#24375;&#21046;&#12375;&#12414;&#12377;&#12290;
                &#65288;&#12418;&#12385;&#12429;&#12435;Hibernate&#12399;&#12354;&#12394;&#12383;&#12398;&#12383;&#12417;&#12395;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12434; <span class="emphasis"><em>&#26356;&#26032;</em></span> &#12375;&#12414;&#12377;&#12290;&#65289;
                &#12371;&#12398;&#26041;&#27861;&#12399;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12450;&#12463;&#12475;&#12473;&#12398;&#28857;&#12391;&#12399;&#26368;&#12418;&#21177;&#29575;&#12364;&#24746;&#12356;&#12391;&#12377;&#12290;
                &#12371;&#12428;&#12399;&#12456;&#12531;&#12486;&#12451;&#12486;&#12451;EJB&#12395;&#26368;&#12418;&#12424;&#12367;&#20284;&#12390;&#12356;&#12414;&#12377;&#12290;
            </p><pre class="programlisting">// foo&#12399;&#20197;&#21069;&#12398;Session&#12391;&#12525;&#12540;&#12489;&#12375;&#12390;&#12356;&#12383;&#12452;&#12531;&#12473;&#12479;&#12531;&#12473;
session = factory.openSession();
int oldVersion = foo.getVersion();
session.load( foo, foo.getKey() );
if ( oldVersion!=foo.getVersion ) throw new StaleObjectStateException();
foo.setProperty("bar");
session.flush();
session.connection().commit();
session.close();</pre><p>
                &#12418;&#12385;&#12429;&#12435;&#12289;&#12418;&#12375;&#12487;&#12540;&#12479;&#21516;&#26178;&#20006;&#34892;&#24615;&#12398;&#20302;&#12356;&#29872;&#22659;&#12391;&#12496;&#12540;&#12472;&#12519;&#12531;&#12539;&#12481;&#12455;&#12483;&#12463;&#12364;&#24517;&#35201;&#12394;&#12369;&#12428;&#12400;&#12289;
                &#12371;&#12398;&#26041;&#27861;&#12434;&#20351;&#12356;&#12496;&#12540;&#12472;&#12519;&#12531;&#12539;&#12481;&#12455;&#12483;&#12463;&#12434;&#12473;&#12461;&#12483;&#12503;&#12391;&#12365;&#12414;&#12377;&#12290;
            </p></div></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-disconnection"></a>10.5. Session&#12398;&#20999;&#26029;</h2></div></div><div></div></div><p>
            &#19978;&#12391;&#36848;&#12409;&#12383;&#26368;&#21021;&#12398;&#26041;&#27861;&#12399;&#12289;&#12518;&#12540;&#12470;&#12398;&#32771;&#24942;&#26178;&#38291;&#12395;&#21450;&#12406;&#12499;&#12472;&#12493;&#12473;&#12539;&#12503;&#12525;&#12475;&#12473;&#20840;&#20307;&#12395;&#23550;&#12375;&#12390;&#12289;
            1&#12388;&#12398; <tt class="literal">Session</tt> &#12434;&#32173;&#25345;&#12377;&#12427;&#12418;&#12398;&#12391;&#12377;&#12290;
            &#65288;&#20363;&#12360;&#12400;&#12289;&#12469;&#12540;&#12502;&#12524;&#12483;&#12488;&#12399;&#12518;&#12540;&#12470;&#12398; <tt class="literal">HttpSession</tt> &#12391;1&#12388;&#12398; <tt class="literal">Session</tt> &#12434;&#20445;&#25345;&#12375;&#12414;&#12377;&#12290;&#65289;
            &#12497;&#12501;&#12457;&#12540;&#12510;&#12531;&#12473;&#12434;&#32771;&#24942;&#12377;&#12427;&#12392;&#20197;&#19979;&#12398;&#12424;&#12358;&#12395;&#12377;&#12409;&#12365;&#12391;&#12377;&#12290;
        </p><div class="orderedlist"><ol type="1" compact><li><p>
                    <tt class="literal">Transaction</tt> &#65288;&#12414;&#12383;&#12399;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#65289;&#12434;&#12467;&#12511;&#12483;&#12488;&#12375;&#12289;
                </p></li><li><p>
                    JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425; <tt class="literal">Session</tt> &#12434;&#20999;&#26029;&#12377;&#12427;
                </p></li></ol></div><p>
            &#12518;&#12540;&#12470;&#12398;&#34892;&#21205;&#12434;&#24453;&#12388;&#21069;&#12395;&#12289;&#12371;&#12428;&#12425;&#12434;&#34892;&#12356;&#12414;&#12377;&#12290;
            <tt class="literal">Session.disconnect()</tt> &#12513;&#12477;&#12483;&#12489;&#12399;&#12289;
            JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12363;&#12425;Session&#12434;&#20999;&#26029;&#12375;&#12289;
            &#65288;&#12418;&#12375;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#29992;&#24847;&#12375;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#65289;&#12503;&#12540;&#12523;&#12395;&#36820;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            <tt class="literal">Session.reconnect()</tt> &#12399;&#26032;&#12375;&#12356;&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12434;&#21462;&#24471;&#12375;
            &#65288;&#12414;&#12383;&#12399;&#33258;&#20998;&#12391;&#29992;&#24847;&#12375;&#65289;&#12289;Session&#12434;&#20877;&#38283;&#12375;&#12414;&#12377;&#12290;
            &#20877;&#25509;&#32154;&#12375;&#12383;&#12354;&#12392;&#12289;&#26356;&#26032;&#12375;&#12390;&#12356;&#12394;&#12356;&#12487;&#12540;&#12479;&#12398;&#12496;&#12540;&#12472;&#12519;&#12531;&#12539;&#12481;&#12455;&#12483;&#12463;&#12434;&#24375;&#21046;&#12377;&#12427;&#12383;&#12417;&#12395;&#12289;
            &#20182;&#12398;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12391;&#26356;&#26032;&#12373;&#12428;&#12383;&#12393;&#12435;&#12394;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390;&#12418; 
            <tt class="literal">Session.lock()</tt> &#12434;&#12467;&#12540;&#12523;&#12391;&#12365;&#12414;&#12377;&#12290;
            <span class="emphasis"><em>&#26356;&#26032;&#20013;&#12398;</em></span> &#12393;&#12435;&#12394;&#12487;&#12540;&#12479;&#12418;&#12525;&#12483;&#12463;&#12377;&#12427;&#24517;&#35201;&#12399;&#12354;&#12426;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            &#20197;&#19979;&#12399;&#12381;&#12398;&#20363;&#12391;&#12377;&#65306;
        </p><pre class="programlisting">SessionFactory sessions;
List fooList;
Bar bar;
....
Session s = sessions.openSession();

Transaction tx = null;
try {
    tx = s.beginTransaction();

    fooList = s.find(
    	"select foo from eg.Foo foo where foo.Date = current date"
        // DB2&#12398;date&#38306;&#25968;&#12434;&#20351;&#12356;&#12414;&#12377;
    );
    bar = (Bar) s.create(Bar.class);

    tx.commit();
}
catch (Exception e) {
    if (tx!=null) tx.rollback();
    s.close();
    throw e;
}
s.disconnect();</pre><p>
            &#12381;&#12398;&#24460;&#12391;&#65306;
        </p><pre class="programlisting">s.reconnect();

try {
    tx = s.beginTransaction();

    bar.setFooTable( new HashMap() );
    Iterator iter = fooList.iterator();
    while ( iter.hasNext() ) {
        Foo foo = (Foo) iter.next();
        s.lock(foo, LockMode.READ);    // foo&#12364;&#21476;&#12367;&#12394;&#12356;&#12371;&#12392;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12414;&#12377;
        bar.getFooTable().put( foo.getName(), foo );
    }

    tx.commit();
}
catch (Exception e) {
    if (tx!=null) tx.rollback();
    throw e;
}
finally {
    s.close();
}</pre><p>
            &#12371;&#12428;&#12363;&#12425; <tt class="literal">Transaction</tt> &#12392; <tt class="literal">Session</tt> &#12398;&#38291;&#12364;&#12393;&#12398;&#12424;&#12358;&#12394;many-to-one&#12391;&#12354;&#12427;&#12363;&#12289;
            <tt class="literal">Session</tt> &#12364;&#12393;&#12398;&#12424;&#12358;&#12395;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12392;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#38291;&#12398;
            &#23550;&#35441;&#12434;&#34920;&#29694;&#12377;&#12427;&#12363;&#12364;&#12431;&#12363;&#12427;&#12391;&#12375;&#12423;&#12358;&#12290;
            <tt class="literal">Transaction</tt> &#12399;&#23550;&#35441;&#12434;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12539;&#12524;&#12505;&#12523;&#12398;&#20181;&#20107;&#21336;&#20301;&#12395;&#20998;&#35299;&#12375;&#12414;&#12377;&#12290;
        </p></div><div class="sect1" lang="ja"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-locking"></a>10.6. &#24754;&#35251;&#30340;&#12525;&#12483;&#12463;</h2></div></div><div></div></div><p>
            &#12518;&#12540;&#12470;&#12364;&#12525;&#12483;&#12463;&#12398;&#25126;&#30053;&#12395;&#12388;&#12356;&#12390;&#26178;&#38291;&#12434;&#12363;&#12369;&#12390;&#32771;&#12360;&#12427;&#12392;&#12399;&#26399;&#24453;&#12375;&#12390;&#12356;&#12414;&#12379;&#12435;&#12290;
            &#26222;&#36890;&#12399;JDBC&#12467;&#12493;&#12463;&#12471;&#12519;&#12531;&#12395;&#23550;&#12377;&#12427;&#20998;&#38626;&#12524;&#12505;&#12523;&#12434;&#25351;&#23450;&#12375;&#12390;&#12289;
            &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#12377;&#12409;&#12390;&#12398;&#20181;&#20107;&#12434;&#20219;&#12379;&#12427;&#12371;&#12392;&#12391;&#21313;&#20998;&#12391;&#12377;&#12290;
            &#12375;&#12363;&#12375;&#39640;&#24230;&#12394;&#12518;&#12540;&#12470;&#12394;&#12425;&#12289;&#25490;&#20182;&#30340;&#12394;&#24754;&#35251;&#30340;&#12525;&#12483;&#12463;&#12420;&#12289;&#26032;&#12375;&#12356;&#12488;&#12521;&#12531;&#12470;&#12463;&#12471;&#12519;&#12531;&#12398;&#38283;&#22987;&#26178;&#12395;
            &#12525;&#12483;&#12463;&#12434;&#20877;&#21462;&#24471;&#12375;&#12383;&#12356;&#12392;&#24605;&#12358;&#12371;&#12392;&#12354;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
        </p><p>
            Hibernate&#12399;&#24120;&#12395;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12398;&#12525;&#12483;&#12463;&#27231;&#27083;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
            &#12381;&#12398;&#12383;&#12417;&#12289;&#12513;&#12514;&#12522;&#20013;&#12395;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#12525;&#12483;&#12463;&#12375;&#12394;&#12356;&#12391;&#12367;&#12384;&#12373;&#12356;&#12290;
        </p><p>
            <tt class="literal">LockMode</tt> &#12463;&#12521;&#12473;&#12399;&#12289;&#12373;&#12414;&#12374;&#12414;&#12394;&#12525;&#12483;&#12463;&#12398;&#12524;&#12505;&#12523;&#12434;&#23450;&#32681;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
            &#12381;&#12428;&#12425;&#12399;Hibernate&#12395;&#12424;&#12387;&#12390;&#21462;&#24471;&#12373;&#12428;&#12427;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
            &#12525;&#12483;&#12463;&#12399;&#20197;&#19979;&#12398;&#12424;&#12358;&#12394;&#27231;&#27083;&#12395;&#12424;&#12387;&#12390;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#65306;
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    <tt class="literal">LockMode.WRITE</tt> &#12399;Hibernate&#12364;&#34892;&#12434;&#26356;&#26032;&#12420;&#25407;&#20837;&#12377;&#12427;&#12392;&#12365;&#12289;&#33258;&#21205;&#30340;&#12395;&#21462;&#24471;&#12373;&#12428;&#12414;&#12377;&#12290;
                </p></li><li><p>
                    <tt class="literal">LockMode.UPGRADE</tt> &#12399;&#12371;&#12398;&#27083;&#25991;&#12434;&#12469;&#12509;&#12540;&#12488;&#12377;&#12427;&#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12395;&#23550;&#12375;&#12390;&#12289;
                    <tt class="literal">SELECT ... FOR UPDATE</tt> &#12434;&#20351;&#12356;&#12289;&#26126;&#31034;&#30340;&#12394;&#12518;&#12540;&#12470;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
                </p></li><li><p>
                    <tt class="literal">LockMode.UPGRADE_NOWAIT</tt> &#12399;Oracle&#12395;&#23550;&#12375;&#12390;&#12289;
                    <tt class="literal">SELECT ... FOR UPDATE NOWAIT</tt> &#12434;&#20351;&#12356;&#12289;&#26126;&#31034;&#30340;&#12394;&#12518;&#12540;&#12470;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12434;&#21462;&#24471;&#12391;&#12365;&#12414;&#12377;&#12290;
                </p></li><li><p>
                    <tt class="literal">LockMode.READ</tt> &#12399;Repeatable Read&#12414;&#12383;&#12399;Serializable&#12398;
                    &#20998;&#38626;&#12524;&#12505;&#12523;&#12391;&#12289;Hibernate&#12364;&#12487;&#12540;&#12479;&#12434;&#35501;&#12415;&#36796;&#12416;&#12392;&#12365;&#12395;&#33258;&#21205;&#30340;&#12395;&#21462;&#24471;&#12373;&#12428;&#12414;&#12377;&#12290;
                    &#26126;&#31034;&#30340;&#12394;&#12518;&#12540;&#12470;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12395;&#12424;&#12427;&#20877;&#21462;&#24471;&#12363;&#12418;&#12375;&#12428;&#12414;&#12379;&#12435;&#12290;
                </p></li><li><p>
            <tt class="literal">LockMode.NONE</tt> &#12399;&#12525;&#12483;&#12463;&#12373;&#12428;&#12390;&#12356;&#12394;&#12356;&#12371;&#12392;&#12434;&#34920;&#12375;&#12414;&#12377;&#12290;
            &#12377;&#12409;&#12390;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399; <tt class="literal">Transaction</tt> &#12398;&#32066;&#20102;&#26178;&#12395;&#12289;
            &#12371;&#12398;&#12525;&#12483;&#12463;&#12539;&#12514;&#12540;&#12489;&#12395;&#20999;&#12426;&#26367;&#12360;&#12425;&#12428;&#12414;&#12377;&#12290;
            <tt class="literal">update()</tt> &#12414;&#12383;&#12399; <tt class="literal">saveOrUpdate()</tt> &#12398;&#12467;&#12540;&#12523;&#12434;&#36890;&#12375;&#12390;
            Session&#12395;&#38306;&#36899;&#20184;&#12369;&#12425;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12418;&#12289;&#12371;&#12398;&#12525;&#12483;&#12463;&#12539;&#12514;&#12540;&#12489;&#12391;&#38283;&#22987;&#12373;&#12428;&#12414;&#12377;&#12290;
        </p></li></ul></div><p>
            &#12300;&#26126;&#31034;&#30340;&#12394;&#12518;&#12540;&#12470;&#12539;&#12522;&#12463;&#12456;&#12473;&#12488;&#12301;&#12399;&#20197;&#19979;&#12398;&#26041;&#27861;&#12398;1&#12388;&#12392;&#12375;&#12390;&#34920;&#29694;&#12373;&#12428;&#12414;&#12377;&#65306;
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    <tt class="literal">LockMode</tt> &#12434;&#25351;&#23450;&#12375;&#12383;&#12289;<tt class="literal">Session.load()</tt> &#12398;&#12467;&#12540;&#12523;&#12290;
                </p></li><li><p>
                    <tt class="literal">Session.lock()</tt> &#12398;&#12467;&#12540;&#12523;&#12290;
                </p></li><li><p>
                    <tt class="literal">Query.setLockMode()</tt> &#12398;&#12467;&#12540;&#12523;&#12290;
                </p></li></ul></div><p>
            <tt class="literal">Session.load()</tt> &#12364; <tt class="literal">UPGRADE</tt> &#12414;&#12383;&#12399; 
            <tt class="literal">UPGRADE_NOWAIT</tt> &#12391;&#12467;&#12540;&#12523;&#12373;&#12428;&#12289;
            &#12522;&#12463;&#12456;&#12473;&#12488;&#12373;&#12428;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12364;&#12414;&#12384;Session&#12395;&#12424;&#12387;&#12390;&#12525;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;
            &#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12399; <tt class="literal">SELECT ... FOR UPDATE</tt> &#12434;&#20351;&#12387;&#12390;&#12525;&#12540;&#12489;&#12373;&#12428;&#12414;&#12377;&#12290;
            &#12522;&#12463;&#12456;&#12473;&#12488;&#12375;&#12383;&#12418;&#12398;&#12424;&#12426;&#12418;&#20302;&#12356;&#21046;&#38480;&#12398;&#12525;&#12483;&#12463;&#12391;&#12377;&#12391;&#12395;&#12525;&#12540;&#12489;&#12373;&#12428;&#12390;&#12356;&#12383;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390; 
            <tt class="literal">load()</tt> &#12364;&#12467;&#12540;&#12523;&#12373;&#12428;&#12428;&#12400;&#12289;
            Hibernate&#12399;&#12381;&#12398;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12395;&#23550;&#12375;&#12390; <tt class="literal">lock()</tt> &#12434;&#12467;&#12540;&#12523;&#12375;&#12414;&#12377;&#12290;
        </p><p>
            &#12525;&#12483;&#12463;&#12539;&#12514;&#12540;&#12489;&#12364; <tt class="literal">READ</tt>, <tt class="literal">UPGRADE</tt>, 
            <tt class="literal">UPGRADE_NOWAIT</tt> &#12392;&#25351;&#23450;&#12373;&#12428;&#12390;&#12356;&#12428;&#12400;&#12289;
            <tt class="literal">Session.lock()</tt> &#12399;&#12496;&#12540;&#12472;&#12519;&#12531;&#30058;&#21495;&#12434;&#12481;&#12455;&#12483;&#12463;&#12375;&#12414;&#12377;
            &#65288; <tt class="literal">UPGRADE</tt> &#12414;&#12383;&#12399; <tt class="literal">UPGRADE_NOWAIT</tt> &#12398;&#22580;&#21512;&#12399;&#12289;
            <tt class="literal">SELECT ... FOR UPDATE</tt> &#12364;&#20351;&#12431;&#12428;&#12414;&#12377;&#12290;&#65289;&#12290;
        </p><p>
            &#12487;&#12540;&#12479;&#12505;&#12540;&#12473;&#12364;&#12522;&#12463;&#12456;&#12473;&#12488;&#12375;&#12383;&#12525;&#12483;&#12463;&#12539;&#12514;&#12540;&#12489;&#12395;&#23550;&#24540;&#12375;&#12390;&#12356;&#12394;&#12369;&#12428;&#12400;&#12289;
            Hibernate&#12399;&#65288;&#20363;&#22806;&#12434;&#12473;&#12525;&#12540;&#12377;&#12427;&#20195;&#12431;&#12426;&#12395;&#65289;&#20182;&#12398;&#36969;&#20999;&#12394;&#12514;&#12540;&#12489;&#12434;&#20351;&#12356;&#12414;&#12377;&#12290;
            &#12371;&#12428;&#12395;&#12424;&#12426;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12364;&#12509;&#12540;&#12479;&#12502;&#12523;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
        </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="manipulatingdata.html">&#21069;&#12398;&#12506;&#12540;&#12472;</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#19978;&#12395;&#25147;&#12427;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="queryhql.html">&#27425;&#12398;&#12506;&#12540;&#12472;</a></td></tr><tr><td width="40%" align="left" valign="top">&#31532;9&#31456; &#27704;&#32154;&#12487;&#12540;&#12479;&#12398;&#25805;&#20316;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#12507;&#12540;&#12512;</a></td><td width="40%" align="right" valign="top">&nbsp;&#31532;11&#31456; HQL: Hibernate&#12463;&#12456;&#12522;&#35328;&#35486;</td></tr></table></div></body></html>