<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="quickstart.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1041;&#1099;&#1089;&#1090;&#1088;&#1099;&#1081; &#1089;&#1090;&#1072;&#1088;&#1090; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Tomcat"><link rel="next" href="session-configuration.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; SessionFactory"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="quickstart.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="session-configuration.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="chapter" lang="ru"><div class="titlepage"><div><div><h2 class="title"><a name="architecture"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072;</h2></div></div><div></div></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="architecture-overview"></a>2.1. &#1054;&#1073;&#1079;&#1086;&#1088;</h2></div></div><div></div></div><p>
            &#1042;&#1099;&#1089;&#1086;&#1082;&#1086;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1074;&#1086;&#1077; (&#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1074;&#1086;&#1077;) &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1081; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1099; Hibernate:
        </p><div class="mediaobject" align="center"><img src="../shared/images/overview.gif" align="middle"></div><p>
            &#1069;&#1090;&#1072; &#1089;&#1093;&#1077;&#1084;&#1072; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;, &#1095;&#1090;&#1086; Hibernate &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (Database) &#1080;
            &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; (hiberanate.properties, XML mapping) &#1076;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;
            &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1086;&#1074;, &#1076;&#1077;&#1083;&#1072;&#1102;&#1097;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1084;&#1080; (Pesistent Objects), &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1077;&#1088;&#1074;&#1080;&#1089;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;
            &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; (Application).
        </p><p>
            &#1053;&#1072;&#1084; &#1073;&#1099; &#1093;&#1086;&#1090;&#1077;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1073;&#1086;&#1083;&#1077;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1099; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1077;&#1085;&#1080;&#1103;
            (runtime architecture).
            &#1058;.&#1082;. Hibernate &#1086;&#1095;&#1077;&#1085;&#1100; &#1075;&#1080;&#1073;&#1082;&#1080;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1086;&#1074; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1099;
            &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1084;&#1099; &#1087;&#1088;&#1086;&#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084; &#1076;&#1074;&#1072; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1082;&#1088;&#1072;&#1081;&#1085;&#1080;&#1093;. "&#1054;&#1073;&#1083;&#1077;&#1075;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102;" &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1091;
            &#1080;&#1084;&#1077;&#1102;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; Hibernate &#1089;&#1074;&#1086;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; JDBC-&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1089;&#1072;&#1084;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077;
            &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080;. &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1086;&#1076;&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; Hibernate API:
        </p><div class="mediaobject" align="center"><img src="../shared/images/lite.gif" align="middle"></div><p>
            &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; "&#1074;&#1089;&#1105; &#1074; &#1096;&#1086;&#1082;&#1086;&#1083;&#1072;&#1076;&#1077;" ("full cream") &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1075;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;
            &#1085;&#1080;&#1078;&#1077;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1093; JDBC/JTA API &#1080; &#1076;&#1072;&#1105;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; Hibernate &#1089;&#1072;&#1084;&#1086;&#1084;&#1091; &#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086;&#1073;&#1086; &#1074;&#1089;&#1077;&#1093;
            &#1076;&#1077;&#1090;&#1072;&#1083;&#1103;&#1093;.
        </p><div class="mediaobject" align="center"><img src="../shared/images/full_cream.gif" align="middle"></div><p>
            &#1042;&#1086;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; &#1089;&#1093;&#1077;&#1084;&#1072;&#1093;:

            </p><div class="variablelist"><dl><dt><span class="term">SessionFactory (<tt class="literal">net.sf.hibernate.SessionFactory</tt>)</span></dt><dd><p>
                            &#1055;&#1086;&#1090;&#1086;&#1082;&#1086;&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1081;, &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; (threadsafe, immutable) &#1082;&#1101;&#1096; &#1086;&#1090;&#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093;
                            &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1086;&#1074; &#1076;&#1083;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1060;&#1072;&#1073;&#1088;&#1080;&#1082;&#1072; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;
                            <tt class="literal">Session</tt> (Hibernate &#1089;&#1077;&#1089;&#1089;&#1080;&#1081;). <tt class="literal">SessionFactory</tt> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
                            &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1086;&#1084; &#1076;&#1083;&#1103; <tt class="literal">ConnectionProvider</tt>. <tt class="literal">SessionFactory</tt>
                            &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1101;&#1096; &#1076;&#1083;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080;
                            &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080;, &#1101;&#1090;&#1086;&#1090; &#1082;&#1101;&#1096; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1082;&#1101;&#1096; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; (second-level cache) &#1080;&#1083;&#1080;
                            &#1082;&#1101;&#1096; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; JVM (JVM-level cache). &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1082;&#1101;&#1096; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;
                            &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083; &#1082;&#1072;&#1082; &#1076;&#1083;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; (process-level) &#1090;&#1072;&#1082; &#1080; &#1076;&#1083;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1074; &#1074; &#1082;&#1083;&#1072;&#1089;&#1090;&#1077;&#1088;&#1077;
                            (cluster-level).
                        </p></dd><dt><span class="term">Session (<tt class="literal">net.sf.hibernate.Session</tt>)</span></dt><dd><p>
                            &#1054;&#1076;&#1085;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1099;&#1081;, &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1082;&#1086;&#1084; &#1084;&#1077;&#1078;&#1076;&#1091;
                            &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1077;&#1097;&#1077;&#1084; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1054;&#1073;&#1077;&#1088;&#1090;&#1082;&#1072; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075;
                            JDBC-&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;. &#1060;&#1072;&#1073;&#1088;&#1080;&#1082;&#1072; &#1076;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <tt class="literal">Transaction</tt>.
                            &#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1101;&#1096; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; (first-level cache) &#1076;&#1083;&#1103; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;,
                            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1085;&#1072;&#1074;&#1080;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;&#1084;&#1091; &#1075;&#1088;&#1072;&#1092;&#1091; &#1080;&#1083;&#1080; &#1076;&#1083;&#1103; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;
                            &#1087;&#1086; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1091;.
                        </p></dd><dt><span class="term">Persistent Objects and Collections</span></dt><dd><p>
                            &#1044;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1077; &#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1080; &#1050;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080;.
                            &#1054;&#1076;&#1085;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1099;&#1077;, &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1080;
                            &#1073;&#1080;&#1079;&#1085;&#1077;&#1089; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;. &#1069;&#1090;&#1086; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; JavaBean/POJO &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1086;&#1076;&#1085;&#1072; &#1080;&#1093; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103;
                            &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1101;&#1090;&#1086; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099; &#1089; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1077;&#1081; (<tt class="literal">Session</tt>).
                            &#1050;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1093; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1072;, &#1101;&#1090;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090;&#1089;&#1103; &#1086;&#1090;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; (detached) &#1080; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1084;&#1080;
                            &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072; &#1083;&#1102;&#1073;&#1086;&#1084; &#1089;&#1083;&#1086;&#1077;/&#1091;&#1088;&#1086;&#1074;&#1085;&#1077; (layer) &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1074;&#1077;&#1085;&#1085;&#1086;
                            &#1082;&#1072;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (data transfer objects) &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;
                            &#1080; &#1089; &#1085;&#1077;&#1075;&#1086;.
                        </p></dd><dt><span class="term">Transient Objects and Collections</span></dt><dd><p>
                            &#1042;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1080; &#1050;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080;.
                            &#1069;&#1082;&#1079;&#1077;&#1084;&#1083;&#1103;&#1088;&#1099; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; (persistent) &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1085;&#1077; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099;
                            &#1089; &#1089;&#1077;&#1089;&#1089;&#1080;&#1077;&#1081; (<tt class="literal">Session</tt>). &#1069;&#1090;&#1086; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1080;&#1085;&#1089;&#1090;&#1072;&#1085;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;
                            &#1080; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1077;&#1097;&#1077; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1077;&#1077; (persistent) &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1080;&#1083;&#1080; &#1086;&#1085;&#1080;
                            &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099;&#1090;&#1100; &#1080;&#1085;&#1089;&#1090;&#1072;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1077;&#1081; (TODO &#1082;&#1072;&#1082; &#1101;&#1090;&#1086;???).
                        </p></dd><dt><span class="term">Transaction (<tt class="literal">net.sf.hibernate.Transaction</tt>)</span></dt><dd><p>
                            &#1058;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103;.
                            &#1054;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1086;&#1076;&#1085;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1099;&#1081;, &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;
                            &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1072;&#1090;&#1086;&#1084;&#1072;&#1088;&#1085;&#1086;&#1081; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; (atomic unit of work).
                            &#1040;&#1073;&#1089;&#1090;&#1072;&#1075;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090; &#1085;&#1080;&#1078;&#1077;&#1083;&#1077;&#1097;&#1072;&#1097;&#1080;&#1093; JDBC, JTA &#1080;&#1083;&#1080; CORBA &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081;.
                            &#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1086;&#1076;&#1085;&#1072; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; (<tt class="literal">Session</tt>) &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1088;&#1086;&#1076;&#1080;&#1090;&#1100;
                            &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081;.
                        </p></dd><dt><span class="term">ConnectionProvider (<tt class="literal">net.sf.hibernate.connection.ConnectionProvider</tt>)</span></dt><dd><p>
                            &#1055;&#1086;&#1089;&#1090;&#1072;&#1074;&#1097;&#1080;&#1082; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081;.
                            &#1054;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1092;&#1072;&#1073;&#1088;&#1080;&#1082;&#1072; &#1080; &#1087;&#1091;&#1083; &#1076;&#1083;&#1103; JDBC-&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081;.
                            &#1040;&#1073;&#1089;&#1090;&#1088;&#1072;&#1075;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090; &#1085;&#1080;&#1078;&#1077;&#1083;&#1077;&#1097;&#1072;&#1097;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; <tt class="literal">Datasource</tt>
                            &#1080;&#1083;&#1080; <tt class="literal">DriverManager</tt>.
                            &#1069;&#1090;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; Hibernate, &#1086;&#1085; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;,
                            &#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;/&#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1084;.
                        </p></dd><dt><span class="term">TransactionFactory (<tt class="literal">net.sf.hibernate.TransactionFactory</tt>)</span></dt><dd><p>
                            &#1060;&#1072;&#1073;&#1088;&#1080;&#1082;&#1072; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081;.
                            &#1054;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1092;&#1072;&#1073;&#1088;&#1080;&#1082;&#1072; &#1076;&#1083;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <tt class="literal">Transaction</tt>.
                            &#1069;&#1090;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; Hibernate, &#1086;&#1085; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;,
                            &#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;/&#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1084;.
                        </p></dd></dl></div><p>
        </p><p>
            &#1042; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074;&#1099;&#1096;&#1077; "&#1086;&#1073;&#1083;&#1077;&#1075;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081;" &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1077;, &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;
            &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; API Hibernate:
            <tt class="literal">Transaction</tt>/<tt class="literal">TransactionFactory</tt>,
            <tt class="literal">ConnectionProvider</tt> API &#1080; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;
            JTA &#1080;&#1083;&#1080; JDBC &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;.
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="architecture-jmx"></a>2.2. &#1048;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089; JMX</h2></div></div><div></div></div><p>
            JMX -- &#1101;&#1090;&#1086; J2EE-&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; Java-&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;. Hibernate &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1084;
            &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1075;&#1086; JMX MBean, &#1085;&#1086; &#1090;.&#1082;. &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1077;&#1097;&#1077; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;
            JMX, &#1090;&#1086; &#1074; Hibernate &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077;&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1099; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;.
        </p><p>
            &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; web-&#1089;&#1072;&#1081;&#1090;&#1091; &#1079;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086; &#1090;&#1086;&#1084; &#1082;&#1072;&#1082; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; Hibernate
            &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1082;&#1072;&#1082; JMX-&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; JBoss.
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="architecture-jca"></a>2.3. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; JCA</h2></div></div><div></div></div><p>
            Hibernate &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1082;&#1072;&#1082; JCA-&#1082;&#1086;&#1085;&#1085;&#1077;&#1082;&#1090;&#1086;&#1088; (JCA connector).
            &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100; &#1082; web-&#1089;&#1072;&#1081;&#1090;&#1091; &#1079;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;.
        </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="quickstart.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="session-configuration.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1041;&#1099;&#1089;&#1090;&#1088;&#1099;&#1081; &#1089;&#1090;&#1072;&#1088;&#1090; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Tomcat&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top">&nbsp;&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; SessionFactory</td></tr></table></div></body></html>