<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#1043;&#1083;&#1072;&#1074;&#1072; 19. &#1051;&#1091;&#1095;&#1096;&#1080;&#1077; &#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1080; &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="example-mappings.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 18. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;: &#1056;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1052;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1080;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 19. &#1051;&#1091;&#1095;&#1096;&#1080;&#1077; &#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1080; &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="example-mappings.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;</td></tr></table><hr></div><div class="chapter" lang="ru"><div class="titlepage"><div><div><h2 class="title"><a name="best-practices"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 19. &#1051;&#1091;&#1095;&#1096;&#1080;&#1077; &#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1080; &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</h2></div></div><div></div></div><div class="variablelist"><dl><dt><span class="term">
                &#1057;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; "&#1084;&#1077;&#1083;&#1082;&#1086;&#1079;&#1077;&#1088;&#1085;&#1080;&#1089;&#1090;&#1099;&#1077;" (fine-grained) &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;  &#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1081;&#1090;&#1077; &#1080;&#1093; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;
                &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072; <tt class="literal">&lt;component&gt;</tt>.
            </span></dt><dd><p>
                    &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089; <tt class="literal">&#1040;&#1076;&#1088;&#1077;&#1089;</tt> &#1076;&#1083;&#1103; &#1080;&#1085;&#1082;&#1072;&#1087;&#1089;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;
                    <tt class="literal">&#1091;&#1083;&#1080;&#1094;&#1072;</tt>, <tt class="literal">&#1087;&#1088;&#1080;&#1075;&#1086;&#1088;&#1086;&#1076;</tt>, <tt class="literal">&#1096;&#1090;&#1072;&#1090;</tt>,
                    <tt class="literal">&#1087;&#1086;&#1095;&#1090;&#1086;&#1074;&#1099;&#1081; &#1082;&#1086;&#1076;</tt>. &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1084;&#1091; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1082;&#1086;&#1076;&#1072;
                    &#1080; &#1091;&#1087;&#1088;&#1086;&#1097;&#1072;&#1077;&#1090; &#1088;&#1077;&#1092;&#1072;&#1082;&#1090;&#1086;&#1088;&#1080;&#1085;&#1075;.
                </p></dd><dt><span class="term">&#1044;&#1083;&#1103; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; (persistent) &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1081;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;-&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1099;.</span></dt><dd><p>
                    &#1042; Hibernate &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;-&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1099; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1085;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;,
                    &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1080;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1052;&#1099; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1099; &#1073;&#1099;&#1083;&#1080; '&#1089;&#1080;&#1085;&#1090;&#1077;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080;'
                    (synthetic), &#1090;.&#1077;. &#1085;&#1077; &#1085;&#1077;&#1089;&#1091;&#1097;&#1080;&#1084;&#1080; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1089;&#1084;&#1099;&#1089;&#1083;&#1086;&#1074;&#1086;&#1081; &#1085;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1076;&#1083;&#1103; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;&#1072;; &#1090;&#1072;&#1082;&#1078;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084;,
                    &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1090;&#1086;&#1088;&#1099; &#1073;&#1099;&#1083;&#1080; &#1085;&#1077;&#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074;. &#1044;&#1083;&#1103; &#1084;&#1072;&#1082;&#1089;&#1082;&#1086;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1075;&#1080;&#1073;&#1086;&#1082;&#1086;&#1089;&#1090;&#1080;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077;
                    <tt class="literal">java.lang.Long</tt> &#1080;&#1083;&#1080; <tt class="literal">java.lang.String</tt>.
                </p></dd><dt><span class="term">&#1055;&#1086;&#1084;&#1077;&#1097;&#1072;&#1081;&#1090;&#1077; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;.</span></dt><dd><p>
                    &#1053;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1085;&#1086;&#1083;&#1080;&#1090;&#1085;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;-&#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072;.
                    &#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1081;&#1090;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089; <tt class="literal">com.eg.Foo</tt> &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; <tt class="literal">com/eg/Foo.hbm.xml</tt>.
                    &#1069;&#1090;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1089;&#1086;&#1073;&#1099;&#1081; &#1089;&#1084;&#1099;&#1089;&#1083; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1077;.
                </p></dd><dt><span class="term">&#1047;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1081;&#1090;&#1077; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1080; &#1082;&#1072;&#1082; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1099;.</span></dt><dd><p>
                    &#1056;&#1072;&#1079;&#1084;&#1077;&#1097;&#1072;&#1081;&#1090;&#1077; &#1084;&#1101;&#1087;&#1087;&#1080;&#1075;&#1080; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1085;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099;.
                </p></dd><dt><span class="term">&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;.</span></dt><dd><p>
                    &#1069;&#1090;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1072;&#1103; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096;&#1080; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; SQL-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1085;&#1077;&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; ANSI &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1091;.
                    &#1056;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1074; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;-&#1092;&#1072;&#1081;&#1083;&#1072;&#1093;, &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084;.
                </p></dd><dt><span class="term">&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; (bind variables).</span></dt><dd><p>
                    &#1050;&#1072;&#1082; &#1080; &#1074; JDBC, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1079;&#1072;&#1084;&#1077;&#1085;&#1103;&#1081;&#1090;&#1077; &#1085;&#1077;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084; "?". &#1053;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077;
                    &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1103;&#1094;&#1080;&#1081; &#1089;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1084;&#1080;, &#1076;&#1083;&#1103; &#1074;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080; &#1085;&#1077;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1074; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;! &#1048;&#1083;&#1080; &#1077;&#1097;&#1077; &#1083;&#1091;&#1095;&#1096;&#1077;,
                    &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; (named parameters) &#1074; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;&#1093;.
                </p></dd><dt><span class="term">&#1053;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1080; &#1085;&#1077; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1081;&#1090;&#1077; &#1089;&#1074;&#1086;&#1080;&#1084;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; JDBC-&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;.</span></dt><dd><p>
                    Hibernate &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; JDBC-&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1103;&#1084;&#1080;, &#1085;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
                    &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1089;&#1072;&#1084;&#1099;&#1093; &#1082;&#1088;&#1072;&#1081;&#1085;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077;
                    &#1087;&#1088;&#1086;&#1074;&#1072;&#1081;&#1076;&#1077;&#1088;&#1099; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; (connections providers), &#1086;&#1073;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;
                    &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; <tt class="literal">net.sf.hibernate.connection.ConnectionProvider</tt>.
                </p></dd><dt><span class="term">&#1054;&#1073;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; (custom types).</span></dt><dd><p>
                    &#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084; &#1091; &#1074;&#1072;&#1089; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; Java-&#1090;&#1080;&#1087;, &#1089;&#1082;&#1072;&#1078;&#1077;&#1084; &#1080;&#1079; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1083;&#1080;&#1073;&#1086; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;
                    &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1084;, &#1085;&#1086; &#1101;&#1090;&#1086;&#1090; &#1090;&#1080;&#1087; &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; (accessors) &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093;
                    &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1084;&#1101;&#1087;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1082;&#1072;&#1082; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; (component). &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1089; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081;
                    <tt class="literal">net.sf.hibernate.UserType</tt>. &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1086;&#1089;&#1074;&#1086;&#1073;&#1086;&#1078;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1087;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;
                    &#1086;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; Java-&#1090;&#1080;&#1087;&#1072; &#1074; Hibernate-&#1090;&#1080;&#1087; &#1080; &#1085;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;.
                </p></dd><dt><span class="term">&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1081; &#1088;&#1091;&#1082;&#1072;&#1084;&#1080; JDBC-&#1082;&#1086;&#1076; &#1074; "&#1091;&#1079;&#1082;&#1080;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;" &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;.</span></dt><dd><p>
                    &#1042; &#1082;&#1088;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1087;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093; &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1087;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093;
                    &#1074;&#1080;&#1076;&#1086;&#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1084;&#1072;&#1089;&#1089;&#1086;&#1074;&#1099;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;/&#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103;), &#1074;&#1072;&#1096;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;
                    &#1074;&#1099;&#1080;&#1075;&#1088;&#1099;&#1096; &#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; JDBC-&#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1074; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;.
                    &#1053;&#1086; &#1087;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072; <span class="emphasis"><em>&#1091;&#1076;&#1086;&#1089;&#1090;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077;&#1089;&#1100;</em></span> &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; "&#1091;&#1079;&#1082;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;" &#1074;&#1072;&#1096;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;.
                    &#1048; &#1085;&#1077; &#1089;&#1090;&#1086;&#1080;&#1090; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1095;&#1090;&#1086; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; JDBC-&#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1074; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;.
                    &#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; JDBC-&#1074;&#1099;&#1079;&#1086;&#1074;&#1099; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;, &#1090;&#1086; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1101;&#1090;&#1086;
                    &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1085;&#1086;&#1074;&#1091;&#1102; Hibernate-&#1089;&#1077;&#1089;&#1089;&#1080;&#1102; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1105; JDBC-&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
                    &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1076;&#1080;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1102; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081; &#1080; &#1085;&#1080;&#1078;&#1077;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1081; &#1087;&#1088;&#1086;&#1074;&#1072;&#1081;&#1076;&#1077;&#1088; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081;.
                </p></dd><dt><span class="term">&#1056;&#1072;&#1079;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077;&#1089;&#1100; &#1089; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1077;&#1081; <tt class="literal">Session.flush()</tt>.</span></dt><dd><p>
                    &#1042;&#1088;&#1077;&#1084;&#1103; &#1086;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;
                    (&#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;) &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
                    &#1045;&#1089;&#1083;&#1080; &#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1095;&#1077;&#1085;&#1100; &#1095;&#1072;&#1089;&#1090;&#1086;, &#1101;&#1090;&#1086; &#1089;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;.
                    &#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1084;&#1080;&#1085;&#1080;&#1084;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1085;&#1091;&#1078;&#1085;&#1099;&#1077; &#1074;&#1099;&#1079;&#1086;&#1074;&#1099; <tt class="literal">Session.flush()</tt> &#1087;&#1091;&#1090;&#1077;&#1084;
                    &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;
                    &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;.
                </p></dd><dt><span class="term">&#1042; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093; &#1089; &#1090;&#1088;&#1105;&#1093;&#1079;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081;, &#1086;&#1073;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <tt class="literal">saveOrUpdate()</tt>.</span></dt><dd><p>
                    &#1055;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; servlet / session bean &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1099;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;,
                    &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; session bean'&#1077;, &#1074; servlet / JSP &#1089;&#1083;&#1086;&#1081;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1085;&#1086;&#1074;&#1091;&#1102; Hibernate-&#1089;&#1077;&#1089;&#1089;&#1080;&#1102;
                    &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1074;&#1099;&#1079;&#1086;&#1074; <tt class="literal">Session.update()</tt> &#1080;&#1083;&#1080;
                    <tt class="literal">Session.saveOrUpdate()</tt> &#1076;&#1083;&#1103; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1077;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;.
                </p></dd><dt><span class="term">
                &#1042; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093; &#1089; &#1076;&#1074;&#1091;&#1093;&#1079;&#1074;&#1077;&#1085;&#1085;&#1086;&#1081; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081;, &#1086;&#1073;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;
                (session disconnection).
            </span></dt><dd><p>
                    &#1044;&#1083;&#1103; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1080;&#1083;&#1091;&#1095;&#1096;&#1077;&#1075;&#1086; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1058;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080; &#1059;&#1088;&#1086;&#1074;&#1085;&#1103; &#1041;&#1072;&#1079; &#1044;&#1072;&#1085;&#1085;&#1099;&#1093; (Database Transactions)
                    &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1084;&#1080;. &#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1095;&#1072;&#1089;&#1090;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
                    &#1076;&#1086;&#1083;&#1075;&#1086;&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1058;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080; &#1059;&#1088;&#1086;&#1074;&#1085;&#1103; &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; (long running Application Transactions), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077;
                    &#1089;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1103;&#1090; &#1082;&#1072;&#1082; &#1077;&#1076;&#1080;&#1085;&#1072;&#1103; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072;-&#1088;&#1072;&#1073;&#1086;&#1090;&#1099; (single unit-of-work). &#1044;&#1072;&#1085;&#1085;&#1099;&#1077; &#1058;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;
                    &#1059;&#1088;&#1086;&#1074;&#1085;&#1103; &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; (Application Transaction) &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099; &#1074; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1094;&#1080;&#1082;&#1083;&#1072;&#1093; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;-&#1086;&#1090;&#1074;&#1077;&#1090;.
                    &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1083;&#1080;&#1073;&#1086; &#1054;&#1090;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; (Detached Objects), &#1083;&#1080;&#1073;&#1086;, &#1074; &#1076;&#1074;&#1091;&#1093;&#1079;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093;, &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
                    &#1086;&#1090;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1077; (<tt class="literal">Session.disconnect()</tt>) Hibernate-&#1089;&#1077;&#1089;&#1089;&#1080;&#1102; &#1086;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086;
                    JDBC-&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1076;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1081;&#1090;&#1077; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102; (<tt class="literal">Session.reconnect()</tt>)
                    &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;. &#1053;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1077;&#1076;&#1080;&#1085;&#1091;&#1102; Hibernate-&#1089;&#1077;&#1089;&#1089;&#1080;&#1102; &#1076;&#1083;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077;
                    &#1095;&#1077;&#1084; &#1086;&#1076;&#1085;&#1086;&#1081; &#1058;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080; &#1059;&#1088;&#1086;&#1074;&#1085;&#1103; &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; (Application Transaction usecase); &#1048;&#1085;&#1072;&#1095;&#1077; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
                    &#1089;&#1090;&#1086;&#1083;&#1082;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1096;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (stale data), &#1090;.&#1082;. Hibernate-&#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
                    &#1082;&#1101;&#1096;&#1077;&#1084; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;.
                </p></dd><dt><span class="term">&#1053;&#1077; &#1089;&#1090;&#1086;&#1080;&#1090; &#1090;&#1088;&#1072;&#1082;&#1090;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1080;&#1090;&#1091;&#1094;&#1080;&#1080; (exceptions) &#1082;&#1072;&#1082; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; (recoverable).</span></dt><dd><p>
                    &#1069;&#1090;&#1086; &#1089;&#1082;&#1086;&#1088;&#1077;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1072;&#1103;, &#1095;&#1077;&#1084; "&#1083;&#1091;&#1095;&#1096;&#1072;&#1103;" &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103;
                    &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;, &#1086;&#1090;&#1082;&#1072;&#1090;&#1080;&#1090;&#1077; &#1090;&#1077;&#1082;&#1097;&#1091;&#1102; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1102; (<tt class="literal">Transaction.rollback()</tt>) &#1080; &#1079;&#1072;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077;
                    Hibernate-&#1089;&#1077;&#1089;&#1089;&#1080;&#1102; (<tt class="literal">Session.close()</tt>). &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077;, Hibernate &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;
                    &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1095;&#1090;&#1086; &#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; (&#1074; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;) &#1090;&#1086;&#1095;&#1085;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;
                    &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1050;&#1072;&#1082; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1086;&#1089;&#1086;&#1073;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074;, &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; <tt class="literal">Session.load()</tt>
                    &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1083;&#1080; &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084;; &#1074;&#1079;&#1072;&#1084;&#1077;&#1085;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077;
                    &#1074;&#1099;&#1079;&#1086;&#1074; <tt class="literal">find()</tt> &#1080;&#1083;&#1080; <tt class="literal">get()</tt>. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;
                    &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1084;&#1080; (recoverable), &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <tt class="literal">StaleObjectStateException</tt> &#1080;
                    <tt class="literal">ObjectNotFoundException</tt>.
                </p></dd><dt><span class="term">&#1044;&#1083;&#1103; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1081; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1102; "&#1083;&#1077;&#1085;&#1080;&#1074;&#1086;&#1081;" &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (lazy fetching).</span></dt><dd><p>
                    &#1054;&#1073;&#1076;&#1091;&#1084;&#1072;&#1085;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1102; &#1087;&#1086;&#1083;&#1085;&#1086;&#1081; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080; (eager, outer-join) &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
                    &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1087;&#1088;&#1086;&#1082;&#1089;&#1080; (proxy) &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1080;/&#1080;&#1083;&#1080; "&#1083;&#1077;&#1085;&#1080;&#1074;&#1099;&#1077;" &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1072; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1081; &#1089; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080;,
                    &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1082;&#1101;&#1096;&#1080;&#1088;&#1091;&#1102;&#1090;&#1103; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; JVM (JVM-level cache). &#1044;&#1083;&#1103; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1081; &#1089; &#1082;&#1101;&#1096;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080;,
                    &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1073;&#1086;&#1083;&#1100;&#1096;&#1072;&#1103; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1091;&#1076;&#1072;&#1095;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1082;&#1101;&#1096; (cache hit), &#1103;&#1074;&#1085;&#1086; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1081;&#1090;&#1077;
                    &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1102; &#1087;&#1086;&#1083;&#1085;&#1086;&#1081; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080; (eager fetching), &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; <tt class="literal">outer-join="false"</tt>.
                    &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1072; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; outer-join &#1091;&#1084;&#1077;&#1089;&#1090;&#1085;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; HQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1089; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1084;
                    &#1089;&#1083;&#1086;&#1074;&#1086;&#1084; <tt class="literal">left join fetch</tt>.
                </p></dd><dt><span class="term">&#1056;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1090;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1072;&#1096;&#1077;&#1081; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1083;&#1086;&#1075;&#1080;&#1082;&#1080; &#1086;&#1090; Hibernate.</span></dt><dd><p>
                    &#1057;&#1087;&#1088;&#1103;&#1095;&#1100;&#1090;&#1077; &#1079;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084; &#1074;&#1077;&#1089;&#1100; (Hibernate) &#1082;&#1086;&#1076;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082;
                    &#1076;&#1072;&#1085;&#1085;&#1099;&#1084; (data-access code). &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1099; <span class="emphasis"><em>DAO</em></span> &#1080;
                    <span class="emphasis"><em>Thread Local Session</em></span>. &#1042;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; JDBC-&#1082;&#1086;&#1076; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;
                    &#1074;&#1072;&#1096;&#1080;&#1093; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089; Hibernate &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; <tt class="literal">UserType</tt>.
                    (&#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089;&#1086;&#1074;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; "&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093;" &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;; &#1086;&#1085; &#1085;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;
                    &#1089; &#1087;&#1103;&#1090;&#1100;&#1102; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;&#1084;&#1080;!)
                </p></dd><dt><span class="term">
                &#1055;&#1088;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; <tt class="literal">equals()</tt> &#1080; <tt class="literal">hashCode()</tt>,
                &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1082;&#1083;&#1102;&#1095; (unique business key).
            </span></dt><dd><p>
                    &#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1084;&#1080; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
                    &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; <tt class="literal">equals()</tt> &#1080; <tt class="literal">hashCode()</tt> &#1076;&#1083;&#1103; &#1074;&#1072;&#1096;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;
                    (shl: &#1103; &#1090;&#1072;&#1082; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102; &#1095;&#1090;&#1086; &#1072;&#1074;&#1090;&#1086;&#1088;&#1099; &#1080;&#1084;&#1077;&#1083;&#1080; &#1074;&#1074;&#1080;&#1076;&#1091; &#1095;&#1090;&#1086; &#1076;&#1074;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086;
                    &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100; &#1095;&#1077;&#1088;&#1077;&#1079; identity, &#1090;.&#1077;. &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; '=='). &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;,
                    &#1080;&#1085;&#1076;&#1080;&#1074;&#1080;&#1076;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; (idenity) Java-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090;&#1077; &#1101;&#1090;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;,
                    &#1085;&#1077; &#1074;&#1079;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1099; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (&#1087;&#1086;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1080;,
                    &#1103;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1041;&#1044;). &#1042;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1077;&#1097;&#1077; &#1085;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1041;&#1044;,
                    &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1077;&#1084;&#1091; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072; &#1041;&#1044;, Hibernate &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1080;&#1090; &#1077;&#1075;&#1086;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090;
                    &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085; &#1074; &#1041;&#1044;. &#1053;&#1086; &#1077;&#1089;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; java.util.Set'&#1077; &#1074; &#1084;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;,
                    &#1090;&#1086; &#1077;&#1075;&#1086; &#1093;&#1101;&#1096;-&#1082;&#1086;&#1076; (hash code)
                    &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1089;&#1103;, &#1085;&#1072;&#1088;&#1091;&#1096;&#1072;&#1103; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1077; (contract) &#1076;&#1083;&#1103; <tt class="literal">hashCode()</tt>. &#1044;&#1083;&#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;
                    <tt class="literal">equals()</tt> &#1080; <tt class="literal">hashCode()</tt>, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1082;&#1083;&#1102;&#1095;,
                    &#1090;.&#1077;. &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1081;&#1090;&#1077; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1047;&#1072;&#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1082;&#1083;&#1102;&#1095; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100;
                    &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084; &#1080; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1086; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088; &#1087;&#1086;&#1082;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; java.util.Set'&#1077;,
                    &#1085;&#1077; &#1085;&#1072; &#1087;&#1088;&#1086;&#1090;&#1103;&#1078;&#1077;&#1085;&#1080;&#1080; &#1074;&#1089;&#1077;&#1075;&#1086; &#1078;&#1080;&#1079;&#1085;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1094;&#1080;&#1082;&#1083;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; (&#1090;.&#1077;. &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1082;&#1083;&#1102;&#1095; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1085; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1084;
                    &#1082;&#1072;&#1082; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1099;&#1081; &#1082;&#1083;&#1102;&#1095; &#1041;&#1044;). &#1053;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1081; &#1087;&#1088;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; <tt class="literal">equals()</tt>,
                    &#1080;&#1079;-&#1079;&#1072; &#1083;&#1077;&#1085;&#1080;&#1074;&#1086;&#1081; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; (lazy loading) &#1080; &#1073;&#1091;&#1076;&#1100;&#1090;&#1077; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1099; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080;,
                    &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1085;&#1080;&#1093; &#1087;&#1088;&#1086;&#1082;&#1089;&#1080; (proxy).
                </p></dd><dt><span class="term">&#1053;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1101;&#1082;&#1079;&#1086;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1081; &#1074; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072;&#1093;.</span></dt><dd><p>
                    &#1061;&#1086;&#1088;&#1086;&#1096;&#1080;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1093; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1081; many-to-many, &#1086;&#1095;&#1077;&#1085;&#1100; &#1088;&#1077;&#1076;&#1082;&#1080;.
                    &#1050;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1074;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1074; "&#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;" (link table).
                    &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1083;&#1091;&#1095;&#1096;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1102; one-to-many &#1085;&#1072; &#1087;&#1088;&#1086;&#1084;&#1077;&#1078;&#1091;&#1090;&#1086;&#1095;&#1085;&#1099;&#1081; "&#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081;
                    &#1082;&#1083;&#1072;&#1089;&#1089;" (link class). &#1053;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;, &#1084;&#1099; &#1076;&#1091;&#1084;&#1072;&#1077;&#1084; &#1095;&#1090;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1081;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;
                    &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; one-to-many &#1080; many-to-one. &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1074;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;
                    &#1074;&#1080;&#1076;&#1086;&#1074; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1081;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079; &#1087;&#1077;&#1088;&#1077;&#1076; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1101;&#1082;&#1079;&#1086;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1080;,
                    &#1089;&#1090;&#1086;&#1080;&#1090; &#1089;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1089;&#1077;&#1073;&#1103;, &#1090;&#1072;&#1082; &#1083;&#1080; &#1086;&#1085;&#1072; &#1074;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1072;.
                </p></dd></dl></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="example-mappings.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right">&nbsp;</td></tr><tr><td width="40%" align="left" valign="top">&#1043;&#1083;&#1072;&#1074;&#1072; 18. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;: &#1056;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1052;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1080;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top">&nbsp;</td></tr></table></div></body></html>