<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#1043;&#1083;&#1072;&#1074;&#1072; 4. &#1044;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1077; &#1050;&#1083;&#1072;&#1089;&#1089;&#1099; (Persistent Classes)</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="session-configuration.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; SessionFactory"><link rel="next" href="mapping.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 5. &#1054;&#1089;&#1085;&#1086;&#1074;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1088;&#1077;&#1083;&#1103;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1084;&#1072;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 4. &#1044;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1077; &#1050;&#1083;&#1072;&#1089;&#1089;&#1099; (Persistent Classes)</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="session-configuration.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="mapping.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="chapter" lang="ru"><div class="titlepage"><div><div><h2 class="title"><a name="persistent-classes"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 4. &#1044;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1077; &#1050;&#1083;&#1072;&#1089;&#1089;&#1099; (Persistent Classes)</h2></div></div><div></div></div><p>
    	&#1044;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; (Persistent &#1089;lasses) - &#1101;&#1090;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1079;&#1072;&#1076;&#1072;&#1095;&#1080;
    	(&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1047;&#1072;&#1082;&#1072;&#1079;&#1095;&#1080;&#1082;, &#1057;&#1095;&#1077;&#1090; &#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093; &#1101;&#1083;&#1077;&#1082;&#1090;&#1088;&#1086;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1094;&#1080;&#1080;). &#1044;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089;, 
    	&#1082;&#1072;&#1082; &#1074;&#1080;&#1076;&#1085;&#1086; &#1080;&#1079; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1080;&#1084;&#1077;&#1077;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1077; &#1080; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; (&#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1077; 
    	&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; - &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1077;&#1077;&#1089;&#1103; &#1076;&#1083;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; 
    	&#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; - &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
    	&#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;, &#1090;.&#1077;. &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; JVM). 
    </p><p>
        &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1089;&#1077;&#1084;&#1080; &#1087;&#1088;&#1080;&#1077;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; Hibernate, &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; 
        &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; POJO (Plain Old Java Object) &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; 
        &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;.
    </p><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-pojo"></a>4.1. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; POJO-&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;</h2></div></div><div></div></div><p>
            &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1089;&#1090;&#1091;&#1088;&#1082;&#1090;&#1091;&#1088;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086;
            &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1081; &#1087;&#1088;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;.
        </p><pre class="programlisting">package eg;
import java.util.Set;
import java.util.Date;

public class Cat {
    private Long id; // &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;
    private String name;
    private Date birthdate;
    private Cat mate;
    private Set kittens
    private Color color;
    private char sex;
    private float weight;

    private void setId(Long id) {
        this.id=id;
    }
    public Long getId() {
        return id;
    }

    void setName(String name) {
        this.name = name;
    }
    public String getName() {
        return name;
    }

    void setMate(Cat mate) {
        this.mate = mate;
    }
    public Cat getMate() {
        return mate;
    }

    void setBirthdate(Date date) {
        birthdate = date;
    }
    public Date getBirthdate() {
        return birthdate;
    }
    void setWeight(float weight) {
        this.weight = weight;
    }
    public float getWeight() {
        return weight;
    }

    public Color getColor() {
        return color;
    }
    void setColor(Color color) {
        this.color = color;
    }
    void setKittens(Set kittens) {
        this.kittens = kittens;
    }
    public Set getKittens() {
        return kittens;
    }
    // addKitten not needed by Hibernate
    public void addKitten(Cat kitten) {
        kittens.add(kitten);
    }
    void setSex(char sex) {
        this.sex=sex;
    }
    public char getSex() {
        return sex;
    }
}</pre><p>
            &#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1087;&#1083;&#1072;&#1074;&#1080;&#1083;&#1072;:
        </p><div class="sect2" lang="ru"><div class="titlepage"><div><div><h3 class="title"><a name="persistent-classes-pojo-accessors"></a>4.1.1. &#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1087;&#1086;&#1083;&#1077;&#1081;</h3></div></div><div></div></div><p>
            	&#1050;&#1083;&#1072;&#1089;&#1089; <tt class="literal">Cat</tt> &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1099;&#1093; &#1087;&#1086;&#1083;&#1077;&#1081;.
            	&#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; ORM (Object Relational Model - &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1088;&#1077;&#1083;&#1103;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;) &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; 
            	&#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1052;&#1099; &#1076;&#1091;&#1084;&#1072;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
            	&#1083;&#1091;&#1095;&#1096;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1076;&#1077;&#1090;&#1072;&#1083;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1086;&#1090; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1072; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. Hibernate 
            	&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1089;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074; &#1089;&#1090;&#1080;&#1083;&#1077; JavaBeans &#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1079;&#1085;&#1072;&#1077;&#1090; &#1080;&#1084;&#1077;&#1085;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1074; 
            	&#1092;&#1086;&#1088;&#1084;&#1077; <tt class="literal">getFoo</tt>, <tt class="literal">isFoo</tt> &#1080; <tt class="literal">setFoo</tt>.
            </p><p>
                &#1042; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; JavaBeans, &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; 
                &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; <span class="emphasis"><em>&#1085;&#1077;</em></span> &#1086;&#1073;&#1103;&#1079;&#1072;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080;
                (public) - Hibernate &#1084;&#1086;&#1078;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080;, &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; 
                &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1099; &#1089; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; "&#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;", <tt class="literal">protected</tt> 
                &#1080;&#1083;&#1080; <tt class="literal">private</tt>.
            </p></div><div class="sect2" lang="ru"><div class="titlepage"><div><div><h3 class="title"><a name="persistent-classes-pojo-constructor"></a>4.1.2. &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</h3></div></div><div></div></div><p>
                &#1050;&#1083;&#1072;&#1089;&#1089; <tt class="literal">Cat</tt> &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1077;&#1103;&#1074;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;
                (&#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1073;&#1077;&#1079; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;). &#1044;&#1083;&#1103; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; Hibernate &#1074;&#1089;&#1077; 
                &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1080;&#1084;&#1077;&#1090;&#1100; &#1090;&#1072;&#1082;&#1086;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; (&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090;
                &#1073;&#1099;&#1090;&#1100; &#1085;&#1077; public) &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; Hibernate &#1084;&#1086;&#1075; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; 
                &#1101;&#1090;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <tt class="literal">Constructor.newInstance()</tt>.
            </p></div><div class="sect2" lang="ru"><div class="titlepage"><div><div><h3 class="title"><a name="persistent-classes-pojo-identifier"></a>4.1.3. &#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;-&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072; (&#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;)</h3></div></div><div></div></div><p>
                &#1050;&#1083;&#1072;&#1089;&#1089; <tt class="literal">Cat</tt> &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; "id". &#1069;&#1090;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; 
                &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1102;&#1095;&#1072; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1058;&#1072;&#1082;&#1086;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; 
                &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1083;&#1102;&#1073;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;, &#1080; &#1080;&#1084;&#1077;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1090;&#1080;&#1087;, &#1090;&#1080;&#1087; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;-&#1086;&#1073;&#1077;&#1088;&#1090;&#1082;&#1080; 
                &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1090;&#1080;&#1087;&#1099; <tt class="literal">java.lang.String</tt> &#1080; 
                <tt class="literal">java.util.Date</tt>. &#1045;&#1089;&#1083;&#1080; &#1074;&#1072;&#1096;&#1080; &#1089;&#1090;&#1072;&#1088;&#1099;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1099;&#1077; 
                &#1082;&#1083;&#1102;&#1095;&#1080;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089; &#1089;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; 
                &#1101;&#1090;&#1080;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; (&#1089;&#1084;. &#1085;&#1080;&#1078;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;, &#1087;&#1086;&#1089;&#1074;&#1103;&#1097;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1099;&#1084; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;).
            </p><p>
                &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;-&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1089;&#1091;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;. 
                &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1080; &#1076;&#1072;&#1090;&#1100; Hibernate &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1083;&#1077;&#1076;&#1080;&#1090;&#1100; &#1079;&#1072; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1077;&#1081; 
                &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1080;&#1084;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080;  &#1080; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; 
                &#1090;&#1072;&#1082;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1086;. 
            </p><p>
                &#1041;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1103;&#1074;&#1085;&#1086; 
                &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;. &#1042; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;:
            </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                        &#1050;&#1072;&#1089;&#1082;&#1072;&#1076;&#1085;&#1086;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; (&#1089;&#1084;. "&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1078;&#1080;&#1079;&#1085;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1094;&#1080;&#1082;&#1083;&#1072;")
                    </p></li><li><p>
                        <tt class="literal">Session.saveOrUpdate()</tt>
                    </p></li></ul></div><p>
                &#1052;&#1099; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; persistent-&#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;-&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1089; 
                &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1077;&#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1090;&#1080;&#1087; (&#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1085;&#1086; &#1084;&#1086;&#1075;&#1083;&#1086; 
                &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; null)
            </p></div><div class="sect2" lang="ru"><div class="titlepage"><div><div><h3 class="title"><a name="persistent-classes-pojo-final"></a>4.1.4. &#1054;&#1090;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;-final &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084; (&#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;)</h3></div></div><div></div></div><p>
                &#1062;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; Hibernate &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; proxy-&#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, 
                &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1087;&#1080;&#1088;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; 
                &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080;&#1083;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093;
                &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1074;, &#1079;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1093; &#1085;&#1072;&#1073;&#1086;&#1088; persistent-&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; 
                set/get &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;.
            </p><p>
                &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; Hibernate &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; final-&#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080;, 
                &#1085;&#1077; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1074;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1074;&#1099; &#1085;&#1077; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; proxy-&#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, 
                &#1095;&#1090;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090; &#1042;&#1072;&#1096;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1077; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;.
            </p></div></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-inheritance"></a>4.2. &#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</h2></div></div><div></div></div><p>
            &#1055;&#1086;&#1076;&#1082;&#1083;&#1072;&#1089;&#1089; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1074;&#1086;&#1077; &#1080; &#1074;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072;. C&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;-&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1090;&#1086;&#1088;
            &#1053;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1091; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;-&#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103; <tt class="literal">Cat</tt>.
        </p><pre class="programlisting">package eg;

public class DomesticCat extends Cat {
        private String name;

        public String getName() {
                return name;
        }
        protected void setName(String name) {
                this.name=name;
        }
}</pre></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-equalshashcode"></a>4.3. &#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; <tt class="literal">equals()</tt> &#1080; <tt class="literal">hashCode()</tt></h2></div></div><div></div></div><p>
            &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; <tt class="literal">equals()</tt> &#1080; <tt class="literal">hashCode()</tt>
            &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;  &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;
            &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1081; &#1080;&#1083;&#1080; &#1093;&#1101;&#1096;-&#1090;&#1072;&#1073;&#1083;&#1080;&#1094; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1085;&#1072;&#1073;&#1086;&#1088;&#1077; <tt class="literal">Set</tt>).
        </p><p>
			<span class="emphasis"><em>&#1069;&#1090;&#1086; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1076;&#1098;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1099; &#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; 
			Hibernate-&#1089;&#1077;&#1089;&#1089;&#1080;&#1103;&#1093;, &#1090;.&#1082;. Hibernate &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090; JVM-&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;  (<tt class="literal"> a == b </tt>, 
			&#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <tt class="literal">equals()</tt> &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;) &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1088;&#1072;&#1084;&#1082;&#1072;&#1093; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;!</em></span>
        </p><p>
            &#1060;&#1088;&#1072;&#1079;&#1072; "&#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090; JVM-&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;" &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1095;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102; &#1073;&#1099;&#1083; 
            &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, "5", &#1074;&#1086; &#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1088;&#1080; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1084; 
            &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; <span class="emphasis"><em>&#1090;&#1091; &#1078;&#1077;</em></span> &#1089;&#1077;&#1089;&#1089;&#1080;&#1102; &#1101;&#1090;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1089; &#1101;&#1090;&#1080;&#1084; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084;, &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; 
            &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090; <span class="emphasis"><em>&#1090;&#1086;&#1090; &#1078;&#1077;</em></span> &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090; &#1101;&#1090;&#1086;&#1090; 
            &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1080;&#1079; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; (&#1087;&#1088;&#1080;&#1084;. &#1087;&#1077;&#1088;.).
        </p><p>
            &#1044;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1086;&#1073;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <tt class="literal">a</tt> &#1080; <tt class="literal">b</tt> &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1086;&#1076;&#1085;&#1091; &#1080; &#1090;&#1091; &#1078;&#1077; 
            &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (&#1090;.&#1077;. &#1080;&#1084;&#1077;&#1102;&#1090; &#1086;&#1076;&#1085;&#1086; &#1080; &#1090;&#1086; &#1078;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1102;&#1095;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;), 
            &#1084;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1084; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080; &#1090;&#1077;&#1084; &#1078;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1074;&#1085;&#1077; &#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103;&#1093;.
        </p><p>
            &#1053;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; <tt class="literal">equals()</tt>/<tt class="literal">hashCode()</tt>, 
            &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1075;&#1086;&#1083;&#1086;&#1074;&#1091;, &#1101;&#1090;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; 
            &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090;, &#1090;&#1086; &#1086;&#1073;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1086;&#1076;&#1085;&#1091; &#1080; &#1090;&#1091; &#1078;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1080; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1086;&#1085;&#1080; 
            &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1099; (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1073;&#1072; &#1101;&#1090;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1102; <tt class="literal">Set</tt>, 
            &#1090;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1085;&#1080;&#1093; &#1074; &#1085;&#1077;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;). &#1050; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1084;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; 
            &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;. Hibernate &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1078;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; - &#1085;&#1086;&#1074;&#1099;&#1077; 
            &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1101;&#1090;&#1086;&#1075;&#1086; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072; &#1076;&#1086; &#1090;&#1077;&#1093; &#1087;&#1086;&#1088;, &#1087;&#1086;&#1082;&#1072; &#1086;&#1085;&#1080; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1099; &#1074; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;! 
            &#1052;&#1099; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; <tt class="literal">equals()</tt> &#1080; <tt class="literal">hashCode()</tt> 
            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1089;&#1077;&#1084;&#1072;&#1085;&#1090;&#1080;&#1082;&#1091; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; persistent-&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; (&#1090;.&#1085;. <span class="emphasis"><em>Business key 
            equality - &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1082;&#1083;&#1102;&#1095;&#1091;</em></span>).
        </p><p>
            &#1069;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1082;&#1083;&#1102;&#1095;&#1091; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; <tt class="literal">equals()</tt> &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1077;&#1090; 
            &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1102;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1084;&#1080;&#1088;&#1077; (&#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1090;.&#1085;. 
            &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; <span class="emphasis"><em>&#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081;</em></span> &#1082;&#1083;&#1102;&#1095;).
        </p><pre class="programlisting">public class Cat {

    ...
    public boolean equals(Object other) {
        if (this == other) return true;
        if (!(other instanceof Cat)) return false;

        final Cat cat = (Cat) other;

        if (!getName().equals(cat.getName())) return false;
        if (!getBirthday().equals(cat.getBirthday())) return false;

        return true;
    }

    public int hashCode() {
        int result;
        result = getName().hashCode();
        result = 29 * result + getBirthday().hashCode();
        return result;
    }

}</pre><p>
            &#1055;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1096; &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1083;&#1102;&#1095; (&#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1101;&#1090;&#1086; &#1080;&#1084;&#1103; &#1080; &#1076;&#1077;&#1085;&#1100; &#1088;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;) 
            &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1083;&#1080;&#1096;&#1100; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103; (&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 
            &#1074; &#1086;&#1076;&#1085;&#1086;&#1084;-&#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; - &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; equals()), &#1090;.&#1082;. &#1085;&#1072;&#1084; 
            &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1072; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; &#1089;&#1090;&#1072;&#1073;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1098;&#1103;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1082; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1099;&#1084; 
            &#1082;&#1083;&#1102;&#1095;&#1072;&#1084;.
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-lifecycle"></a>4.4. Callback-&#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1078;&#1080;&#1079;&#1085;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1094;&#1080;&#1082;&#1083;&#1072;</h2></div></div><div></div></div><p>
            &#1055;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;, &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1084;&#1086;&#1078;&#1077;&#1090; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;
            <tt class="literal">Lifecycle</tt>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; callback-&#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, 
            &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1072;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;
            &#1087;&#1086; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1080;&#1083;&#1080; &#1086;&#1090;&#1095;&#1080;&#1089;&#1090;&#1082;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1080; &#1087;&#1077;&#1088;&#1077;&#1076; 
            &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1083;&#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;.
        </p><p>
            
            &#1042; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082; <tt class="literal">Lifecycle</tt> &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; 
            <tt class="literal">Interceptor</tt> &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1091;&#1102; 
            &#1086;&#1090; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1083;&#1086;&#1075;&#1080;&#1082;&#1080; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1091;.
        </p><div class="programlistingco"><pre class="programlisting">public interface Lifecycle {
        public boolean onSave(Session s) throws CallbackException;   <span class="co">(1)</span>
        public boolean onUpdate(Session s) throws CallbackException; <span class="co">(2)</span>
        public boolean onDelete(Session s) throws CallbackException; <span class="co">(3)</span>
        public void onLoad(Session s, Serializable id);              <span class="co">(4)</span>
}</pre><div class="calloutlist"><table border="0" summary="Callout list"><tr><td width="5%" valign="top" align="left">(1)</td><td valign="top" align="left"><p>
                        <tt class="literal">onSave</tt> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; 
                        &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(2)</td><td valign="top" align="left"><p>
                        <tt class="literal">onUpdate</tt> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; 
                        (&#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076; <tt class="literal">Session.update()</tt>)
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(3)</td><td valign="top" align="left"><p>
                        <tt class="literal">onDelete</tt> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;
                    </p></td></tr><tr><td width="5%" valign="top" align="left">(4)</td><td valign="top" align="left"><p>
                        <tt class="literal">onLoad</tt> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;
                    </p></td></tr></table></div></div><p>
            &#1052;&#1077;&#1090;&#1086;&#1076;&#1099; <tt class="literal">onSave()</tt>, <tt class="literal">onDelete()</tt> &#1080;
            <tt class="literal">onUpdate()</tt> &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1082;&#1072;&#1089;&#1082;&#1072;&#1076;&#1085;&#1086;&#1075;&#1086; 
            &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1095;&#1090;&#1086; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; 
            &#1082;&#1072;&#1089;&#1082;&#1072;&#1076;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1074; mapping-&#1092;&#1072;&#1081;&#1083;&#1077;. &#1052;&#1077;&#1090;&#1086;&#1076; <tt class="literal">onLoad()</tt> 
            &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; transient-&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; (&#1090;.&#1077;. &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;, 
            &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1073;&#1072;&#1079;&#1091; &#1087;&#1088;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1087;&#1088;&#1080;&#1084;. &#1087;&#1077;&#1088;.) &#1085;&#1072; 
            &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;. &#1069;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090;
            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1090;.&#1082;. Hibernate 
            &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1080;&#1079; <tt class="literal">onLoad()</tt>. 
            &#1052;&#1077;&#1090;&#1086;&#1076;&#1099; <tt class="literal">onLoad()</tt>, <tt class="literal">onSave()</tt> &#1080; 
            <tt class="literal">onUpdate()</tt> &#1084;&#1086;&#1075;&#1091;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; 
            &#1089;&#1077;&#1089;&#1089;&#1080;&#1102; &#1076;&#1083;&#1103; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.
        </p><p>
            &#1048;&#1084;&#1077;&#1081;&#1090;&#1077; &#1074; &#1074;&#1080;&#1076;&#1091;, &#1095;&#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; <tt class="literal">onUpdate()</tt> &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1086;&#1075;&#1076;&#1072;, 
            &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; <tt class="literal">Session.update()</tt>, &#1072; &#1085;&#1077; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; 
            &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;.
        </p><p>
            &#1045;&#1089;&#1083;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; <tt class="literal">onSave()</tt>, <tt class="literal">onUpdate()</tt> &#1080;&#1083;&#1080;
            <tt class="literal">onDelete()</tt> &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; <tt class="literal">true</tt>, &#1090;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; 
            &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1073;&#1077;&#1079; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1101;&#1090;&#1080;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1087;&#1088;&#1086;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; 
            <tt class="literal">CallbackException</tt>, &#1090;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; 
            &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086; &#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;.
        </p><p>
            &#1045;&#1089;&#1083;&#1080; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1088;&#1086;&#1076;&#1085;&#1072;&#1103; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081; (native key generation), &#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; 
            <tt class="literal">onSave()</tt> &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; 
            &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;.
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-validatable"></a>4.5. &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1086;&#1095;&#1085;&#1099;&#1077; callback-&#1074;&#1099;&#1079;&#1086;&#1074;&#1099;</h2></div></div><div></div></div><p>
            &#1045;&#1089;&#1083;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1083; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093;
            &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; persistent-&#1082;&#1083;&#1072;&#1089;&#1089;&#1077; 
            &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; <tt class="literal">Validatable</tt>:
        </p><pre class="programlisting">public interface Validatable {
        public void validate() throws ValidationFailure;
}</pre><p>
            &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <tt class="literal">ValidationFailure</tt> 
            &#1077;&#1089;&#1083;&#1080; &#1082;&#1072;&#1082;&#1086;&#1077;-&#1090;&#1086; &#1080;&#1079; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1081; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1086;. &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; 
            &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; <tt class="literal">Validatable</tt> &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089;&#1074;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; 
            &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; (<tt class="literal">validate()</tt>).
        </p><p>
            &#1042; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; callback-&#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072; <tt class="literal">Lifecycle</tt>, 
            &#1074;&#1088;&#1077;&#1084;&#1103; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <tt class="literal">validate()</tt> &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086;. &#1041;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1083;&#1086;&#1075;&#1080;&#1082;&#1072; 
            &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1074;&#1099;&#1079;&#1086;&#1074;&#1099; validate().
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="persistent-classes-xdoclet"></a>4.6. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; XDOclet &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;</h2></div></div><div></div></div><p>
            &#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1075;&#1083;&#1072;&#1074;&#1077; &#1084;&#1099; &#1087;&#1086;&#1082;&#1072;&#1078;&#1077;&#1084;, &#1082;&#1072;&#1082; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080; &#1080; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081; 
            &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; mapping-&#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1084;, &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;&#1084; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; XML &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077;. 
            &#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; Hibernate &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1102;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100; &#1101;&#1090;&#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103; &#1087;&#1088;&#1103;&#1084;&#1086; &#1074; 
            &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; XDoclet <tt class="literal">@hibernate.tags</tt>. 
            &#1042; &#1101;&#1090;&#1086;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1084;&#1099; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1084; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;, &#1090;.&#1082;., &#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;, 
            &#1101;&#1090;&#1086; &#1095;&#1072;&#1089;&#1090;&#1100; XDoclet &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;. &#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1085;&#1080;&#1078;&#1077; &#1084;&#1099; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
            <tt class="literal">Cat</tt> &#1089; XDoclet &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;&#1084;.
        </p><pre class="programlisting">package eg;
import java.util.Set;
import java.util.Date;

/**
 * @hibernate.class
 *  table="CATS"
 */
public class Cat {
    private Long id; // &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;
    private Date birthdate;
    private Cat mate;
    private Set kittens
    private Color color;
    private char sex;
    private float weight;

    /**
     * @hibernate.id
     *  generator-class="native"
     *  column="CAT_ID"
     */
    public Long getId() {
        return id;
    }
    private void setId(Long id) {
        this.id=id;
    }

    /**
     * @hibernate.many-to-one
     *  column="MATE_ID"
     */
    public Cat getMate() {
        return mate;
    }
    void setMate(Cat mate) {
        this.mate = mate;
    }

    /**
     * @hibernate.property
     *  column="BIRTH_DATE"
     */
    public Date getBirthdate() {
        return birthdate;
    }
    void setBirthdate(Date date) {
        birthdate = date;
    }
    /**
     * @hibernate.property
     *  column="WEIGHT"
     */
    public float getWeight() {
        return weight;
    }
    void setWeight(float weight) {
        this.weight = weight;
    }

    /**
     * @hibernate.property
     *  column="COLOR"
     *  not-null="true"
     */
    public Color getColor() {
        return color;
    }
    void setColor(Color color) {
        this.color = color;
    }
    /**
     * @hibernate.set
     *  lazy="true"
     *  order-by="BIRTH_DATE"
     * @hibernate.collection-key
     *  column="PARENT_ID"
     * @hibernate.collection-one-to-many
     */
    public Set getKittens() {
        return kittens;
    }
    void setKittens(Set kittens) {
        this.kittens = kittens;
    }
    // addKitten not needed by Hibernate
    public void addKitten(Cat kitten) {
        kittens.add(kitten);
    }

    /**
     * @hibernate.property
     *  column="SEX"
     *  not-null="true"
     *  update="false"
     */
    public char getSex() {
        return sex;
    }
    void setSex(char sex) {
        this.sex=sex;
    }
}</pre></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="session-configuration.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="mapping.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; SessionFactory&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top">&nbsp;&#1043;&#1083;&#1072;&#1074;&#1072; 5. &#1054;&#1089;&#1085;&#1086;&#1074;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1088;&#1077;&#1083;&#1103;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086; &#1084;&#1072;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072;</td></tr></table></div></body></html>