<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#1043;&#1083;&#1072;&#1074;&#1072; 13. &#1053;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099;</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="querycriteria.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 12. &#1047;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Criteria"><link rel="next" href="performance.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 14. Improving performance"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 13. &#1053;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="querycriteria.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="performance.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="chapter" lang="ru"><div class="titlepage"><div><div><h2 class="title"><a name="querysql"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 13. &#1053;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099;</h2></div></div><div></div></div><p>
    	&#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1090;&#1072;&#1082; &#1078;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099; &#1085;&#1072; &#1088;&#1086;&#1076;&#1085;&#1086;&#1084; &#1076;&#1083;&#1103; &#1074;&#1072;&#1097;&#1077;&#1081; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1080;&#1072;&#1083;&#1077;&#1082;&#1090;&#1077; SQL. &#1069;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;
    	&#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1099;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1086; CONNECT &#1074; Oracle.
    	&#1069;&#1090;&#1086; &#1090;&#1072;&#1082; &#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1087;&#1091;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099;&#1093; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; 
    	SQL/JDBC &#1085;&#1072; Hibernate.
    </p><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="querysql-creating"></a>13.1. &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; SQL <tt class="literal">&#1047;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;</tt></h2></div></div><div></div></div><p>
            SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099; &#1087;&#1088;&#1077;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1090;&#1086;&#1090; &#1078;&#1077; <tt class="literal">Query</tt> &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103;
            HQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;. &#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086;&#1077;&#1085;&#1085;&#1086;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1077; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; SQL &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076; <tt class="literal">Session.createSQLQuery()</tt>.
        </p><pre class="programlisting">Query sqlQuery = sess.createSQLQuery("select {cat.*} from cats {cat}", "cat", Cat.class);
sqlQuery.setMaxResults(50);
List cats = sqlQuery.list();</pre><p>
            &#1058;&#1088;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; <tt class="literal">createSQLQuery()</tt>:
        </p><div class="itemizedlist"><ul type="disc"><li><p>
            &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;
        </p></li><li><p>
            &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1072;&#1083;&#1080;&#1072;&#1089;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;
        </p></li><li><p>
        	&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1099;&#1081; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1084; &#1087;&#1077;&#1088;&#1089;&#1080;&#1089;&#1090;&#1077;&#1085;&#1090;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089;
        </p></li></ul></div><p>
        	&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1072;&#1083;&#1080;&#1072;&#1089;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1081; &#1082; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084; &#1079;&#1072;&#1084;&#1072;&#1087;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
        	(&#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1101;&#1090;&#1086; <tt class="literal">Cat</tt>). &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077;
        	&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1103; &#1084;&#1072;&#1089;&#1080;&#1074; &#1089;&#1090;&#1088;&#1086;&#1082; (<tt class="literal">String</tt>) &#1076;&#1083;&#1103; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; &#1072;&#1083;&#1080;&#1072;&#1089;&#1086;&#1074; &#1080; &#1084;&#1072;&#1089;&#1089;&#1080;&#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;
        	<tt class="literal">Class</tt> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;.
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="querysql-aliasreferences"></a>13.2. &#1057;&#1074;&#1103;&#1079;&#1080; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1080; &#1072;&#1083;&#1080;&#1072;&#1089;&#1086;&#1074;</h2></div></div><div></div></div><p>
            &#1053;&#1086;&#1090;&#1072;&#1094;&#1080;&#1103; <tt class="literal">{cat.*}</tt> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1074; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1074;&#1099;&#1096;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084; &#1076;&#1083;&#1103; "&#1074;&#1089;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;". 
            &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1090;&#1072;&#1082; &#1078;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1103;&#1074;&#1085;&#1086;, &#1085;&#1086; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1076;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; Hibernate &#1074;&#1099;&#1073;&#1086;&#1088; &#1072;&#1083;&#1080;&#1072;&#1089;&#1086;&#1074; &#1076;&#1083;&#1103; 
            &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;. &#1047;&#1072;&#1084;&#1077;&#1085;&#1086;&#1081; &#1076;&#1083;&#1103; &#1090;&#1072;&#1082;&#1080;&#1093; &#1072;&#1083;&#1080;&#1072;&#1089;&#1086;&#1074; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077;&#1084; &#1072;&#1083;&#1080;&#1072;&#1089;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;.
            &#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1082;&#1086;&#1090;&#1086;&#1074; (<tt class="literal">Cat</tt>) &#1080;&#1079; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; (<tt class="literal">cat_log</tt>)
            &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086;&#1081; &#1086;&#1090; &#1076;&#1077;&#1082;&#1083;&#1072;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1072;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072;. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1090;&#1086;, &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1072;&#1083;&#1080;&#1072;&#1089;&#1099; 
            &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1074; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1080; where.
        </p><pre class="programlisting">String sql = "select cat.originalId as {cat.id}, "
    + "  cat.mateid as {cat.mate}, cat.sex as {cat.sex}, "
    + "  cat.weight*10 as {cat.weight}, cat.name as {cat.name}"
    + "     from cat_log cat where {cat.mate} = :catId"
List loggedCats = sess.createSQLQuery(sql, "cat", Cat.class)
    .setLong("catId", catId)
    .list();
</pre><p>
            <span class="emphasis"><em>&#1047;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</em></span> &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1103;&#1074;&#1085;&#1086;, &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;
            &#1080; <span class="emphasis"><em>&#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093; &#1082; &#1085;&#1077;&#1084;&#1091; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;</em></span>!
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="querysql-namedqueries"></a>13.3. &#1048;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099;</h2></div></div><div></div></div><p>
        	&#1048;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; &#1084;&#1072;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072; &#1080; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1099; &#1074; &#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1090;&#1072;&#1082; &#1078;&#1077;, &#1082;&#1072;&#1082; &#1101;&#1090;&#1086;
        	&#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; HQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;.
        </p><pre class="programlisting">List people = sess.getNamedQuery("mySqlQuery")
    .setMaxResults(50)
    .list();</pre><pre class="programlisting">&lt;sql-query name="mySqlQuery"&gt;
    &lt;return alias="person" class="eg.Person"/&gt;
    SELECT {person}.NAME AS {person.name},
           {person}.AGE AS {person.age},
           {person}.SEX AS {person.sex}
    FROM PERSON {person} WHERE {person}.NAME LIKE 'Hiber%'
&lt;/sql-query&gt;</pre></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="querycriteria.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="performance.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1043;&#1083;&#1072;&#1074;&#1072; 12. &#1047;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Criteria&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top">&nbsp;&#1043;&#1083;&#1072;&#1074;&#1072; 14. Improving performance</td></tr></table></div></body></html>