<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1041;&#1099;&#1089;&#1090;&#1088;&#1099;&#1081; &#1089;&#1090;&#1072;&#1088;&#1090; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Tomcat</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="preface.html" title="&#1055;&#1088;&#1077;&#1076;&#1080;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;"><link rel="next" href="architecture.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1041;&#1099;&#1089;&#1090;&#1088;&#1099;&#1081; &#1089;&#1090;&#1072;&#1088;&#1090; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Tomcat</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="preface.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="architecture.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="chapter" lang="ru"><div class="titlepage"><div><div><h2 class="title"><a name="quickstart"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1041;&#1099;&#1089;&#1090;&#1088;&#1099;&#1081; &#1089;&#1090;&#1072;&#1088;&#1090; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; Tomcat</h2></div></div><div></div></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="quickstart-intro"></a>1.1. &#1053;&#1072;&#1095;&#1085;&#1077;&#1084; &#1089; Hibernate</h2></div></div><div></div></div><p>
            &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1091;&#1095;&#1077;&#1073;&#1085;&#1099;&#1081; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083; &#1088;&#1072;&#1079;&#1098;&#1103;&#1089;&#1085;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; Hibernate 2.1 &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;
            Apache Tomcat servlet &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072; &#1076;&#1083;&#1103; web-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;. Hibernate &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1089;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;
            &#1074; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1084; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077; (managed environment) &#1089;&#1086; &#1074;&#1089;&#1077;&#1084;&#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1084;&#1080; J2EE &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;&#1084;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;,
            &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080; &#1074; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; Java &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093; (standalone Java applications).
            &#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1073;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; PostgreSQL 7.3, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
            &#1085;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086;-&#1085;&#1072;&#1074;&#1089;&#1077;&#1075;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1076;&#1080;&#1072;&#1083;&#1077;&#1082;&#1090;&#1072; SQL &#1074; Hibernate.
        </p><p>
            &#1042; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1074; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; Tomcat.
            &#1052;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; web-&#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090; (<tt class="literal">webapps/quickstart</tt>) &#1076;&#1083;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;
            &#1091;&#1095;&#1077;&#1073;&#1085;&#1086;&#1075;&#1086; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;
            (global classpath)
            <tt class="literal">TOMCAT/common/lib</tt> &#1080; &#1087;&#1091;&#1090;&#1100; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082; &#1074; &#1085;&#1072;&#1096;&#1077;&#1084; web-&#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077;
            (context classpath)
            <tt class="literal">webapps/quickstart/WEB-INF/lib</tt> (&#1076;&#1083;&#1103; JAR-&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;),
            <tt class="literal">webapps/quickstart/WEB-INF/classes</tt> (&#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1085;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;).
            &#1041;&#1091;&#1076;&#1077;&#1084; &#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1086;&#1073;&#1072; &#1087;&#1091;&#1090;&#1080; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082; &#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1082;&#1072;&#1082; &#1085;&#1072; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;, &#1090;&#1072;&#1082; &#1080; &#1085;&#1072; &#1082;&#1086;&#1085;&#1077;&#1082;&#1089;&#1090;&#1085;&#1099;&#1081;
            (global classpath, context classpath), &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1095;&#1080;&#1082;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;
            &#1073;&#1091;&#1076;&#1091;&#1090; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1099;&#1081; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1095;&#1080;&#1082;&#1080; (global classloader, context classloader).
        </p><p>
            &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1077;&#1084; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1074; &#1086;&#1073;&#1072; &#1087;&#1091;&#1090;&#1080; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; (classpath):
        </p><div class="orderedlist"><ol type="1"><li><p>
                    &#1057;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; JDBC &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1084;&#1086;&#1081; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; global classpath.
                    &#1069;&#1090;&#1086; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1076;&#1080;&#1082;&#1090;&#1086;&#1074;&#1072;&#1085;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; 'DBCP &#1087;&#1091;&#1083; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081;' (DBCP connection pool),
                    &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; Tomcat.
                    Hibernate &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; JDBC &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; (JDBC connections) &#1076;&#1083;&#1103; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;
                    &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1099; &#1083;&#1080;&#1073;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1091;&#1083; JDBC &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081;
                    (JDBC connection pool), &#1083;&#1080;&#1073;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; Hibernate &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;
                    &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1091;&#1083;&#1086;&#1074; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; Hibernate (C3P0, Proxool).
                    &#1044;&#1083;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1072;, &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1091; <tt class="literal">pg73jdbc3.jar</tt>
                    (&#1076;&#1083;&#1103; PostgreSQL 7.3 &#1080; JDK 1.4) &#1074; global classpath. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
                    &#1082;&#1072;&#1082;&#1091;&#1102;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1090;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1077;&#1081; JDBC &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;.
                </p></li><li><p>
                    &#1053;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074; global classpath &#1074; Tomcat,
                    &#1080;&#1085;&#1072;&#1095;&#1077; &#1074;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103;
                    Log4j, commons-logging &#1080; &#1090;.&#1076;. &#1042;&#1089;&#1077;&#1075;&#1076;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; context classpath &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086;
                    web-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1090;.&#1077;. &#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1074; <tt class="literal">WEB-INF/lib</tt>
                    &#1072; &#1074;&#1072;&#1096;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1080; &#1092;&#1072;&#1081;&#1083;&#1099; Java-&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; (properties)
                    &#1074; <tt class="literal">WEB-INF/classes</tt>. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;
                    &#1086;&#1073;&#1077; &#1101;&#1090;&#1080; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; context classpath &#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1076;&#1083;&#1103; context classloader'&#1072;.
				</p></li><li><p>
                    Hibernate &#1091;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1085; &#1082;&#1072;&#1082; JAR-&#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072;. &#1060;&#1072;&#1081;&#1083; <tt class="literal">hibernate2.jar</tt>
                    &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1074; context classpath &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
                    &#1055;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;, Hibernate &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1088;&#1103;&#1076; &#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1093; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;
                    &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1086;&#1084; Hibernate &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; <tt class="literal">lib/</tt>;
                    &#1089;&#1084;&#1086;&#1090;&#1088;&#1080; <a href="quickstart.html#3rdpartylibs" title="&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; 1.1. &#xA;                &#1058;&#1088;&#1077;&#1090;&#1100;&#1077;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1084;&#1099;&#1077; &#1074; Hibernate&#xA;            ">&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;&nbsp;1.1, &laquo;
                &#1058;&#1088;&#1077;&#1090;&#1100;&#1077;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1084;&#1099;&#1077; &#1074; Hibernate
            &raquo;</a>. &#1057;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1077; &#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;
                    &#1074; context classpath web-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
                </p></li></ol></div><div class="table"><a name="3rdpartylibs"></a><p class="title"><b>&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; 1.1. 
                &#1058;&#1088;&#1077;&#1090;&#1100;&#1077;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1084;&#1099;&#1077; &#1074; Hibernate
            </b></p><table summary="&#xA;                &#1058;&#1088;&#1077;&#1090;&#1100;&#1077;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1084;&#1099;&#1077; &#1074; Hibernate&#xA;            " border="1"><colgroup><col><col></colgroup><thead><tr><th align="center">
                            &#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072;
                        </th><th align="center">
                            &#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
                        </th></tr></thead><tbody><tr><td>
                            dom4j (&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;)
                        </td><td>
                            Hibernate &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; dom4j &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1073;&#1086;&#1088;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; XML-&#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1080; XML-&#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072;
                            &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
                        </td></tr><tr><td>
                            CGLIB (&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;)
                        </td><td>
                            Hibernate &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1091; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1082;&#1086;&#1076;&#1072; &#1076;&#1083;&#1103; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;
                            &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; (&#1074; &#1089;&#1086;&#1095;&#1077;&#1090;&#1072;&#1085;&#1080;&#1080; &#1089; Java reflection).
                        </td></tr><tr><td>
                            Commons Collections, Commons Logging (&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;)
                        </td><td>
                            Hibernate &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; &#1080;&#1079;
                            &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; Apache Jakarta Commons.
                        </td></tr><tr><td>
                            ODMG4 (&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;)
                        </td><td>
                            Hibernate &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089; ODMG &#1080;&#1085;&#1090;&#1077;&#1092;&#1077;&#1081;&#1089;
                            &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1089;&#1090;&#1074;&#1086;&#1084; (ODMG compliant persistence manager
                            interface). &#1044;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1077; &#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; ODMG API,
                            &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1080;&#1085;&#1090;&#1077;&#1092;&#1077;&#1081;&#1089; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1089;&#1086;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1084;&#1101;&#1087;&#1080;&#1090;&#1100; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080;.
                            &#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1091;&#1095;&#1077;&#1073;&#1085;&#1086;&#1084; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1077; &#1084;&#1099; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1084; &#1084;&#1101;&#1087;&#1080;&#1090;&#1100; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080;,
                            &#1085;&#1086;, &#1090;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; JAR-&#1092;&#1072;&#1081;&#1083; -- &#1093;&#1086;&#1088;&#1086;&#1096;&#1072;&#1103; &#1080;&#1076;&#1077;&#1103;.
                        </td></tr><tr><td>
                            EHCache (&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103;)
                        </td><td>
                            Hibernate &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1082;&#1101;&#1096; &#1087;&#1088;&#1086;&#1074;&#1072;&#1081;&#1076;&#1077;&#1088;&#1099; (cache providers)
                            &#1076;&#1083;&#1103; &#1082;&#1101;&#1096;&#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; (second-level cache).
                            EHCache -- &#1082;&#1101;&#1096; &#1087;&#1088;&#1086;&#1074;&#1072;&#1081;&#1076;&#1077;&#1088;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1101;&#1096; &#1087;&#1088;&#1086;&#1074;&#1072;&#1081;&#1076;&#1077;&#1088;
                            &#1085;&#1077; &#1073;&#1099;&#1083; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1087;&#1088;&#1080; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1080;.
                        </td></tr><tr><td>
                            Log4j (&#1086;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;)
                        </td><td>
                            Hibernate &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; Commons Logging API, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;, &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;, &#1084;&#1086;&#1078;&#1077;&#1090;
                            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; Log4j &#1085;&#1080;&#1078;&#1077;&#1083;&#1077;&#1078;&#1072;&#1097;&#1077;&#1075;&#1086; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1072; &#1083;&#1086;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.
                            &#1045;&#1089;&#1083;&#1080; Log4j &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1074; context classpath (<tt class="literal">webapps/quickstart/WEB-INF/lib</tt>),
                            Common Logging &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; Log4j
                            &#1080; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; <tt class="literal">log4j.properties</tt>, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081;
                            &#1074; <tt class="literal">webapps/quickstart/WEB-INF/classes</tt>
                            &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1092;&#1072;&#1081;&#1083;&#1072; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1076;&#1083;&#1103; Log4j &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072; Hibernate.
                            &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; log4j.jar &#1080; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;
                            <tt class="literal">src/log4j.properties</tt> &#1074; context classpath, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099;
                            &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1079;&#1072; &#1089;&#1094;&#1077;&#1085;&#1086;&#1081;.
                        </td></tr><tr><td>
                            &#1058;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;?
                        </td><td>
                            &#1042;&#1079;&#1075;&#1083;&#1103;&#1085;&#1080;&#1090;&#1077; &#1085;&#1072; &#1092;&#1072;&#1081;&#1083; <tt class="literal">lib/README.txt</tt> &#1080;&#1079; &#1076;&#1080;&#1089;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1080;&#1074;&#1072; Hibernate.
                            &#1069;&#1090;&#1086; &#1089;&#1072;&#1084;&#1099;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; (up-to-date) &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1080;&#1093; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;, &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093;
                            &#1089; Hibernate. &#1047;&#1076;&#1077;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1074;&#1089;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1077; &#1080; &#1086;&#1087;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1085;&#1099;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;.
                        </td></tr></tbody></table></div><p>
            &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1084; &#1086;&#1073;&#1097;&#1080;&#1081; &#1076;&#1083;&#1103; Hibernate &#1080; Tomcat
            &#1087;&#1091;&#1083; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (shared database connection pool).
            &#1069;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; Tomcat &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1091;&#1083; JDBC &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; (pooled JDBC connections)
            (&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081; DBCP &#1087;&#1091;&#1083;), Hibernate &#1079;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;
            &#1095;&#1077;&#1088;&#1077;&#1079; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; JNDI. Tomcat &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; (binds) &#1087;&#1091;&#1083; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; &#1082; JNDI,
            &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1084; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072; (resource declaration) &#1074; &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; Tomcat,
            <tt class="literal">TOMCAT/conf/server.xml</tt>:
        </p><pre class="programlisting">&lt;Context path="/quickstart" docBase="quickstart"&gt;
    &lt;Resource name="jdbc/quickstart" scope="Shareable" type="javax.sql.DataSource"/&gt;
    &lt;ResourceParams name="jdbc/quickstart"&gt;
        &lt;parameter&gt;
            &lt;name&gt;factory&lt;/name&gt;
            &lt;value&gt;org.apache.commons.dbcp.BasicDataSourceFactory&lt;/value&gt;
        &lt;/parameter&gt;

        &lt;!-- DBCP database connection settings --&gt;
        &lt;parameter&gt;
            &lt;name&gt;url&lt;/name&gt;
            &lt;value&gt;jdbc:postgresql://localhost/quickstart&lt;/value&gt;
        &lt;/parameter&gt;
        &lt;parameter&gt;
            &lt;name&gt;driverClassName&lt;/name&gt;&lt;value&gt;org.postgresql.Driver&lt;/value&gt;
        &lt;/parameter&gt;
        &lt;parameter&gt;
            &lt;name&gt;username&lt;/name&gt;
            &lt;value&gt;quickstart&lt;/value&gt;
        &lt;/parameter&gt;
        &lt;parameter&gt;
            &lt;name&gt;password&lt;/name&gt;
            &lt;value&gt;secret&lt;/value&gt;
        &lt;/parameter&gt;

        &lt;!-- DBCP connection pooling options --&gt;
        &lt;parameter&gt;
            &lt;name&gt;maxWait&lt;/name&gt;
            &lt;value&gt;3000&lt;/value&gt;
        &lt;/parameter&gt;
        &lt;parameter&gt;
            &lt;name&gt;maxIdle&lt;/name&gt;
            &lt;value&gt;100&lt;/value&gt;
        &lt;/parameter&gt;
        &lt;parameter&gt;
            &lt;name&gt;maxActive&lt;/name&gt;
            &lt;value&gt;10&lt;/value&gt;
        &lt;/parameter&gt;
    &lt;/ResourceParams&gt;
&lt;/Context&gt;</pre><p>
            &#1050;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;, &#1089;&#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077;, &#1085;&#1072;&#1079;&#1074;&#1072;&#1085; <tt class="literal">quickstart</tt>,
            &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; <tt class="literal">TOMCAT/webapp/quickstart</tt>.
            &#1044;&#1083;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1083;&#1102;&#1073;&#1086;&#1084;&#1091; &#1080;&#1079; &#1089;&#1077;&#1088;&#1074;&#1083;&#1077;&#1090;&#1086;&#1074; (servlets), &#1074; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1077; &#1085;&#1072;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1091;&#1090;&#1100;
            <tt class="literal">http://localhost:8080/quickstart</tt> (&#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1074; &#1080;&#1084;&#1103; &#1089;&#1077;&#1088;&#1074;&#1083;&#1077;&#1090;&#1072;,
            &#1089;&#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1074;&#1072;&#1096;&#1077;&#1084; <tt class="literal">web.xml</tt>).
            &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1100; &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1089;&#1077;&#1088;&#1074;&#1083;&#1077;&#1090; &#1089; &#1087;&#1091;&#1089;&#1090;&#1099;&#1084;  &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084;
            <tt class="literal">process()</tt>.
		</p><p>
            &#1057; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1084;&#1080; Tomcat &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; DBCP &#1087;&#1091;&#1083; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; &#1080; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;
            &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; JDBC <tt class="literal">Connection</tt> &#1080;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1091;&#1083;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; JNDI &#1080;&#1084;&#1103;
            <tt class="literal">java:comp/env/jdbc/quickstart</tt>.
            &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1080;&#1089;&#1087;&#1099;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099; &#1089; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1086;&#1081; &#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1081; &#1087;&#1091;&#1083;&#1072; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077;&#1089;&#1100;
            &#1082; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; Tomcat. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1089; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1077;&#1081;
            &#1086;&#1090; JDBC &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088;&#1072; (JDBC driver exception messages), &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1089;&#1087;&#1077;&#1088;&#1074;&#1072; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100;
            &#1087;&#1091;&#1083; JDBC &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; &#1073;&#1077;&#1079; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1077;&#1075;&#1086; &#1074; Hibernate.
            &#1059;&#1095;&#1077;&#1073;&#1085;&#1099;&#1081; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083; "Tomcat &amp; JDBC" &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1074; Web.
        </p><p>
            &#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1096;&#1072;&#1075;&#1086;&#1084; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1084; Hibernate &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1091;&#1083;&#1072; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081;
            &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; (bound) &#1095;&#1077;&#1088;&#1077;&#1079; JNDI.
            &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1091; Hibernate &#1095;&#1077;&#1088;&#1077;&#1079; XML-&#1092;&#1072;&#1081;&#1083;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;, &#1095;&#1077;&#1088;&#1077;&#1079; &#1092;&#1072;&#1081;&#1083;
            Java-&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; (properties), &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1077;&#1085;, &#1085;&#1086; &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1085;&#1099;&#1093;
            &#1086;&#1087;&#1094;&#1080;&#1081;. &#1052;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1091; &#1095;&#1077;&#1088;&#1077;&#1079; XML, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;
            &#1086;&#1085;&#1072; &#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1076;&#1086;&#1073;&#1085;&#1072;. &#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081;  XML-&#1092;&#1072;&#1081;&#1083; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;
            &#1074; context classpath (<tt class="literal">WEB-INF/classes</tt>), &#1087;&#1086;&#1076; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;
            <tt class="literal">hibernate.cfg.xml</tt>:
        </p><pre class="programlisting">&lt;?xml version='1.0' encoding='utf-8'?&gt;
&lt;!DOCTYPE hibernate-configuration
    PUBLIC "-//Hibernate/Hibernate Configuration DTD//EN"
    "http://hibernate.sourceforge.net/hibernate-configuration-2.0.dtd"&gt;

&lt;hibernate-configuration&gt;

    &lt;session-factory&gt;

        &lt;property name="connection.datasource"&gt;java:comp/env/jdbc/quickstart&lt;/property&gt;
        &lt;property name="show_sql"&gt;false&lt;/property&gt;
        &lt;property name="dialect"&gt;net.sf.hibernate.dialect.PostgreSQLDialect&lt;/property&gt;

        &lt;!-- Mapping files --&gt;
        &lt;mapping resource="Cat.hbm.xml"/&gt;

    &lt;/session-factory&gt;

&lt;/hibernate-configuration&gt;</pre><p>
            &#1052;&#1099; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1083;&#1080; &#1083;&#1086;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; SQL &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;, &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1076;&#1080;&#1072;&#1083;&#1077;&#1082;&#1090; SQL &#1080;
            &#1091;&#1082;&#1072;&#1079;&#1072;&#1083;&#1080;, &#1082;&#1072;&#1082; Hibernate &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; JDBC &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; (&#1086;&#1073;&#1098;&#1103;&#1074;&#1080;&#1074; JNDI &#1080;&#1084;&#1103;,
            &#1082; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; Tomcat &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1083; &#1087;&#1091;&#1083; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081;).
            &#1044;&#1080;&#1072;&#1083;&#1077;&#1082;&#1090; (dialect) &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084;,
            &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1074;&#1086;&#1077;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1094;&#1080;&#1077;&#1081; SQL "&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1072;" (&#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090; &#1077;&#1075;&#1086;
            &#1087;&#1086; &#1089;&#1074;&#1086;&#1077;&#1084;&#1091;). Hibernate &#1073;&#1077;&#1088;&#1077;&#1090; &#1079;&#1072;&#1073;&#1086;&#1090;&#1091; &#1086;&#1073; &#1101;&#1090;&#1080;&#1093; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1103;&#1093; &#1085;&#1072; &#1089;&#1077;&#1073;&#1103; &#1080; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;
            &#1076;&#1080;&#1072;&#1083;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1084;&#1077;&#1088;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084;
            &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1084; &#1082;&#1086;&#1076;&#1086;&#1084;.
        </p><p>
            <tt class="literal">SessionFactory</tt> -- &#1101;&#1090;&#1086; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1103; &#1077;&#1076;&#1080;&#1085;&#1086;&#1075;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
            (single datastore). &#1055;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093;  &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; XML-&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;
            &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;
            (&#1087;&#1086; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;) <tt class="literal">Configuration</tt> &#1080;
            <tt class="literal">SessionFactory</tt>.
        </p><p>
            &#1057;&#1072;&#1084;&#1099;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074; <tt class="literal">hibernate.cfg.xml</tt>, &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;
            <tt class="literal">Cat.hbm.xml</tt> &#1082;&#1072;&#1082; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; XML-&#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072; &#1076;&#1083;&#1103; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1077;&#1075;&#1086;
            &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; (persistent class) <tt class="literal">Cat</tt>. &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077;,
            &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1076;&#1083;&#1103; Hibernate, &#1082;&#1072;&#1082; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; POJO &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;
            (POJO class) &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (&#1080;&#1083;&#1080; &#1074; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;).
            &#1042;&#1089;&#1082;&#1086;&#1088;&#1077; &#1084;&#1099; &#1074;&#1077;&#1088;&#1085;&#1077;&#1084;&#1089;&#1103; &#1082; &#1101;&#1090;&#1086;&#1084;&#1091; &#1092;&#1072;&#1081;&#1083;&#1091;. &#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084;
            POJO &#1082;&#1083;&#1072;&#1089;&#1089;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1086;&#1073;&#1098;&#1103;&#1074;&#1080;&#1084; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072; (mapping metadata) &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;
            POJO &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.
        </p><p><a name="quickstart-intro-shl-mapping-def"></a>
            </p><div class="variablelist"><dl><dt><span class="term">&#1052;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;</span></dt><dd><p>
                            &#1054;&#1090; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072; "mapping" --
                            "&#1085;&#1072;&#1085;&#1077;&#1089;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1082;&#1072;&#1088;&#1090;&#1091;; &#1074;&#1099;&#1095;&#1077;&#1088;&#1095;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1072;&#1088;&#1090;; &#1082;&#1072;&#1088;&#1090;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1103;; &#1090;&#1086;&#1087;&#1086;&#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1098;&#1077;&#1084;&#1082;&#1072;".
                            &#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;/&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (POJO)
                            &#1074; &#1088;&#1077;&#1083;&#1103;&#1094;&#1080;&#1086;&#1085;&#1085;&#1091;&#1102; (relational) &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1080;, &#1085;&#1072;&#1086;&#1073;&#1086;&#1088;&#1086;&#1090;, &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1088;&#1077;&#1083;&#1103;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;
                            &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1091;&#1102; &#1087;&#1086; &#1077;&#1076;&#1080;&#1085;&#1099;&#1084; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072;&#1084;, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; XML-&#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072; (XML mapping file).
                            &#1044;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;&#1080;, &#1090;&#1077;&#1088;&#1084;&#1080;&#1085; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; Java &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;
                            &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
                        </p></dd></dl></div><p>
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="quickstart-persistentclass"></a>1.2. &#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; (persistent class)</h2></div></div><div></div></div><p>
            &#1053;&#1072;&#1080;&#1083;&#1091;&#1095;&#1096;&#1072;&#1103; &#1076;&#1083;&#1103; Hibernate &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; -- &#1101;&#1090;&#1086;
            Plain Old Java Objects (POJOs, &#1080;&#1085;&#1086;&#1075;&#1076;&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103;
            Plain Ordinary Java Objects).
            POJO &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1093;&#1086;&#1078; &#1085;&#1072; JavaBean &#1089;&#1086; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; (properties), &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079;
            getter- &#1080; setter-&#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1103;&#1095;&#1091;&#1090; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;
            &#1086;&#1090; &#1087;&#1091;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;:
        </p><pre class="programlisting">package net.sf.hibernate.examples.quickstart;

public class Cat {

    private String id;
    private String name;
    private char sex;
    private float weight;

    public Cat() {
    }

    public String getId() {
        return id;
    }

    private void setId(String id) {
        this.id = id;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public char getSex() {
        return sex;
    }

    public void setSex(char sex) {
        this.sex = sex;
    }

    public float getWeight() {
        return weight;
    }

    public void setWeight(float weight) {
        this.weight = weight;
    }

}</pre><p>
            Hibernate &#1085;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1090;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074;, &#1074;&#1089;&#1077; Java
            &#1090;&#1080;&#1087;&#1099; &#1080; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1099; (&#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; <tt class="literal">String</tt>, <tt class="literal">char</tt>
            &#1080; <tt class="literal">Date</tt>) &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1087;&#1088;&#1080; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1077;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1080;&#1079;
            Java Collections Framework. &#1048;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1084;&#1101;&#1087;&#1087;&#1080;&#1075;&#1077; &#1082;&#1072;&#1082; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; (values),
            &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; (collections of values) &#1080;&#1083;&#1080; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1080; (associations) &#1082; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;
            &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084; (entities). &#1057;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; (property) <tt class="literal">id</tt>
            &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1080;&#1079; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (primary key) &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
            &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1086;&#1074;&#1072;&#1085;&#1086; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080; &#1090;&#1072;&#1082;&#1080;&#1084;&#1080; &#1082;&#1072;&#1082; <tt class="literal">Cat</tt>.
            Hibernate &#1084;&#1086;&#1075; &#1073;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1089;&#1074;&#1086;&#1080;&#1093; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1093; &#1085;&#1091;&#1078;&#1076;,
            &#1085;&#1086; &#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1103; &#1080;&#1093;, &#1084;&#1099; &#1073;&#1099; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1083;&#1080; &#1095;&#1072;&#1089;&#1090;&#1100; &#1075;&#1080;&#1073;&#1082;&#1086;&#1089;&#1090;&#1080; &#1074; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1077; &#1085;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
        </p><p>
            &#1052;&#1099; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1074; &#1076;&#1083;&#1103; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;
            (persistent classes), &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;&#1096;&#1080; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1086;&#1090; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;
            &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1050; &#1090;&#1086;&#1084;&#1091; &#1078;&#1077;, Hibernate &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1082;
            &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1080; &#1073;&#1072;&#1081;&#1090;-&#1082;&#1086;&#1076;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1089;&#1073;&#1086;&#1088;&#1082;&#1080;, &#1086;&#1085; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1088;&#1077;&#1092;&#1083;&#1077;&#1082;&#1089;&#1080;&#1102;
            (reflection) &#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; (runtime class enhancement), &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103;
            &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1091; CGLIB. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1085;&#1077; &#1080;&#1084;&#1077;&#1103; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1077;&#1081; &#1086;&#1090; Hibernate &#1074; &#1085;&#1072;&#1096;&#1077;&#1084; POJO &#1082;&#1083;&#1072;&#1089;&#1089;&#1077;,
            &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100;/&#1079;&#1072;&#1084;&#1101;&#1087;&#1080;&#1090;&#1100; &#1085;&#1072;&#1096; &#1082;&#1083;&#1072;&#1089;&#1089; &#1085;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="quickstart-mapping"></a>1.3. &#1047;&#1072;&#1084;&#1101;&#1087;&#1080;&#1084; &#1082;&#1086;&#1090;&#1072;</h2></div></div><div></div></div><p>
            &#1060;&#1072;&#1081;&#1083; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072; <tt class="literal">Cat.hbm.xml</tt>, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1084;&#1077;&#1090;&#1077;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077;
            &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;/&#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;
            &#1088;&#1077;&#1083;&#1103;&#1094;&#1080;&#1086;&#1085;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; (object/relational mapping). &#1052;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;
            &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;/&#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1085;&#1072; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1080;
            &#1080; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1077; &#1082;&#1083;&#1102;&#1095;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
        </p><pre class="programlisting">&lt;?xml version="1.0"?&gt;
&lt;!DOCTYPE hibernate-mapping
    PUBLIC "-//Hibernate/Hibernate Mapping DTD//EN"
    "http://hibernate.sourceforge.net/hibernate-mapping-2.0.dtd"&gt;

&lt;hibernate-mapping&gt;

    &lt;class name="net.sf.hibernate.examples.quickstart.Cat" table="CAT"&gt;

        &lt;!-- A 32 hex character is our surrogate key. It's automatically
            generated by Hibernate with the UUID pattern. --&gt;
        &lt;id name="id" type="string" unsaved-value="null" &gt;
            &lt;column name="CAT_ID" sql-type="char(32)" not-null="true"/&gt;
            &lt;generator class="uuid.hex"/&gt;
        &lt;/id&gt;

        &lt;!-- A cat has to have a name, but it shouldn' be too long. --&gt;
        &lt;property name="name"&gt;
            &lt;column name="NAME" length="16" not-null="true"/&gt;
        &lt;/property&gt;

        &lt;property name="sex"/&gt;

        &lt;property name="weight"/&gt;

    &lt;/class&gt;

&lt;/hibernate-mapping&gt;</pre><p>
            &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1081; (persistent) &#1082;&#1083;&#1072;&#1089;&#1089; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1084;&#1077;&#1090;&#1100; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; (&#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;,
            &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080; (entities); &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1079;&#1072;&#1084;&#1101;&#1087;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1072;&#1082; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;
            (components) &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1077; &#1080;&#1084;&#1077;&#1090;&#1100; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;). &#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1090;&#1086;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1090;&#1100;
            &#1076;&#1086;&#1083;&#1075;&#1086;&#1078;&#1080;&#1074;&#1091;&#1097;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;: &#1076;&#1074;&#1072; &#1082;&#1086;&#1090;&#1072; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1099; &#1077;&#1089;&#1083;&#1080; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;
            <tt class="literal">catA.getId().equals(catB.getId())</tt> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1099;&#1084;, &#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1103; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;
            <span class="emphasis"><em>&#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</em></span> (database identity).
            Hibernate &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1077;&#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;
            (&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1088;&#1086;&#1076;&#1085;&#1099;&#1077; (native) &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099;, &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; database sequence,
            hi/lo &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094; &#1080; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;).
            &#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077;, &#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; UUID-&#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; (&#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1086;&#1074;&#1072;&#1085; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1099;&#1093; &#1094;&#1077;&#1083;&#1077;&#1081;,
            &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1091;&#1088;&#1088;&#1086;&#1075;&#1072;&#1090;&#1085;&#1099;&#1081; &#1082;&#1083;&#1102;&#1095;, &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077;
            &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;). &#1058;&#1072;&#1082;&#1078;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1091; <tt class="literal">CAT_ID</tt> &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; <tt class="literal">CAT</tt>,
            &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1076; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; (&#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1099;&#1081; &#1082;&#1083;&#1102;&#1095; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;).
        </p><p>
            &#1042;&#1089;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <tt class="literal">Cat</tt> &#1079;&#1072;&#1084;&#1101;&#1087;&#1083;&#1077;&#1085;&#1099;/&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1091; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;.
            &#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <tt class="literal">name</tt> &#1084;&#1099; &#1079;&#1072;&#1084;&#1101;&#1087;&#1080;&#1083;&#1080; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1103;&#1074;&#1085;&#1086;&#1075;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1080;&#1084;&#1077;&#1085;&#1080;
            &#1082;&#1086;&#1083;&#1086;&#1082;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1044;&#1072;&#1085;&#1085;&#1072;&#1103; &#1090;&#1077;&#1093;&#1085;&#1080;&#1082;&#1072; &#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1074;&#1072;&#1078;&#1085;&#1072; &#1087;&#1088;&#1080; &#1089;&#1093;&#1077;&#1084;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (SQL DDL &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;),
            &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1080;&#1079; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1086;&#1074; Hibernate &#1089; &#1080;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;
            &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <span class="emphasis"><em>SchemaExport</em></span>.
            &#1042;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1079;&#1072;&#1084;&#1101;&#1087;&#1083;&#1077;&#1085;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; Hibernate &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1103;,
            &#1101;&#1090;&#1086; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1084; &#1074;&#1072;&#1084; &#1080; &#1085;&#1072;&#1076;&#1086;. &#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; <tt class="literal">CAT</tt> &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
            &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1082;&#1072;&#1082;:
        </p><pre class="programlisting">
 &#1050;&#1086;&#1083;&#1086;&#1085;&#1082;&#1072; |          &#1058;&#1080;&#1087;          | &#1052;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;
---------+-----------------------+------------
 cat_id  | character(32)         | not null
 name    | character varying(16) | not null
 sex     | character(1)          |
 weight  | real                  |
Indexes: cat_pkey primary key btree (cat_id)</pre><p>
            &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1090;&#1091; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1087;&#1086;&#1079;&#1078;&#1077; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1081;&#1090;&#1077;
            <a href="toolsetguide.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 15. Toolset Guide">&#1043;&#1083;&#1072;&#1074;&#1072;&nbsp;15, <i>Toolset Guide</i></a>, &#1077;&#1089;&#1083;&#1080; &#1078;&#1077;&#1083;&#1072;&#1077;&#1090;&#1077; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;
            &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; SchemaExport. &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1091;&#1084;&#1077;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081;
            SQL DDL &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081; &#1085;&#1072; &#1090;&#1080;&#1087;&#1099; (???)
            (custom column type constraints), &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; (unique constraints)
            &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1074;.
    	</p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="quickstart-playingwithcats"></a>1.4. &#1055;&#1086;&#1080;&#1075;&#1088;&#1072;&#1077;&#1084; &#1089; &#1082;&#1086;&#1090;&#1072;&#1084;&#1080;</h2></div></div><div></div></div><p>
            &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1099; &#1075;&#1086;&#1090;&#1086;&#1074;&#1099; &#1089;&#1090;&#1072;&#1088;&#1090;&#1086;&#1074;&#1072;&#1090;&#1100; Hibernate <tt class="literal">Session</tt>.
            <tt class="literal">Session</tt> -- &#1101;&#1090;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; <span class="emphasis"><em>&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1089;&#1090;&#1074;&#1086;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</em></span>
            (persistence manager), &#1086;&#1085; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079; &#1085;&#1077;&#1077;
            &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <tt class="literal">Cat</tt>. &#1053;&#1086; &#1089; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;
            <tt class="literal">Session</tt> &#1080;&#1079; <tt class="literal">SessionFactory</tt>,
            <tt class="literal">Session</tt> &#1074; Hibernate &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1077;&#1081;-&#1088;&#1072;&#1073;&#1086;&#1090;&#1099; (unit-of-work):
        </p><pre class="programlisting">SessionFactory sessionFactory =
            new Configuration().configure().buildSessionFactory();</pre><p>
            &#1054;&#1076;&#1080;&#1085; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; <tt class="literal">SessionFactory</tt> &#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1074;&#1077;&#1085;&#1085;&#1077;&#1085; &#1079;&#1072; &#1086;&#1076;&#1085;&#1091; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
            &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; XML-&#1092;&#1072;&#1081;&#1083; (<tt class="literal">hibernate.cfg.xml</tt>).
            <span class="emphasis"><em>&#1044;&#1086; &#1090;&#1086;&#1075;&#1086;</em></span> &#1082;&#1072;&#1082; &#1074;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; <tt class="literal">SessionFactory</tt>,
            &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; (&#1080; &#1076;&#1072;&#1078;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1084;&#1101;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072;) &#1087;&#1091;&#1090;&#1077;&#1084; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082;
            <tt class="literal">Configuration</tt>. &#1058;.&#1082;. <tt class="literal">SessionFactory</tt> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084; (immutable),
            &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1080; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1095;&#1077;&#1088;&#1077;&#1079; <tt class="literal">Configuration</tt>
            &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1083;&#1103;&#1088;&#1072; <tt class="literal">SessionFactory</tt>. &#1043;&#1076;&#1077; &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084;
            &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; <tt class="literal">SessionFactory</tt> &#1080; &#1082;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1082; &#1085;&#1077;&#1084;&#1091; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1080;&#1079;
            &#1085;&#1072; &#1096;&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;?
        </p><p>
            &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; <tt class="literal">SessionFactory</tt> &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079;,
            &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1088;&#1080; &#1089;&#1090;&#1072;&#1088;&#1090;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <span class="emphasis"><em>load-on-startup</em></span>
            &#1089;&#1077;&#1088;&#1074;&#1083;&#1077;&#1090;&#1072; (Java Servlet).
            &#1069;&#1090;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1095;&#1090;&#1086; &#1074;&#1099; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;-&#1095;&#1083;&#1077;&#1085;&#1077; &#1074;&#1072;&#1096;&#1077;&#1075;&#1086; &#1089;&#1077;&#1088;&#1074;&#1083;&#1077;&#1090;&#1072;, &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086;
            &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;. &#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1083;&#1077;&#1075;&#1082;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1101;&#1082;&#1079;&#1077;&#1084;&#1083;&#1103;&#1088;&#1091;
            <tt class="literal">SessionFactory</tt>, &#1085;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1088;&#1086;&#1076;&#1072; <span class="emphasis"><em>Singleton</em></span>.
            &#1055;&#1086;&#1076;&#1093;&#1086;&#1076; &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1081; &#1076;&#1072;&#1083;&#1077;&#1077;, &#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1086;&#1073;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;: &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103; &#1080; &#1083;&#1077;&#1075;&#1082;&#1080;&#1081; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082;
            <tt class="literal">SessionFactory</tt>.
		</p><p>
            &#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1084; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; <tt class="literal">HibernateUtil</tt>:
		</p><pre class="programlisting">import net.sf.hibernate.*;
import net.sf.hibernate.cfg.*;

public class HibernateUtil {

    private static final SessionFactory sessionFactory;

    static {
        try {
            // Create the SessionFactory
            sessionFactory = new Configuration().configure().buildSessionFactory();
        } catch (HibernateException ex) {
            throw new RuntimeException("Configuration problem: " + ex.getMessage(), ex);
        }
    }

    public static final ThreadLocal session = new ThreadLocal();

    public static Session currentSession() throws HibernateException {
        Session s = (Session) session.get();
        // Open a new Session, if this Thread has none yet
        if (s == null) {
            s = sessionFactory.openSession();
            session.set(s);
        }
        return s;
    }

    public static void closeSession() throws HibernateException {
        Session s = (Session) session.get();
        session.set(null);
        if (s != null)
            s.close();
    }
}</pre><p>
            &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1089;&#1103; &#1086; <tt class="literal">SessionFactory</tt>,
            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1095;&#1083;&#1077;&#1085; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; <tt class="literal">ThreadLocal</tt>
            &#1095;&#1083;&#1077;&#1085;, &#1076;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; <tt class="literal">Session</tt> &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;.
            &#1055;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084; &#1082;&#1072;&#1082; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089;, &#1091;&#1076;&#1086;&#1089;&#1090;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1077;
            Java-&#1082;&#1086;&#1085;&#1094;&#1077;&#1087;&#1094;&#1080;&#1102; thread-local &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;.
		</p><p>
            <tt class="literal">SessionFactory</tt> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;-&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; (threadsafe class),
            &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1101;&#1082;&#1079;&#1077;&#1084;&#1083;&#1103;&#1088;&#1091; &#1080; &#1079;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1090;&#1100; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;
            (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1099; <tt class="literal">Session</tt>). &#1069;&#1082;&#1079;&#1077;&#1084;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <tt class="literal">Session</tt>, &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
            &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;-&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1084; (non-threadsafe), &#1086;&#1085; &#1087;&#1088;&#1077;&#1076;&#1089;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091;-&#1088;&#1072;&#1073;&#1086;&#1090;&#1099; (single unit-of-work)
            &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1057;&#1077;&#1089;&#1089;&#1080;&#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <tt class="literal">SessionFactory</tt> &#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;
            &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1089;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1072;:
        </p><pre class="programlisting">Session session = HibernateUtil.currentSession();

Transaction tx= session.beginTransaction();

Cat princess = new Cat();
princess.setName("Princess");
princess.setSex('F');
princess.setWeight(7.4f);

session.save(princess);
tx.commit();

HibernateUtil.closeSession();</pre><p>
            &#1042; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;, &#1074;&#1089;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1103;&#1090; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;, &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103; &#1080;&#1079;&#1086;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
            (&#1076;&#1072;&#1078;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072; &#1095;&#1090;&#1077;&#1085;&#1080;&#1077;) &#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093; &#1080;&#1079; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081;.
            &#1052;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; Hibernates <tt class="literal">Transaction</tt> API &#1076;&#1083;&#1103; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090;
            &#1085;&#1077;&#1078;&#1077;&#1083;&#1077;&#1078;&#1072;&#1097;&#1077;&#1081; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1080;, &#1074; &#1085;&#1072;&#1096;&#1077;&#1084; &#1074;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1090; JDBC &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;
            &#1085;&#1072;&#1096; &#1082;&#1086;&#1076; &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077; &#1089; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1084;&#1080; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1086;&#1084; (container-managed transactions, JTA)
            &#1073;&#1077;&#1079; &#1082;&#1072;&#1082;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;. &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1074;&#1077;&#1088;&#1093;&#1091; &#1085;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;
            &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080;.
        </p><p>
            &#1058;&#1072;&#1082;&#1078;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; <tt class="literal">HibernateUtil.currentSession();</tt>
            &#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079; &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077;, &#1074;&#1099; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102; &#1076;&#1083;&#1103; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1074;&#1072;&#1096; &#1082;&#1086;&#1076;.
            &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1076;&#1086;&#1089;&#1090;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;&#1089;&#1103; &#1095;&#1090;&#1086; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086; &#1082;&#1072;&#1082; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1072; &#1074;&#1072;&#1096;&#1072; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072;-&#1088;&#1072;&#1073;&#1086;&#1090;&#1099; (unit-of-work),
            &#1083;&#1080;&#1073;&#1086; &#1074; &#1082;&#1086;&#1076;&#1077; &#1089;&#1077;&#1088;&#1074;&#1083;&#1077;&#1090;&#1072;, &#1083;&#1080;&#1073;&#1086; &#1074; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1077; (servlet filter), &#1076;&#1086; &#1090;&#1086;&#1075;&#1086; &#1082;&#1072;&#1082; &#1073;&#1099;&#1083; &#1087;&#1086;&#1089;&#1083;&#1072;&#1085; HTTP &#1086;&#1090;&#1082;&#1083;&#1080;&#1082; (HTTP response).
            &#1055;&#1088;&#1080;&#1103;&#1090;&#1085;&#1099;&#1081; &#1087;&#1086;&#1073;&#1086;&#1095;&#1085;&#1099;&#1081; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090; &#1086;&#1090; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1072;&#1084;&#1099;&#1084; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; HTTP &#1086;&#1090;&#1082;&#1083;&#1080;&#1082;&#1072;, --
            &#1101;&#1090;&#1086; "&#1083;&#1077;&#1085;&#1080;&#1074;&#1072;&#1103;" &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; POJO &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;: &#1090;.&#1082;. &#1087;&#1088;&#1080; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; (HTML),
            &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1072;, Hibernate &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100; &#1085;&#1077;&#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1080;
            &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1087;&#1086; &#1084;&#1077;&#1088;&#1077; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082; &#1085;&#1080;&#1084;.
        </p><p>
            Hibernate &#1080;&#1084;&#1077;&#1077;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080;&#1079; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
            &#1053;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1075;&#1080;&#1073;&#1082;&#1080;&#1081; -- &#1101;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; Hibernate Query Language (HQL). HQL --
            &#1101;&#1090;&#1086; &#1083;&#1077;&#1075;&#1082;&#1080;&#1081; &#1074; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1080; &#1084;&#1086;&#1097;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1099;&#1081; &#1103;&#1079;&#1099;&#1082;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103;
            &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; SQL:
        </p><pre class="programlisting">Transaction tx = session.beginTransaction();

Query query = session.createQuery("select c from Cat as c where c.sex = :sex");
query.setCharacter("sex", 'F');
for (Iterator it = query.iterate(); it.hasNext();) {
    Cat cat = (Cat) it.next();
    out.println("Female Cat: " + cat.getName() );
}

tx.commit();</pre><p>
            Hibernate &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; <span class="emphasis"><em>query by criteria</em></span> API
            (&#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1087;&#1086; &#1082;&#1088;&#1080;&#1090;&#1077;&#1088;&#1080;&#1102;), &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; API &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1073;&#1077;&#1089;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;.
            &#1053;&#1091; &#1080; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; Hibernate &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; <tt class="literal">PreparedStatement</tt> &#1080; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1082;&#1091;
            &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; (parameter binding) &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; SQL-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042; &#1088;&#1077;&#1076;&#1082;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;, &#1074;&#1099;
            &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
            &#1085;&#1080;&#1079;&#1082;&#1086;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1074;&#1099;&#1077; SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1099; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1080;&#1083;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1080;&#1079; Hibernate <tt class="literal">Session</tt>,
            &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; JDBC <tt class="literal">Connection</tt>
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="quickstart-summary"></a>1.5. &#1047;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;</h2></div></div><div></div></div><p>
            &#1042; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1084; &#1091;&#1095;&#1077;&#1073;&#1085;&#1086;&#1084; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1077;, &#1084;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1085;&#1086; &#1082;&#1086;&#1089;&#1085;&#1091;&#1083;&#1080;&#1089;&#1100; Hibernate.
            &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;&#1089;&#1090;&#1072;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1074; &#1085;&#1072;&#1096;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1084;&#1099; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1084;&#1077;&#1088;&#1077;&#1085;&#1085;&#1086; &#1085;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1083;&#1080; &#1082;&#1086;&#1076;
            &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1089;&#1077;&#1088;&#1074;&#1083;&#1077;&#1090;&#1086;&#1074;. &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100;
            &#1074;&#1099;&#1079;&#1086;&#1074;&#1099; Hibernate &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;.
        </p><p>
            &#1055;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; Hibernate, &#1082;&#1072;&#1082; &#1089;&#1083;&#1086;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084; (data access layer), &#1090;&#1077;&#1089;&#1085;&#1086;
            &#1080;&#1085;&#1090;&#1077;&#1075;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1074; &#1074;&#1072;&#1096;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1074;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1083;&#1086;&#1080; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1099; &#1086;&#1090; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1072;
            &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; (persistence mechanism).
            &#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100; &#1095;&#1090;&#1086; &#1074;&#1099; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1076;&#1080;&#1079;&#1072;&#1081;&#1085;.
        </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="preface.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="architecture.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1055;&#1088;&#1077;&#1076;&#1080;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top">&nbsp;&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1040;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072;</td></tr></table></div></body></html>