<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#1043;&#1083;&#1072;&#1074;&#1072; 10. &#1058;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1050;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; (Transactions And Concurrency)</title><link rel="stylesheet" href="../shared/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.65.1"><link rel="home" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="up" href="index.html" title="HIBERNATE - Relational Persistence for Idiomatic Java"><link rel="previous" href="manipulatingdata.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 9. Manipulating Persistent Data"><link rel="next" href="queryhql.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 11. HQL: &#1071;&#1079;&#1099;&#1082; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; Hibernate (The Hibernate Query Language)"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 10. &#1058;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1050;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; (Transactions And Concurrency)</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="manipulatingdata.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="queryhql.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="chapter" lang="ru"><div class="titlepage"><div><div><h2 class="title"><a name="transactions"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 10. &#1058;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1050;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; (Transactions And Concurrency)</h2></div></div><div></div></div><p>
        Hibernate &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1069;&#1090;&#1086; &#1083;&#1077;&#1075;&#1082;&#1086;&#1074;&#1077;&#1089;&#1085;&#1099;&#1081; &#1080;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1088;&#1077;&#1083;&#1103;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1075;&#1086;
        &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1084;&#1072;&#1087;&#1087;&#1080;&#1085;&#1075;&#1072;). &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; &#1076;&#1077;&#1083;&#1077;&#1075;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
        &#1045;&#1089;&#1083;&#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1086;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1072; &#1089; JTA, &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; <tt class="literal">Session</tt>
        &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090;&#1089;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100;&#1102; JTA &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1084;&#1099;&#1089;&#1083;&#1077; Hibernate &#1084;&#1086;&#1078;&#1085;&#1086; 
        &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1090;&#1086;&#1085;&#1082;&#1080;&#1081; &#1072;&#1076;&#1072;&#1087;&#1090;&#1077;&#1088; &#1082; JDBC, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; 
        &#1089;&#1077;&#1084;&#1072;&#1085;&#1090;&#1080;&#1082;&#1080;.
    </p><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-basics"></a>10.1. &#1050;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1072;&#1094;&#1080;&#1103;, c&#1077;&#1089;&#1089;&#1080;&#1080; (Sessions) &#1080; &#1092;&#1072;&#1073;&#1088;&#1080;&#1082;&#1080; (Factories)</h2></div></div><div></div></div><p>
            <tt class="literal">SessionFactory</tt> &#1101;&#1090;&#1086; &#1076;&#1086;&#1088;&#1086;&#1075;&#1086;&#1081; &#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080;, &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; 
            &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1087;&#1072;&#1088;&#1072;&#1083;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1074;&#1099;&#1079;&#1086;&#1074;&#1099; (threadsafe). &#1054;&#1085; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; 
            &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1080;&#1079; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
            <tt class="literal">Session</tt> &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1076;&#1077;&#1096;&#1077;&#1074;&#1099;&#1081; &#1080; &#1085;&#1077; 
            &#1085;&#1077; &#1088;&#1072;&#1089;&#1095;&#1080;&#1090;&#1072;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1074; &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; (non-threadsafe). &#1054;&#1085; 
            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079; &#1076;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1077;&#1085;&#1080;&#1103; &#1077;&#1076;&#1080;&#1085;&#1080;&#1095;&#1085;&#1086;&#1081; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1080; &#1079;&#1072;&#1090;&#1077;&#1084; 
            &#1086;&#1090;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; Hibernate &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1085;&#1072; 
            &#1089;&#1077;&#1088;&#1074;&#1083;&#1077;&#1090;&#1072;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;, &#1089;&#1077;&#1088;&#1074;&#1083;&#1077;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; <tt class="literal">SessionFactory</tt> 
            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1074;&#1099;&#1079;&#1086;&#1074;:
        </p><pre class="programlisting">SessionFactory sf = (SessionFactory)getServletContext().getAttribute("my.session.factory");</pre><p>
            &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1074;&#1099;&#1079;&#1086;&#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; service &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; <tt class="literal">Session</tt>,
            &#1089;&#1073;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; (&#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <tt class="literal">flush()</tt>), &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1088;&#1072;&#1079;&#1085;&#1072;&#1082;&#1094;&#1080;&#1102; (&#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; 
            &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <tt class="literal">commit()</tt>), &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102; (&#1084;&#1077;&#1090;&#1086;&#1076; <tt class="literal">close()</tt>)
            &#1080; &#1074; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1080; &#1086;&#1090;&#1073;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;. (<tt class="literal">SessionFactory</tt> &#1074; &#1089;&#1074;&#1086;. &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; 
            &#1074; JNDI &#1080;&#1083;&#1080; &#1074; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082;&#1072;&#1082;&#1086;&#1075;&#1086;-&#1085;&#1080;&#1073;&#1091;&#1076;&#1100; <span class="emphasis"><em>Singleton</em></span>'&#1072;.)
        </p><p>
            &#1044;&#1083;&#1103; stateless session bean &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080;&#1081; &#1078;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;. 
            <tt class="literal">SessionFactory</tt> &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; 
            <tt class="literal">setSessionContext()</tt>. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1084;&#1077;&#1090;&#1086;&#1076; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; 
            <tt class="literal">Session</tt>, &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1077;&#1077; (<tt class="literal">flush()</tt>) &#1080; 
            &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; (<tt class="literal">close()</tt>). (&#1054;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1103; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080; &#1085;&#1072; &#1089;&#1086;&#1074;&#1077;&#1089;&#1090;&#1080; JTA, 
            &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1080;&#1084;&#1080; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; container-managed transactions.)
        </p><p>
            &#1052;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080; (Hibernate <tt class="literal">Transaction</tt>) &#1082;&#1072;&#1082; &#1101;&#1090;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; 
            &#1074;&#1099;&#1096;&#1077;, &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; <tt class="literal">commit()</tt> Hibernate <tt class="literal">Transaction</tt>
            &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1080; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1102; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (&#1089;&#1086; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1086;&#1081; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;
            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; JTA &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081;).
        </p><p>
            &#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1074;&#1099; &#1087;&#1086;&#1085;&#1103;&#1083;&#1080; &#1089;&#1077;&#1084;&#1072;&#1085;&#1090;&#1080;&#1082;&#1091; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <tt class="literal">flush()</tt>.
            &#1057;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1089;&#1080;&#1089;&#1090;&#1077;&#1085;&#1090;&#1085;&#1086;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; &#1089; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
            &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1096;&#1083;&#1080; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1085;&#1086; <span class="emphasis"><em>&#1085;&#1077;</em></span> &#1085;&#1072;&#1086;&#1073;&#1072;&#1088;&#1086;&#1090;. &#1059;&#1095;&#1090;&#1080;&#1090;&#1077; &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; 
            Hibernate JDBC &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081;/&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081;, &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1080;&#1079;&#1086;&#1083;&#1103;&#1094;&#1080;&#1080; 
            &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1093; Hibernate!
        </p><p>
            &#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072;&#1093; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1099; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1077; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1099; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;
            &#1074;&#1077;&#1088;&#1089;&#1080;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1083;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1090;&#1086;&#1084;&#1072;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080; &#1090;&#1088;&#1072;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081;. &#1069;&#1090;&#1086; &#1087;&#1088;&#1086;&#1076;&#1091;&#1084;&#1072;&#1085;&#1085;&#1099;&#1077; "&#1087;&#1077;&#1088;&#1077;&#1076;&#1086;&#1074;&#1099;&#1077;"
            &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1099; &#1087;&#1088;&#1080; &#1087;&#1088;&#1080;&#1084;&#1080;&#1085;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100; &#1074;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;. 
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-threads"></a>10.2. &#1055;&#1086;&#1090;&#1086;&#1082;&#1080; &#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; (Threads and connections)</h2></div></div><div></div></div><p>
            &#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1077;&#1089;&#1089;&#1080;&#1081; Hibernate:
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    &#1053;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1077;&#1084; &#1086;&#1076;&#1080;&#1085; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; 
                    <tt class="literal">Session</tt> &#1080;&#1083;&#1080; <tt class="literal">Transaction</tt> &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; 
                    &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077;.
                </p></li><li><p>
                    &#1041;&#1091;&#1076;&#1100;&#1090;&#1077; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1074;&#1085;&#1080;&#1084;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1077;&#1084; &#1086;&#1076;&#1085;&#1086;&#1081; <tt class="literal">Session</tt>
                    &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;. &#1057;&#1072;&#1084;&#1072; &#1087;&#1086; &#1089;&#1077;&#1073;&#1077; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; <tt class="literal">Session</tt>
                    &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086;&#1073; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;&#1093; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;
                    &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; <tt class="literal">Session</tt> &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1096;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;.
                </p></li><li><p>
                    &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; <tt class="literal">Session</tt> <span class="emphasis"><em>&#1085;&#1077;</em></span> &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1082; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091;
                    &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; &#1080;&#1079; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074; (not threadsafe)! &#1053;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1081;&#1090;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;
                    &#1082; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1080; &#1090;&#1086;&#1084;&#1091; &#1078;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1091; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; <tt class="literal">Session</tt> &#1084;&#1077;&#1078;&#1076;&#1091; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084;&#1080; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;&#1084;&#1080;.
                    &#1057;&#1077;&#1089;&#1089;&#1080;&#1102; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1086;&#1076;&#1085;&#1086;&#1081; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; (unit-of-work)!
                </p></li></ul></div></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-identity"></a>10.3. &#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1077; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</h2></div></div><div></div></div><p>
            &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1080;&#1079; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1082; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1080; &#1090;&#1086;&#1084;&#1091; 
            &#1078;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1102; &#1087;&#1077;&#1088;&#1089;&#1080;&#1089;&#1090;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080; &#1090;&#1086;&#1090; &#1078;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1087;&#1077;&#1088;&#1089;&#1080;&#1089;&#1090;&#1077;&#1085;&#1090;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
            &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1074;&#1091;&#1084;&#1103; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103;&#1084;&#1080; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;&#1084;&#1080; <tt class="literal">Session</tt>).
            &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1076;&#1074;&#1072; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1087;&#1088;&#1077;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;:
        </p><div class="variablelist"><dl><dt><span class="term">&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</span></dt><dd><p>
                        <tt class="literal">foo.getId().equals( bar.getId() )</tt>
                    </p></dd><dt><span class="term">&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074; JVM</span></dt><dd><p>
                        <tt class="literal">foo==bar</tt>
                    </p></dd></dl></div><p>
            &#1044;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; (<tt class="literal">Session</tt>) &#1101;&#1090;&#1080; &#1076;&#1074;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1099;.
            &#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1087;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077; &#1080;&#1079; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074; &#1082; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1080; &#1090;&#1086;&#1084;&#1091; &#1078;&#1077; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091;
            &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1076;&#1074;&#1091;&#1093; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1089;&#1077;&#1089;&#1089;&#1080;&#1081;, &#1086;&#1085;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1090;&#1086;&#1095;&#1082;&#1080; &#1079;&#1088;&#1077;&#1085;&#1080;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; JVM.
        </p><p>
            &#1058;&#1072;&#1082;&#1086;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; Hibernae &#1080; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086; &#1087;&#1086;&#1074;&#1086;&#1076;&#1091; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086;
            &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;. &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1102; &#1085;&#1077;&#1090; &#1085;&#1091;&#1078;&#1076;&#1099; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; 
            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1077;&#1075;&#1086; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077;. &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082; &#1078;&#1077; &#1085;&#1077; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1080;&#1090;&#1089;&#1103; &#1086; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; 
            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <tt class="literal">==</tt> &#1076;&#1083;&#1103; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;.
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-optimistic"></a>10.4. &#1054;&#1087;&#1090;&#1080;&#1084;&#1080;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1103; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1087;&#1072;&#1088;&#1072;&#1083;&#1083;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;</h2></div></div><div></div></div><p>
            &#1052;&#1085;&#1086;&#1075;&#1080;&#1077; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1099; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; 
            &#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1077;&#1083;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1078;&#1072;&#1083;&#1086;&#1089;&#1100; &#1089; &#1076;&#1086;&#1089;&#1091;&#1087;&#1086;&#1084; &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042; &#1074;&#1077;&#1073;- &#1080; 
            &#1087;&#1088;&#1086;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; (enterprise) &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093; &#1085;&#1077;&#1087;&#1088;&#1080;&#1077;&#1084;&#1083;&#1077;&#1084;&#1086; &#1089;&#1086;&#1074;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080; 
            &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084; &#1094;&#1080;&#1082;&#1083;&#1086;&#1084; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1090;&#1089;&#1074;&#1080;&#1103; &#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;.
        </p><p>
            &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1080;&#1079;&#1086;&#1083;&#1103;&#1094;&#1080;&#1080; &#1073;&#1080;&#1079;&#1085;&#1077;&#1089;-&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1074; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1079;&#1086;&#1085;&#1091; &#1086;&#1090;&#1074;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; 
            &#1079;&#1074;&#1077;&#1085;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1084;&#1099; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084; &#1090;&#1072;&#1082;&#1086;&#1081; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1076;&#1086;&#1083;&#1075;&#1086;&#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1097;&#1077;&#1081;&#1089;&#1103;
            <span class="emphasis"><em>&#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1077;&#1081; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</em></span>. &#1054;&#1076;&#1085;&#1072; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; 
            &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081; &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1054;&#1085;&#1072; &#1072;&#1090;&#1086;&#1084;&#1072;&#1088;&#1085;&#1072; &#1077;&#1089;&#1083;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1085;&#1072; 
            (&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1103;&#1103;) &#1080;&#1079; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081; &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1072; &#1074;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
            &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;.
        </p><p>
            &#1058;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1086;&#1087;&#1090;&#1080;&#1084;&#1080;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; 
            &#1074;&#1099;&#1089;&#1086;&#1082;&#1091;&#1102; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1077;&#1084;&#1086;&#1089;&#1090;&#1100;. Hibernate &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1088;&#1080; 
            &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1087;&#1091;&#1090;&#1080; &#1076;&#1083;&#1103; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1080; 
            &#1086;&#1087;&#1090;&#1080;&#1084;&#1080;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;.
        </p><div class="sect2" lang="ru"><div class="titlepage"><div><div><h3 class="title"><a name="transactions-optimistic-longsession"></a>10.4.1. &#1044;&#1083;&#1080;&#1085;&#1085;&#1072;&#1103; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1089; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;</h3></div></div><div></div></div><p>
                &#1044;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1101;&#1082;&#1079;&#1077;&#1087;&#1083;&#1103;&#1088; 
                <tt class="literal">Session</tt> &#1080; &#1077;&#1077; &#1087;&#1077;&#1088;&#1089;&#1080;&#1089;&#1090;&#1077;&#1085;&#1090;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;.
            </p><p>
                &#1057;&#1077;&#1089;&#1089;&#1080;&#1103; (<tt class="literal">Session</tt>) &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1086;&#1087;&#1090;&#1080;&#1084;&#1080;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;
                &#1089; &#1074;&#1077;&#1088;&#1089;&#1080;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1076;&#1083;&#1103; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1080; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
                &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1077;&#1081; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1057;&#1077;&#1089;&#1089;&#1080;&#1103; (<tt class="literal">Session</tt>)
                &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090; JDBC &#1082;&#1086;&#1085;&#1085;&#1077;&#1082;&#1094;&#1080;&#1080; &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;.
                &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077;&#1085; &#1074; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1093; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1102;
                &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1090;&#1100; &#1074;&#1077;&#1088;&#1089;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100; &#1086;&#1090;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; (detached) 
                &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1099; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;. 
            </p><pre class="programlisting">// &#1069;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; foo &#1073;&#1099;&#1083; &#1088;&#1072;&#1085;&#1100;&#1096;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085; &#1074; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102;
session.reconnect();
foo.setProperty("bar");
session.flush();
session.connection().commit();
session.disconnect();</pre><p>
                &#1054;&#1073;&#1098;&#1077;&#1082;&#1090; <tt class="literal">foo</tt> &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1086;&#1087;&#1086;&#1079;&#1085;&#1072;&#1074;&#1072;&#1077;&#1084; &#1089;&#1077;&#1089;&#1089;&#1080;&#1077;&#1081; &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1077;&#1075;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1083;&#1072;.
                &#1055;&#1086;&#1082;&#1072; &#1074; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; <tt class="literal">Session</tt> &#1077;&#1089;&#1090;&#1100; JDBC &#1089;&#1086;&#1076;&#1077;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;, &#1084;&#1099; &#1082;&#1086;&#1084;&#1084;&#1080;&#1090;&#1080;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; 
                &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;.
            </p><p>
                &#1058;&#1072;&#1082;&#1086;&#1081; &#1087;&#1088;&#1080;&#1077;&#1084; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1085; &#1077;&#1089;&#1083;&#1080; &#1085;&#1072;&#1096;&#1072; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1074;&#1077;&#1083;&#1080;&#1082;&#1072; &#1076;&#1083;&#1103; &#1077;&#1077; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; 
                &#1074; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1076;&#1091;&#1084;&#1072;&#1077;&#1090; (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1084;&#1077;&#1078;&#1076;&#1091; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;&#1084;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;),
                &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; <tt class="literal">HttpSession</tt> &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1072;&#1083;&#1072;, &#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; 
                &#1101;&#1090;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;. &#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; (<tt class="literal">Session</tt>) &#1090;&#1072;&#1082; &#1078;&#1077; (&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;)
                &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1096;&#1083;&#1084; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1080; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1074;&#1089;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; 
                &#1080;&#1084;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1089;&#1090;&#1072;&#1090;&#1077;&#1075;&#1080;&#1102; &#1086;&#1090;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1094;&#1080;&#1082;&#1083;&#1086;&#1074; 
                &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;/&#1086;&#1090;&#1074;&#1077;&#1090;. &#1069;&#1090;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1089;&#1077;&#1089;&#1089;&#1080;&#1103; &#1090;&#1072;&#1082; &#1078;&#1077; &#1089;&#1086; 
                &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1077;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1096;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; (&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; 
                &#1089;&#1077;&#1089;&#1089;&#1080;&#1103;&#1084;&#1080;).
            </p></div><div class="sect2" lang="ru"><div class="titlepage"><div><div><h3 class="title"><a name="transactions-optimistic-detached"></a>10.4.2. &#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1077;&#1089;&#1089;&#1080;&#1081; &#1089; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;</h3></div></div><div></div></div><p>
                &#1050;&#1072;&#1078;&#1076;&#1086;&#1077; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1089; &#1087;&#1077;&#1088;&#1089;&#1080;&#1089;&#1090;&#1077;&#1085;&#1090;&#1085;&#1099;&#1084; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077;&#1084; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1085;&#1086;&#1074;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;.
                &#1053;&#1077;&#1089;&#1084;&#1086;&#1090;&#1088;&#1103; &#1085;&#1072; &#1101;&#1090;&#1086;, &#1086;&#1076;&#1085;&#1080; &#1080; &#1090;&#1077; &#1078;&#1077; &#1087;&#1077;&#1088;&#1089;&#1080;&#1089;&#1090;&#1077;&#1085;&#1090;&#1085;&#1099;&#1077; &#1101;&#1082;&#1079;&#1077;&#1087;&#1083;&#1103;&#1088;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; 
                &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1084;&#1072;&#1085;&#1080;&#1087;&#1091;&#1083;&#1080;&#1088;&#1091;&#1077;&#1090; &#1086;&#1090;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; (detached) 
                &#1101;&#1082;&#1079;&#1077;&#1087;&#1083;&#1103;&#1088;&#1072;&#1084;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1099; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1077;&#1081;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1080;&#1088;&#1091;&#1077;&#1090; 
                &#1080;&#1093; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1103; <tt class="literal">Session.update()</tt> &#1080;&#1083;&#1080; <tt class="literal">Session.saveOrUpdate()</tt>.
            </p><pre class="programlisting">// foo- &#1101;&#1082;&#1079;&#1077;&#1087;&#1083;&#1103;&#1088;, &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1077;&#1081;.
foo.setProperty("bar");
session = factory.openSession();
session.saveOrUpdate(foo);
session.flush();
session.connection().commit();
session.close();</pre><p>
                &#1052;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082; &#1078;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; <tt class="literal">lock()</tt> &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; <tt class="literal">update()</tt>
                &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; <tt class="literal">LockMode.READ</tt> (&#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1091; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1074; &#1086;&#1073;&#1093;&#1086;&#1076; 
                &#1074;&#1089;&#1077;&#1093; &#1082;&#1077;&#1096;&#1077;&#1081;) &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1091;&#1074;&#1077;&#1088;&#1077;&#1085;&#1099; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1077; &#1073;&#1099;&#1083; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;.
            </p></div><div class="sect2" lang="ru"><div class="titlepage"><div><div><h3 class="title"><a name="transactions-optimistic-manual"></a>10.4.3. &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</h3></div></div><div></div></div><p>
                &#1050;&#1072;&#1078;&#1076;&#1086;&#1077; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;c&#1090;&#1089;&#1074;&#1080;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1085;&#1086;&#1074;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; (<tt class="literal">Session</tt>),
                &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1087;&#1077;&#1088;&#1089;&#1080;&#1089;&#1090;&#1085;&#1099;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1099; &#1080;&#1079; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084; &#1082;&#1072;&#1082; &#1089; &#1085;&#1080;&#1084;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;.
                &#1069;&#1090;&#1086;&#1090; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1074;&#1099;&#1085;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1089;&#1072;&#1084;&#1086;&#1084;&#1091; &#1079;&#1072;&#1073;&#1086;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1076;&#1083;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1083;&#1103;&#1094;&#1080;&#1080;
                &#1090;&#1088;&#1072;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081; (&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;-&#1078;&#1077;, Hibernate &#1074;&#1089;&#1077; &#1077;&#1097;&#1077; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074;&#1077;&#1089;&#1080;&#1080; &#1079;&#1072; &#1074;&#1072;&#1089;). &#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1077;&#1077; 
                &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1077;&#1085; &#1074; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;&#1072;&#1093; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1086;&#1085; &#1087;&#1086;&#1093;&#1086;&#1078; &#1085;&#1072; Entity EJB.
            </p><pre class="programlisting">// foo - &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; (Session)
session = factory.openSession();
int oldVersion = foo.getVersion();
session.load( foo, foo.getKey() );
if ( oldVersion!=foo.getVersion ) throw new StaleObjectStateException();
foo.setProperty("bar");
session.flush();
session.connection().commit();
session.close();</pre><p>
                &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1099; &#1086;&#1087;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1077; &#1074; &#1089;&#1088;&#1077;&#1076;&#1077; &#1089; &#1085;&#1080;&#1079;&#1082;&#1080;&#1084; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1084; &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1090;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;,
                &#1080; &#1074;&#1072;&#1084; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;
                &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1091; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;.
            </p></div></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-disconnection"></a>10.5. &#1054;&#1090;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;</h2></div></div><div></div></div><p>
            &#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1080;&#1079; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1086;&#1074; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1099;&#1096;&#1077; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1075;&#1086;
            &#1073;&#1080;&#1079;&#1085;&#1077;&#1089; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1090;&#1072;&#1082; &#1078;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1074; &#1089;&#1077;&#1073;&#1103; &#1074;&#1088;&#1077;&#1084;&#1103; &#1088;&#1072;&#1079;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;. (&#1044;&#1083;&#1103;
            &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;, &#1089;&#1077;&#1088;&#1074;&#1083;&#1077;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1090;&#1072;&#1082;&#1091;&#1102; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080;&#1102; (<tt class="literal">Session</tt>) &#1074; 
            &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1081; <tt class="literal">HttpSession</tt>.) &#1044;&#1083;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; 
            &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
        </p><div class="orderedlist"><ol type="1" compact><li><p>
                    &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; (commit) &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1102; (<tt class="literal">Transaction</tt>) &#1080;&#1083;&#1080; JDBC &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;
                    &#1080; &#1079;&#1072;&#1090;&#1077;&#1084;
                </p></li><li><p>
                    &#1086;&#1090;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1090;&#1100; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102; <tt class="literal">Session</tt> &#1086;&#1090; JDBC.
                </p></li></ol></div><p>
            &#1087;&#1077;&#1088;&#1077;&#1076; &#1090;&#1077;&#1084; &#1082;&#1072;&#1082; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;. &#1052;&#1077;&#1090;&#1086;&#1076; <tt class="literal">Session.disconnect()</tt> 
            &#1086;&#1090;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1090; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102; &#1086;&#1090; JDBC &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; JDBC &#1089;&#1086;&#1076;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1091;&#1083; (unless you provided the connection).
        </p><p>
            <tt class="literal">Session.reconnect()</tt> &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1086;&#1077; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102;.
            &#1055;&#1086;&#1089;&#1083;&#1077; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077;
            &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1083;&#1080;&#1089;&#1100;, &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; <tt class="literal">Session.lock()</tt> &#1076;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1083;&#1080;
            &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103;&#1093;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074;&#1072;&#1084; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; (lock) &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1074;&#1099;
            &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090;&#1077;.
        </p><p>
            &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
        </p><pre class="programlisting">SessionFactory sessions;
List fooList;
Bar bar;
....
Session s = sessions.openSession();

Transaction tx = null;
try {
    tx = s.beginTransaction();

    fooList = s.find(
    	"select foo from eg.Foo foo where foo.Date = current date"
        // uses db2 date function
    );
    bar = (Bar) s.create(Bar.class);

    tx.commit();
}
catch (Exception e) {
    if (tx!=null) tx.rollback();
    s.close();
    throw e;
}
s.disconnect();</pre><p>
            &#1055;&#1086;&#1079;&#1076;&#1085;&#1077;&#1077;:
        </p><pre class="programlisting">s.reconnect();

try {
    tx = s.beginTransaction();

    bar.setFooTable( new HashMap() );
    Iterator iter = fooList.iterator();
    while ( iter.hasNext() ) {
        Foo foo = (Foo) iter.next();
        s.lock(foo, LockMode.READ);    // &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1084;, &#1095;&#1090;&#1086; foo &#1085;&#1077; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1083;.
        bar.getFooTable().put( foo.getName(), foo );
    }

    tx.commit();
}
catch (Exception e) {
    if (tx!=null) tx.rollback();
    throw e;
}
finally {
    s.close();
}</pre><p>
            &#1054;&#1090;&#1089;&#1102;&#1076;&#1072; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1089;&#1074;&#1103;&#1079;&#1100; &#1084;&#1077;&#1078;&#1076;&#1091; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080; (<tt class="literal">Transaction</tt>) &#1080; &#1089;&#1077;&#1089;&#1089;&#1080;&#1077;&#1081;
            <tt class="literal">Session</tt> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1085;&#1086;&#1075;&#1080;&#1077;-&#1082;-&#1086;&#1076;&#1085;&#1086;&#1084;&#1091;. &#1057;&#1077;&#1089;&#1089;&#1080;&#1103; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081;
            &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1058;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1101;&#1090;&#1086; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1085;&#1072;
            &#1072;&#1090;&#1086;&#1084;&#1072;&#1088;&#1085;&#1099;&#1077; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; (unit-of-work).
        </p></div><div class="sect1" lang="ru"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="transactions-locking"></a>10.6. &#1055;&#1077;&#1089;&#1089;&#1080;&#1084;&#1080;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072;</h2></div></div><div></div></div><p>
            &#1047;&#1076;&#1077;&#1089;&#1100; &#1085;&#1077; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1095;&#1090;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1090;&#1072;&#1088;&#1090;&#1103;&#1090; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1085;&#1072; &#1073;&#1077;&#1089;&#1087;&#1086;&#1082;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086; &#1087;&#1086;&#1074;&#1086;&#1076;&#1091; 
            &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1081; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1091;&#1082;&#1079;&#1072;&#1090;&#1100; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1080;&#1079;&#1086;&#1083;&#1103;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; JDBC &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;
            &#1080; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090;&#1100; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1074;&#1089;&#1102; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;. &#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1085;&#1091;&#1090;&#1099;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1080; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093;
            &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1093;&#1086;&#1090;&#1103;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1087;&#1077;&#1089;&#1089;&#1080;&#1084;&#1080;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1102; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;, &#1080;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1074; 
            &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1085;&#1086;&#1074;&#1086;&#1081; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;.
        </p><p>
            Hibernate &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1075; &#1084;&#1077;&#1093;&#1085;&#1072;&#1080;&#1079;&#1084;&#1099; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1086;&#1085; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1091;&#1077;&#1090;
            &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;!
        </p><p>
            &#1050;&#1083;&#1072;&#1089;&#1089; <tt class="literal">LockMode</tt> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1091;&#1088;&#1086;&#1074;&#1085;&#1080; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100;
            &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; Hibernate. &#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1072;&#1084;&#1080;:
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    <tt class="literal">LockMode.WRITE</tt> &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1075;&#1076;&#1072; Hiberante &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1090; &#1080;&#1083;&#1080; 
                    &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094;.
                </p></li><li><p>
                    <tt class="literal">LockMode.UPGRADE</tt> &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085; &#1087;&#1088;&#1080; &#1103;&#1074;&#1085;&#1086;&#1084; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;
                    &#1087;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1077;&#1085;&#1080;&#1080; <tt class="literal">SELECT ... FOR UPDATE</tt> &#1076;&#1083;&#1103; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
                    &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;.
                </p></li><li><p>
                    <tt class="literal">LockMode.UPGRADE_NOWAIT</tt> &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085; &#1087;&#1088;&#1080; &#1103;&#1074;&#1085;&#1086;&#1084; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;
                    &#1076;&#1083;&#1103; <tt class="literal">SELECT ... FOR UPDATE NOWAIT</tt> &#1074; Oracle.
                </p></li><li><p>
                    <tt class="literal">LockMode.READ</tt> &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1082;&#1086;&#1075;&#1076;&#1072; Hibernate &#1095;&#1080;&#1090;&#1072;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;
                    &#1087;&#1086;&#1076; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;&#1084;&#1080; &#1080;&#1079;&#1086;&#1083;&#1103;&#1094;&#1080;&#1080; Repeatable Read &#1080;&#1083;&#1080; Serializable. &#1052;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085; &#1103;&#1074;&#1085;&#1099;&#1084;
                    &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;.
                </p></li><li><p>
            <tt class="literal">LockMode.NONE</tt> &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1074;&#1080;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;. &#1042;&#1089;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;
            &#1101;&#1090;&#1086;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;. &#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1089;&#1077;&#1089;&#1089;&#1080;&#1077;&#1081; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; 
            <tt class="literal">update()</tt> &#1080;&#1083;&#1080; <tt class="literal">saveOrUpdate()</tt> &#1090;&#1072;&#1082; &#1078;&#1077; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1101;&#1090;&#1086;&#1090;
            &#1088;&#1077;&#1078;&#1080;&#1084; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;. 
        </p></li></ul></div><p>
            "&#1071;&#1074;&#1085;&#1099;&#1081; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;" &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074;:
        </p><div class="itemizedlist"><ul type="disc" compact><li><p>
                    &#1042;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; <tt class="literal">Session.load()</tt> &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077;&#1084; <tt class="literal">LockMode</tt>.
                </p></li><li><p>
                    &#1042;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; <tt class="literal">Session.lock()</tt>.
                </p></li><li><p>
                    &#1042;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; <tt class="literal">Query.setLockMode()</tt>.
                </p></li></ul></div><p>
            &#1045;&#1089;&#1083;&#1080; <tt class="literal">Session.load()</tt> &#1073;&#1099;&#1083; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1089; <tt class="literal">UPGRADE</tt> &#1080;&#1083;&#1080;
            <tt class="literal">UPGRADE_NOWAIT</tt>, &#1080; &#1079;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1077;&#1097;&#1077; &#1085;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085; &#1074; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102;
            &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <tt class="literal">SELECT ... FOR UPDATE</tt>.
            &#1045;&#1089;&#1083;&#1080; <tt class="literal">load()</tt> &#1073;&#1099;&#1083; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1076;&#1083;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1078;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085; &#1074; &#1089;&#1077;&#1089;&#1089;&#1080;&#1102;
            &#1089; &#1084;&#1077;&#1085;&#1077;&#1077; &#1089;&#1090;&#1086;&#1075;&#1086;&#1081; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1086;&#1081; &#1095;&#1077;&#1084; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1077;, Hibernate &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; <tt class="literal">lock()</tt>
            &#1076;&#1083;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;.
        </p><p>
            <tt class="literal">Session.lock()</tt> &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1091; &#1085;&#1086;&#1084;&#1077;&#1088;&#1072; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1077;&#1089;&#1083;&#1080; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072;
            &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1082;&#1072;&#1082; <tt class="literal">READ</tt>, <tt class="literal">UPGRADE</tt> &#1080;&#1083;&#1080;
            <tt class="literal">UPGRADE_NOWAIT</tt>. (&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; <tt class="literal">UPGRADE</tt> &#1080;&#1083;&#1080; 
            <tt class="literal">UPGRADE_NOWAIT</tt>, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; <tt class="literal">SELECT ... FOR UPDATE</tt>.)
        </p><p>
            &#1045;&#1089;&#1083;&#1080; &#1073;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1079;&#1072;&#1087;&#1088;&#1072;&#1096;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;, Hibernate &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;
            &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084; (&#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1094;&#1080;&#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103;). &#1069;&#1090;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;
            &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1073;&#1072;&#1079;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
        </p></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="manipulatingdata.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><td width="20%" align="center"><a accesskey="u" href="index.html">&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1074;&#1099;&#1096;&#1077;</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="queryhql.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">&#1043;&#1083;&#1072;&#1074;&#1072; 9. Manipulating Persistent Data&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top">&nbsp;&#1043;&#1083;&#1072;&#1074;&#1072; 11. HQL: &#1071;&#1079;&#1099;&#1082; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; Hibernate (The Hibernate Query Language)</td></tr></table></div></body></html>